--符卡日文
local scJp = {}

scJp["博丽灵梦"] = {}
scJp["博丽灵梦"]["红魔乡"] = {
    ["1"] = "霊符「夢想封印」",
    ["2"] = "夢符「封魔陣」"
}
scJp["博丽灵梦"]["妖妖梦"] = {
    ["1"] = "霊符「夢想封印　散」",
    ["2"] = "霊符「夢想封印　集」",
    ["3"] = "夢符「封魔陣」",
    ["4"] = "夢符「二重結界」"
}
scJp["博丽灵梦"]["萃梦想"] = {
    ["1"] = "霊符「夢想妙珠」",
    ["2"] = "神霊「夢想封印」",
    ["3"] = "夢符「封魔陣」",
    ["4"] = "神技「八方鬼縛陣」",
    ["5"] = "宝符「陰陽宝玉」",
    ["6"] = "宝具「陰陽鬼神玉」",
    ["7"] = "符の壱「夢想妙珠連」",
    ["8"] = "符の弐「陰陽散華」",
    ["9"] = "符の参「魔浄閃結」",
    ["10"] = "力符「陰陽玉将」",
    ["11"] = "夢戦「幻想之月」",
    ["12"] = "無題「空を飛ぶ不思議な巫女」"
}
scJp["博丽灵梦"]["永夜抄"] = {
    ["1"] = "霊符「夢想妙珠」",
    ["2"] = "神霊「夢想封印　瞬」",
    ["3"] = "夢符「二重結界」",
    ["4"] = "夢境「二重大結界」",
    ["5"] = "霊符「夢想封印　散」",
    ["6"] = "散霊「夢想封印　寂」",
    ["7"] = "夢符「封魔陣」",
    ["8"] = "神技「八方鬼縛陣」",
    ["9"] = "神技「八方龍殺陣」",
    ["10"] = "霊符「夢想封印　集」",
    ["11"] = "回霊「夢想封印　侘」",
    ["12"] = "境界「二重弾幕結界」",
    ["13"] = "大結界「博麗弾幕結界」",
    ["14"] = "神霊「夢想封印　瞬」",
    ["15"] = "「夢想天生」"
}
scJp["博丽灵梦"]["花映塚"] = {
    ["1"] = "霊符「陰陽印」",
    ["2"] = "霊符「夢想封印」",
    ["3"] = "霊符「博麗幻影」"
}
scJp["博丽灵梦"]["绯想天"] = {
    ["1"] = "祈願「厄除け祈願」",
    ["2"] = "宝符「躍る陰陽玉」",
    ["3"] = "夢境「二重大結界」",
    ["4"] = "光霊「神霊宝珠」",
    ["5"] = "「境界の内側に潜む霊と不思議な巫女」",
    ["6"] = "霊符「夢想妙珠」",
    ["7"] = "神霊「夢想封印」",
    ["8"] = "神技「八方鬼縛陣」",
    ["9"] = "珠符「明珠暗投」",
    ["10"] = "宝符「陰陽宝玉」",
    ["11"] = "宝具「陰陽鬼神玉」",
    ["12"] = "神技「天覇風神脚」",
    ["13"] = "「夢想天生」"
}
scJp["博丽灵梦"]["地灵殿"] = {
    ["1"] = "非常識の裏側",
    ["2"] = "「萃霊花」",
    ["3"] = "「鴉の闇」"
}
scJp["博丽灵梦"]["星莲船"] = {
    ["1"] = "夢符「退魔符乱舞」",
    ["2"] = "霊符「夢想封印」"
}
scJp["博丽灵梦"]["非想天则"] = {
    ["1"] = "御守「妖怪足止めお守り」",
    ["2"] = "霊符「夢想封印　円」",
    ["3"] = "神霊「夢想封印　瞬」",
    ["4"] = "「最も凶悪なびっくり巫女玉」",
    ["5"] = "夢符「封魔陣」",
    ["6"] = "結界「拡散結界」"
}
scJp["博丽灵梦"]["文花帖DS"] = {
    ["1"] = "お札「新聞拡張団調伏」",
    ["2"] = "結界「パパラッチ撃退結界」",
    ["3"] = "夢符「夢想亜空穴」"
}
scJp["博丽灵梦"]["神灵庙"] = {
    ["1"] = "霊符「夢想封印」"
}
scJp["博丽灵梦"]["心绮楼"] = {
    ["1"] = "御札「神社繁盛祈願札」",
    ["2"] = "御札「夢幻の高速祈願札」",
    ["3"] = "御札「対妖怪方位除」",
    ["4"] = "「信仰心増大祈願の儀」",
    ["5"] = "「二大宗教九字護身法」",
    ["6"] = "「面霊気大調伏」",
    ["7"] = "「最後のトリニティリリージョン」",
    ["8"] = "霊符「夢想封印」",
    ["9"] = "宝具「陰陽飛鳥井」",
    ["10"] = "神技「八方龍殺陣」",
    ["11"] = "「夢想天生」"
}
scJp["博丽灵梦"]["辉针城"] = {
    ["1"] = "妖器「無慈悲なお祓い棒」",
    ["2"] = "霊符「夢想封印」"
}
scJp["博丽灵梦"]["天邪鬼"] = {
    ["1"] = "神籤「反則結界」",
    ["2"] = "「パスウェイジョンニードル」"
}
scJp["博丽灵梦"]["天邪鬼GR"] = {
    ["1"] = "「反則結界」",
    ["2"] = "「天国にいちばん近いお賽銭」",
    ["3"] = "「だんまく長者」"
}
scJp["博丽灵梦"]["深秘录"] = {
    ["1"] = "霊符「夢想封印」",
    ["2"] = "神技「八方龍殺陣」",
    ["3"] = "宝具「陰陽飛鳥井」",
    ["4"] = "＊あんな隙間に巫女がいるなんて！＊",
    ["5"] = "結界「至る所の青山」",
    ["6"] = "針符「月卿を封じる針」",
    ["7"] = "結界「乱暴な世界の裂け目」",
    ["8"] = "結界「幻想バウンダリークラック」"
}
scJp["博丽灵梦"]["绀珠传"] = {
    ["1"] = "霊符「夢想封印」"
}
scJp["博丽灵梦"]["凭依华"] = {
    ["1"] = "霊符「夢想封印」",
    ["2"] = "神技「八方龍殺陣」",
    ["3"] = "宝具「陰陽飛鳥井」",
    ["4"] = "＊あんな隙間に巫女がいるなんて！＊",
    ["5"] = "霊鷹符「鷹による夢想封印ハンティング」",
    ["6"] = "風霊符「磐舟かわらけ封印」",
    ["7"] = "星霊符「スプリンクルスター封印」",
    ["8"] = "雷霊符「務光の雷弾夢想封印」",
    ["9"] = "龍蹴符「ドラゴンズ飛鳥井キック」",
    ["10"] = "針星符「月卿を封じる針スパーク」",
    ["11"] = "「この何度目かの命、夢想封印されるまで」",
    ["12"] = "霊符「夢想封印　夢限」",
    ["13"] = "「完全憑依と夢想封印」",
    ["14"] = "「憑坐マスターと神霊スレイブの境界」",
    ["15"] = "「最強最良の異変解決巫女」"
}
scJp["博丽灵梦"]["天空璋"] = {
    ["1"] = "霊符「夢想桜花封印」"
}
scJp["博丽灵梦"]["儚月抄"] = {
    ["1"] = "「大禍津日」"
}
scJp["博丽灵梦"]["东方LWC"] = {
    ["1"] = "夢符「幻想一重」"
}

scJp["雾雨魔理沙"] = {}
scJp["雾雨魔理沙"]["红魔乡"] = {
    ["1"] = "魔符「スターダストレヴァリエ」",
    ["2"] = "恋符「マスタースパーク」"
}
scJp["雾雨魔理沙"]["妖妖梦"] = {
    ["1"] = "魔符「スターダストレヴァリエ」",
    ["2"] = "魔符「ミルキーウェイ」",
    ["3"] = "恋符「ノンディレクショナルレーザー」",
    ["4"] = "恋符「マスタースパーク」"
}
scJp["雾雨魔理沙"]["萃梦想"] = {
    ["1"] = "恋符「マスタースパーク」",
    ["2"] = "魔砲「ファイナルスパーク」",
    ["3"] = "魔符「スターダストレヴァリエ」",
    ["4"] = "彗星「ブレイジングスター」",
    ["5"] = "儀符「オーレリーズサン」",
    ["6"] = "天儀「オーレリーズソーラーシステム」",
    ["7"] = "符の壱「スターダストレヴァリエ」",
    ["8"] = "符の弐「アステロイドベルト」",
    ["9"] = "符の参「マスタースパーク」",
    ["10"] = "星符「ドラゴンメテオ」"
}
scJp["雾雨魔理沙"]["永夜抄"] = {
    ["1"] = "恋符「マスタースパーク」",
    ["2"] = "魔砲「ファイナルスパーク」",
    ["3"] = "魔符「ミルキーウェイ」",
    ["4"] = "魔空「アステロイドベルト」",
    ["5"] = "魔符「スターダストレヴァリエ」",
    ["6"] = "黒魔「イベントホライズン」",
    ["7"] = "恋符「ノンディレクショナルレーザー」",
    ["8"] = "恋風「スターライトタイフーン」",
    ["9"] = "恋符「マスタースパーク」",
    ["10"] = "恋心「ダブルスパーク」",
    ["11"] = "光符「アースライトレイ」",
    ["12"] = "光撃「シュート・ザ・ムーン」",
    ["13"] = "魔砲「ファイナルスパーク」",
    ["14"] = "魔砲「ファイナルマスタースパーク」",
    ["15"] = "「ブレイジングスター」"
}
scJp["雾雨魔理沙"]["花映塚"] = {
    ["1"] = "魔符「スターダスト」",
    ["2"] = "魔符「スターダストレヴァリエ」",
    ["3"] = " 魔符「イリュージョンスター」"
}
scJp["雾雨魔理沙"]["绯想天"] = {
    ["1"] = "星符「ポラリスユニーク」",
    ["2"] = "天儀「オーレリーズユニバース」",
    ["3"] = "邪恋「実りやすいマスタースパーク」",
    ["4"] = "恋符「マスタースパーク」",
    ["5"] = "星符「ドラゴンメテオ」",
    ["6"] = "魔符「スターダストレヴァリエ」",
    ["7"] = "魔砲「ファイナルスパーク」",
    ["8"] = "彗星「ブレイジングスター」",
    ["9"] = "星符「エスケープベロシティ」",
    ["10"] = "星符「メテオニックシャワー」",
    ["11"] = "光符「ルミネスストライク」",
    ["12"] = "仪符「オーレリーズサン」",
    ["13"] = "邪恋「実りやすいマスタースパーク」"
}
scJp["雾雨魔理沙"]["地灵殿"] = {
    ["1"] = "「リモートサクリファイス」",
    ["2"] = "「ファイブシーズン」",
    ["3"] = "「オプティカルカモフラージュ」"
}
scJp["雾雨魔理沙"]["星莲船"] = {
    ["1"] = "恋符「マスタースパーク」",
    ["2"] = "魔符「アルティメットショートウェーブ」"
}
scJp["雾雨魔理沙"]["非想天则"] = {
    ["1"] = "星符「エキセントリックアステロイド」",
    ["2"] = "流光「シューティングエコー」",
    ["3"] = "魔符「マジカルＲ３６０」",
    ["4"] = "星符「グラビティビート」",
    ["5"] = "光符「アースライトレイ」",
    ["6"] = "恋符「ノンディレクショナルレーザー」",
    ["7"] = "魔廃「ディープエコロジカルボム」"
}
scJp["雾雨魔理沙"]["文花帖DS"] = {
    ["1"] = "星符「オールトクラウド」",
    ["2"] = "天儀「オーレリーズソーラーシステム」",
    ["3"] = "彗星「ブレイジングスター」"
}
scJp["雾雨魔理沙"]["大战争"] = {
    ["1"] = "光符「ミステリアスビーム」",
    ["2"] = "光撃「シュート・ザ・リトルムーン」",
    ["3"] = "魔弾「テストスレイブ」",
    ["4"] = "闭符「ビッグクランチ」",
    ["5"] = "恋符「マスタースパークのような懐中電灯」",
    ["6"] = "魔开「オープンユニバース」",
    ["7"] = "魔十字「グランドクロス」",
    ["8"] = "流星「スーパーペルセイド」",
    ["9"] = "「ブレイジングスターのような鬼ごっこ」",
    ["10"] = "「妖精尽滅光」"
}
scJp["雾雨魔理沙"]["神灵庙"] = {
    ["1"] = "恋符「マスタースパーク」"
}
scJp["雾雨魔理沙"]["心绮楼"] = {
    ["1"] = "恋符「マスタースパーク」",
    ["2"] = "彗星「ブレイジングスター」",
    ["3"] = "星符「サテライトイリュージョン」",
    ["4"] = "「サングレイザー」",
    ["5"] = "星符「ミリ秒パルサー」",
    ["6"] = "魔符「ブレイズアウェイ」"
}
scJp["雾雨魔理沙"]["辉针城"] = {
    ["1"] = "妖器「ダークスパーク」",
    ["2"] = "マジックアブソーバー"
}
scJp["雾雨魔理沙"]["天邪鬼"] = {
    ["1"] = "恋符「ワイドマスター」",
    ["2"] = "恋符「マシンガンスパーク」"
}
scJp["雾雨魔理沙"]["深秘录"] = {
    ["1"] = "恋符「マスタースパーク」",
    ["2"] = "彗星「ブレイジングスター」",
    ["3"] = "星符「サテライトイリュージョン」",
    ["4"] = "＊ステキ！厠の花子さん！＊",
    ["5"] = "星符「オカルテイション」",
    ["6"] = "＊呪われた歴代校長の肖像＊",
    ["7"] = "＊夜の学校怪談行脚＊"
}
scJp["雾雨魔理沙"]["绀珠传"] = {
    ["1"] = "恋符「マスタースパーク」"
}
scJp["雾雨魔理沙"]["凭依华"] = {
    ["1"] = "恋符「マスタースパーク」",
    ["2"] = "彗星「ブレイジングスター」",
    ["3"] = "星符「サテライトイリュージョン」",
    ["4"] = "＊ステキ！厠の花子さん！＊",
    ["5"] = "星恋符「スプリンクルスター＆ハート」",
    ["6"] = "拳星符「入道叢雲スレイブスパーク」",
    ["7"] = "星霊符「スプリンクルスター封印」",
    ["8"] = "針星符「月卿を封じる針スパーク」",
    ["9"] = "星符「アステロイドベルトナイトメア」"
}
scJp["雾雨魔理沙"]["天空璋"] = {
    ["1"] = "恋符「マスタースパークフローズン」"
}
scJp["雾雨魔理沙"]["儚月抄"] = {
    ["1"] = "「スターダストレヴァリエ」",
    ["2"] = "「イベントホライズン」",
    ["3"] = "「ファイナルスパーク」",
    ["4"] = "「ダブルスパーク」"
}

scJp["露米娅"] = {}
scJp["露米娅"]["红魔乡"] = {
    ["1"] = "月符「ムーンライトレイ」",
    ["2"] = "夜符「ナイトバード」",
    ["3"] = "闇符「ディマーケイション」"
}
scJp["露米娅"]["文花帖"] = {
    ["1"] = "闇符「ダークサイドオブザムーン」",
    ["2"] = "夜符「ミッドナイトバード」"
}

scJp["琪露诺"] = {}
scJp["琪露诺"]["红魔乡"] = {
    ["1"] = "氷符「アイシクルフォール」",
    ["2"] = "雹符「ヘイルストーム」",
    ["3"] = "凍符「パーフェクトフリーズ」",
    ["4"] = "雪符「ダイアモンドブリザード」"
}
scJp["琪露诺"]["妖妖梦"] = {
    ["1"] = "凍符「フリーズアクトレス」",
    ["2"] = "霜符「フロストコラムス」"
}
scJp["琪露诺"]["花映塚"] = {
    ["1"] = "凍符「パーフェクトフリーズ」",
    ["2"] = "凍符「コールドディヴィニティー」"
}
scJp["琪露诺"]["文花帖"] = {
    ["1"] = "雪符「ダイヤモンドブリザード」",
    ["2"] = "凍符「マイナスＫ」"
}
scJp["琪露诺"]["非想天则"] = {
    ["1"] = "氷符「アイシクルフォール」",
    ["2"] = "凍符「マイナスＫ」",
    ["3"] = "氷符「アイシクルマシンガン」",
    ["4"] = "氷符「フェアリースピン」",
    ["5"] = "氷塊「コールドスプリンクラー」",
    ["6"] = "冷体「スーパーアイスキック」",
    ["7"] = "氷符「ソードフリーザー」",
    ["8"] = "凍符「フリーズアトモスフェア」",
    ["9"] = "冷符「瞬間冷凍ビーム」",
    ["10"] = "霜符「フロストコラムス」",
    ["11"] = "吹氷「アイストルネード」",
    ["12"] = "凍符「パーフェクトフリーズ」",
    ["13"] = "氷塊「グレートクラッシャー」"
}
scJp["琪露诺"]["大战争"] = {
    ["1"] = "パーフェクトフリーズ"
}
scJp["琪露诺"]["辉针城"] = {
    ["1"] = "氷符「アルティメットブリザード」"
}
scJp["琪露诺"]["天邪鬼"] = {
    ["1"] = "氷符「パーフェクトグレーシェリスト」",
    ["2"] = "氷王「フロストキング」"
}
scJp["琪露诺"]["天空璋"] = {
    ["1"] = "氷符「クールサンフラワー」"
}

scJp["红美铃"] = {}
scJp["红美铃"]["红魔乡"] = {
    ["1"] = "華符「芳華絢爛」",
    ["2"] = "華符「セラギネラ９」",
    ["3"] = "虹符「彩虹の風鈴」",
    ["4"] = "幻符「華想夢葛」",
    ["5"] = "彩符「彩雨」",
    ["6"] = "彩符「彩光乱舞」",
    ["7"] = "彩符「極彩颱風」"
}
scJp["红美铃"]["萃梦想"] = {
    ["1"] = "彩符「彩光風鈴」",
    ["2"] = "光符「華光玉」",
    ["3"] = "華符「破山砲」",
    ["4"] = "極彩「彩光乱舞」",
    ["5"] = "極光「華厳明星」",
    ["6"] = "三華「崩山彩極砲」"
}
scJp["红美铃"]["文花帖"] = {
    ["1"] = "華符「彩光蓮華掌」",
    ["2"] = "彩翔「飛花落葉」",
    ["3"] = "彩華「虹色太極拳」"
}
scJp["红美铃"]["非想天则"] = {
    ["1"] = "彩符「極彩沛雨」",
    ["2"] = "彩翔「飛花落葉」",
    ["3"] = "彩符「彩光風鈴」",
    ["4"] = "虹符「烈虹真拳」",
    ["5"] = "気符「星脈弾」",
    ["6"] = "撃符「大鵬拳」",
    ["7"] = "気符「地龍天龍脚」",
    ["8"] = "極彩「彩光乱舞」",
    ["9"] = "彩華「虹色太極拳」",
    ["10"] = "気符「猛虎内勁」",
    ["11"] = "星気「星脈地転弾」",
    ["12"] = "熾撃「大鵬墜撃拳」",
    ["13"] = "華符「彩光蓮華掌」"
}

scJp["帕秋莉"] = {}
scJp["帕秋莉"]["萃梦想"] = {
    ["1"] = "火金符「セントエルモピラー」",
    ["2"] = "土水符「ノエキアンデリュージュ」",
    ["3"] = "金木符「エレメンタルハーベスター」",
    ["4"] = "日符「ロイヤルフレア」",
    ["5"] = "月符「サイレントセレナ」",
    ["6"] = "火水木金土符「賢者の石」",
    ["7"] = "符の壱「セントエルモエクスプロージョン」",
    ["8"] = "符の弐「デリュージュフォーティディ」",
    ["9"] = "金土符「ジンジャガスト」"
}
scJp["帕秋莉"]["文花帖"] = {
    ["1"] = "日＆水符「ハイドロジェナスプロミネンス」",
    ["2"] = "水＆火符「フロギスティックレイン」",
    ["3"] = "月＆木符「サテライトヒマワリ」",
    ["4"] = "日＆月符「ロイヤルダイヤモンドリング」"
}
scJp["帕秋莉"]["绯想天"] = {
    ["1"] = "火金符「セントエルモピラー」",
    ["2"] = "土水符「ノエキアンデリュージュ」",
    ["3"] = "金木符「エレメンタルハーベスター」",
    ["4"] = "日符「ロイヤルフレア」",
    ["5"] = "月符「サイレントセレナ」",
    ["6"] = "火水木金土符「賢者の石」",
    ["7"] = "水符「ジェリーフィッシュプリンセス」",
    ["8"] = "月木符「サテライトヒマワリ」",
    ["9"] = "日木符「フォトシンセシス」",
    ["10"] = "火符「アキバサマー」",
    ["11"] = "水符「ジェリーフィッシュプリンセス」",
    ["12"] = "月金符「サンシャインリフレクター」"
}
scJp["帕秋莉"]["非想天则"] = {
    ["1"] = "火水符「フロギスティックピラー」",
    ["2"] = "土金符「エメラルドメガロポリス」",
    ["3"] = "日月符「ロイヤルダイアモンドリング」",
    ["4"] = "火符「リングオブアグニ」",
    ["5"] = "水符「プリンセスウンディネ」"
}

scJp["十六夜咲夜"] = {}
scJp["十六夜咲夜"]["红魔乡"] = {
    ["1"] = "奇術「ミスディレクション」",
    ["2"] = "奇術「幻惑ミスディレクション」",
    ["3"] = "幻在「クロックコープス」",
    ["4"] = "幻幽「ジャック·ザ·ルドビレ」",
    ["5"] = "幻象「ルナクロック」",
    ["6"] = "幻世「ザ·ワールド」",
    ["7"] = "メイド秘技「操りドール」",
    ["8"] = "メイド秘技「殺人ドール」",
    ["9"] = "奇術「エターナルミーク」"
}
scJp["十六夜咲夜"]["妖妖梦"] = {
    ["1"] = "幻符「インディスクリミネイト」",
    ["2"] = "幻符「殺人ドール」",
    ["3"] = "時符「パーフェクトスクウェア」",
    ["4"] = "時符「プライベートスクウェア」"
}
scJp["十六夜咲夜"]["萃梦想"] = {
    ["1"] = "幻符「殺人ドール」",
    ["2"] = "幻葬「夜霧の幻影殺人鬼」",
    ["3"] = "時符「プライベートスクウェア」",
    ["4"] = "「咲夜の世界」",
    ["5"] = "傷符「インスクライブレッドソウル」",
    ["6"] = "傷魂「ソウルスカルプチュア」",
    ["7"] = "符の壱「連続殺人ドール」",
    ["8"] = "符の弐「チェックメイド」",
    ["9"] = "戏法「クロースアップ殺人鬼」"
}
scJp["十六夜咲夜"]["永夜抄"] = {
    ["1"] = "幻符「殺人ドール」",
    ["2"] = "幻葬「夜霧の幻影殺人鬼」",
    ["3"] = "「デフレーションワールド」"
}
scJp["十六夜咲夜"]["花映塚"] = {
    ["1"] = "時符「プライベートヴィジョン」",
    ["2"] = "時符「ミステリアスジャック」"
}
scJp["十六夜咲夜"]["文花帖"] = {
    ["1"] = "時符「トンネルエフェクト」",
    ["2"] = "空虚「インフレーションスクウェア」",
    ["3"] = "銀符「パーフェクトメイド」"
}
scJp["十六夜咲夜"]["绯想天"] = {
    ["1"] = "幻符「殺人ドール」",
    ["2"] = "時符「プライベートスクウェア」",
    ["3"] = "傷符「インスクライブレッドソウル」",
    ["4"] = "幻葬「夜霧の幻影殺人鬼」",
    ["5"] = "「咲夜の世界」",
    ["6"] = "傷魂「ソウルスカルプチュア」",
    ["7"] = "銀符「シルバーバウンド」",
    ["8"] = "奇術「エターナルミーク」",
    ["9"] = "速符「ルミネスリコシェ」",
    ["10"] = "時符「咲夜特製ストップウォッチ」",
    ["11"] = "銀符「シルバーバウンド」",
    ["12"] = "時符「咲夜特製ストップウォッチ」",
    ["13"] = "幻術「マイナイフリカージョン」",
    ["14"] = "時符「シルバーアキュート360」"
}
scJp["十六夜咲夜"]["非想天则"] = {
    ["1"] = "時符「イマジナリバーチカルタイム」",
    ["2"] = "時計「ルナダイアル」",
    ["3"] = "光速「Ｃ．リコシェ」"
}
scJp["十六夜咲夜"]["辉针城"] = {
    ["1"] = "妖器「银色のアナザーディメンジョン」",
    ["2"] = "时符「デュアルバニッシュ」"
}
scJp["十六夜咲夜"]["天邪鬼"] = {
    ["1"] = "時符「タイムストッパー咲夜」",
    ["2"] = "時符「チェンジリングマジック」"
}
scJp["十六夜咲夜"]["儚月抄"] = {
    ["1"] = " 「ルミネスリコシェ」",
    ["2"] = "「私の世界」"
}

scJp["蕾米莉亚"] = {}
scJp["蕾米莉亚"]["红魔乡"] = {
    ["1"] = "天罰「スターオブダビデ」",
    ["2"] = "神罰「幼きデーモンロード」",
    ["3"] = "冥符「紅色の冥界」",
    ["4"] = "獄符「千本の針の山」",
    ["5"] = "呪詛「ブラド・ツェペシュの呪い」",
    ["6"] = "神術「吸血鬼幻想」",
    ["7"] = "紅符「スカーレットシュート」",
    ["8"] = "紅符「スカーレットマイスタ」",
    ["9"] = "「レッドマジック」",
    ["10"] = "「紅色の幻想郷」"
}
scJp["蕾米莉亚"]["萃梦想"] = {
    ["1"] = "紅符「不夜城レッド」",
    ["2"] = "紅魔「スカーレットデビル」",
    ["3"] = "必殺「ハートブレイク」",
    ["4"] = "神槍「スピア・ザ・グングニル」",
    ["5"] = "夜符「デーモンキングクレイドル」",
    ["6"] = "夜王「ドラキュラクレイドル」",
    ["7"] = "符の壱「バッドレディスクランブル」",
    ["8"] = "符の弐「マイハートブレイク」",
    ["9"] = "符の参「ヘルカタストロフィ」",
    ["10"] = "夜符「クイーン·オブ·ミッドナイト」",
    ["11"] = "「レッドマジック」"
}
scJp["蕾米莉亚"]["永夜抄"] = {
    ["1"] = "紅符「不夜城レッド」",
    ["2"] = "紅魔「スカーレットデビル」",
    ["3"] = "「スカーレットディスティニー」"
}
scJp["蕾米莉亚"]["文花帖"] = {
    ["1"] = "魔符「全世界ナイトメア」",
    ["2"] = "紅符「ブラッディマジックスクウェア」",
    ["3"] = "紅蝙蝠「ヴァンピリッシュナイト」",
    ["4"] = "神鬼「レミリアストーカー」"
}
scJp["蕾米莉亚"]["绯想天"] = {
    ["1"] = "紅符「不夜城レッド」",
    ["2"] = "必殺「ハートブレイク」",
    ["3"] = "夜符「デーモンキングクレイドル」",
    ["4"] = "紅魔「スカーレットデビル」",
    ["5"] = "神槍「スピア・ザ・グングニル」",
    ["6"] = "夜王「ドラキュラクレイドル」",
    ["7"] = "夜符「バッドレディスクランブル」",
    ["8"] = "運命「ミゼラブルフェイト」",
    ["9"] = "運命「ミゼラブルフェイト」",
    ["10"] = "夜符「ボンバードナイト」",
    ["11"] = "蝙蝠「ヴァンパイアスウィープ」",
    ["12"] = "神鬼「レミリアストーカー」"
}
scJp["蕾米莉亚"]["非想天则"] = {
    ["1"] = "悪魔「レミリアストレッチ」",
    ["2"] = "「ミレニアムの吸血鬼」"
}
scJp["蕾米莉亚"]["天邪鬼"] = {
    ["1"] = "「フィットフルナイトメア」",
    ["2"] = "「きゅうけつ鬼ごっこ」"
}
scJp["蕾米莉亚"]["儚月抄"] = {
    ["1"] = "「クイーン·オブ·ミッドナイト」"
}

scJp["芙兰朵露"] = {}
scJp["芙兰朵露"]["红魔乡"] = {
    ["1"] = "禁忌「クランベリートラップ」",
    ["2"] = "禁忌「レーヴァテイン」",
    ["3"] = "禁忌「フォーオブアカインド」",
    ["4"] = "禁忌「カゴメカゴメ」",
    ["5"] = "禁忌「恋の迷路」",
    ["6"] = "禁弾「スターボウブレイク」",
    ["7"] = "禁弾「カタディオプトリック」",
    ["8"] = "禁弾「過去を刻む時計」",
    ["9"] = "秘弾「そして誰もいなくなるか？」",
    ["10"] = "QED「495年の波紋」"
}
scJp["芙兰朵露"]["文花帖"] = {
    ["1"] = "禁忌「フォービドゥンフルーツ」",
    ["2"] = "禁忌「禁じられた遊び」"
}

scJp["蕾蒂"] = {}
scJp["蕾蒂"]["妖妖梦"] = {
    ["1"] = "寒符「リンガリングコールド」",
    ["2"] = "冬符「フラワーウィザラウェイ」",
    ["3"] = "白符「アンデュレイションレイ」",
    ["4"] = "怪符「テーブルターニング」"
}
scJp["蕾蒂"]["文花帖"] = {
    ["1"] = "寒符「コールドスナップ」",
    ["2"] = "冬符「ノーザンウイナー」"
}

scJp["橙"] = {}
scJp["橙"]["妖妖梦"] = {
    ["1"] = "仙符「鳳凰卵」",
    ["2"] = "仙符「鳳凰展翅」",
    ["3"] = "式符「飛翔晴明」",
    ["4"] = "陰陽「道満晴明」",
    ["5"] = "陰陽「晴明大紋」",
    ["6"] = "天符「天仙鳴動」",
    ["7"] = "翔符「飛翔韋駄天」",
    ["8"] = "童符「護法天童乱舞」",
    ["9"] = "仙符「屍解永遠」",
    ["10"] = "鬼符「鬼門金神」",
    ["11"] = "方符「奇門遁甲」",
    ["12"] = "鬼符「青鬼赤鬼」",
    ["13"] = "鬼神「飛翔毘沙門天」"
}
scJp["橙"]["文花帖"] = {
    ["1"] = "星符「飛び重ね鱗」",
    ["2"] = "鬼神「鳴動持国天」",
    ["3"] = "化猫「橙」"
}

scJp["爱丽丝"] = {}
scJp["爱丽丝"]["妖妖梦"] = {
    ["1"] = "操符「乙女文楽」",
    ["2"] = "蒼符「博愛の仏蘭西人形」",
    ["3"] = "蒼符「博愛のオルレアン人形」",
    ["4"] = "紅符「紅毛の和蘭人形」",
    ["5"] = "白符「白亜の露西亜人形」",
    ["6"] = "闇符「霧の倫敦人形」",
    ["7"] = "廻符「輪廻の西蔵人形」",
    ["8"] = "雅符「春の京人形」",
    ["9"] = "咒詛「魔彩光の上海人形」",
    ["10"] = "咒詛「首吊り蓬莱人形」"
}
scJp["爱丽丝"]["萃梦想"] = {
    ["1"] = "魔符「アーティフルサクリファイス」",
    ["2"] = "魔操「リターンイナニメトネス」",
    ["3"] = "戦符「リトルレギオン」",
    ["4"] = "戦操「ドールズウォー」",
    ["5"] = "咒符「上海人形」",
    ["6"] = "咒詛「蓬莱人形」",
    ["7"] = "符の壱「アーティフルチャンター」",
    ["8"] = "符の弐「ドールクルセイダー」",
    ["9"] = "魔光「デヴィリーライトレイ」"
}
scJp["爱丽丝"]["永夜抄"] = {
    ["1"] = "魔符「アーティフルサクリファイス」",
    ["2"] = "魔操「リターンイナニメトネス」",
    ["3"] = "「グランギニョル座の怪人」"
}
scJp["爱丽丝"]["文花帖"] = {
    ["1"] = "操符「ドールズインシー」",
    ["2"] = "呪符「ストロードールカミカゼ」",
    ["3"] = "赤符「ドールミラセティ」"
}
scJp["爱丽丝"]["绯想天"] = {
    ["1"] = "魔符「アーティフルサクリファス」",
    ["2"] = "戦符「リトルレギオン」",
    ["3"] = "咒符「上海人形」",
    ["4"] = "魔操「リターンイナニメトネス」",
    ["5"] = "戦操「ドールズウォー」",
    ["6"] = "咒詛「蓬莱人形」",
    ["7"] = "偵符「シーカードールズ」",
    ["8"] = "紅符「和蘭人形」",
    ["9"] = "人形「未来文楽」",
    ["10"] = "注力「トリップワイヤー」",
    ["11"] = "足軽「スーサイドスクワッド」",
    ["12"] = "剣符「ソルジャーオブクロス」",
    ["13"] = "人形「魂のないフォークダンス」"
}
scJp["爱丽丝"]["非想天则"] = {
    ["1"] = "槍符「キューティー大千槍」",
    ["2"] = "人形「レミングスパレード」",
    ["3"] = "人形「セミオートマトン」",
    ["4"] = "騎士「ドールオブラウンドテーブル」",
    ["5"] = "犠牲「スーサイドパクト」",
    ["6"] = "試験中「レベルティターニア」",
    ["7"] = "試験中「ゴリアテ人形」"
}

scJp["骚灵三姐妹"] = {}
scJp["骚灵三姐妹"]["妖妖梦"] = {
    ["1"] = "騒符「ファントムディニング」",
    ["2"] = "騒符「ライブポルターガイスト」",
    ["3"] = "合葬「プリズムコンチェルト」",
    ["4"] = "騒葬「スティジャンリバーサイド」",
    ["5"] = "大合葬「霊車コンチェルトグロッソ」",
    ["6"] = "大合葬「霊車コンチェルトグロッソ改」",
    ["7"] = "大合葬「霊車コンチェルトグロッソ怪」"
}

scJp["露娜萨"] = {}
scJp["露娜萨"]["妖妖梦"] = {
    ["1"] = "弦奏「グァルネリ・デル・ジェス」",
    ["2"] = "神弦「ストラディヴァリウス」",
    ["3"] = "偽弦「スードストラディヴァリウス」"
}
scJp["露娜萨"]["花映塚"] = {
    ["1"] = "騒符「ノイズメランコリー」",
    ["2"] = "騒符「ルナサ・ソロライブ」"
}

scJp["梅露兰"] = {}
scJp["梅露兰"]["妖妖梦"] = {
    ["1"] = "管霊「ヒノファンタズム」",
    ["2"] = "冥管「ゴーストクリフォード」",
    ["3"] = "管霊「ゴーストクリフォード」"
}
scJp["梅露兰"]["花映塚"] = {
    ["1"] = "騒符「ソウルゴーハッピー」",
    ["2"] = "騒符「メルラン・ハッピーライブ」"
}

scJp["莉莉卡"] = {}
scJp["莉莉卡"]["妖妖梦"] = {
    ["1"] = "冥鍵「ファツィオーリ冥奏」",
    ["2"] = "鍵霊「ベーゼンドルファー神奏」"
}
scJp["莉莉卡"]["花映塚"] = {
    ["1"] = "騒符「ソウルノイズフロー」",
    ["2"] = "騒符「リリカ・ソロライブ」"
}

scJp["魂魄妖梦"] = {}
scJp["魂魄妖梦"]["妖妖梦"] = {
    ["1"] = "幽鬼剣「妖童餓鬼の断食」",
    ["2"] = "餓鬼剣「餓鬼道草紙」",
    ["3"] = "餓王剣「餓鬼十王の報い」",
    ["4"] = "獄界剣「二百由旬の一闪」",
    ["5"] = "獄炎剣「業風閃影陣」",
    ["6"] = "獄神剣「業風神閃斬」",
    ["7"] = "畜趣剣「無為無策の冥罰」",
    ["8"] = "修羅剣「現世妄執」",
    ["9"] = "人界剣「悟入幻想」",
    ["10"] = "人世剣「大悟顕晦」",
    ["11"] = "人神剣「俗諦常住」",
    ["12"] = "天上剣「天人の五衰」",
    ["13"] = "天界剣「七魄忌諱」",
    ["14"] = "天神剣「叁魂七魄」",
    ["15"] = "六道剣「一念無量劫」"
}
scJp["魂魄妖梦"]["萃梦想"] = {
    ["1"] = "人符「現世斬」",
    ["2"] = "人鬼「未来永劫斬」",
    ["3"] = "断命剣「冥想斬」",
    ["4"] = "断迷剣「迷津慈航斬」",
    ["5"] = "魂符「幽明の苦輪」",
    ["6"] = "魂魄「幽明求聞持聡明の法」",
    ["7"] = "符の壱「二重の苦輪」",
    ["8"] = "符の弐「心眼迷想斬」",
    ["9"] = "符の参「業風神閃斬」",
    ["10"] = "奥義「西行春風斬」"
}
scJp["魂魄妖梦"]["永夜抄"] = {
    ["1"] = "人符「现世斩」",
    ["2"] = "人鬼「未来永劫斩」",
    ["3"] = "「待宵反射卫星斩」"
}
scJp["魂魄妖梦"]["花映塚"] = {
    ["1"] = "迷符「缠缚剑」",
    ["2"] = "迷符「半身大悟」"
}
scJp["魂魄妖梦"]["文花帖"] = {
    ["1"] = "人智剣「天女返し」",
    ["2"] = "妄執剣「修羅の血」",
    ["3"] = "天星剣「涅槃寂静の如し」",
    ["4"] = "四生剣「衆生無性の響き」"
}
scJp["魂魄妖梦"]["绯想天"] = {
    ["1"] = "人智剣「天女返し」",
    ["2"] = "桜花剣「閃々散華」",
    ["3"] = "断想剣「草木成仏斬」",
    ["4"] = "瞑斬「楼観から弾をも断つ心の眼」",
    ["5"] = "人符「現世斬」",
    ["6"] = "断命剣「冥想斬」",
    ["7"] = "魂符「幽明の苦輪」",
    ["8"] = "人鬼「未来永劫斬」",
    ["9"] = "断迷剣「迷津慈航斬」",
    ["10"] = "魂魄「幽明求聞持聡明の法」　",
    ["11"] = "剣伎「桜花闪々」",
    ["12"] = "断霊剣「成仏得脱斬」"
}
scJp["魂魄妖梦"]["非想天则"] = {
    ["1"] = "空観剣「六根清浄斬」",
    ["2"] = "転生剣「円心流転斬」"
}
scJp["魂魄妖梦"]["神灵庙"] = {
    ["1"] = "空観剣「六根清浄斬」"
}
scJp["魂魄妖梦"]["弹幕天邪鬼"] = {
    ["1"] = "光符「冥府光芒一閃」",
    ["2"] = "彼岸剣「地獄極楽滅多斬り」"
}

scJp["西行寺幽幽子"] = {}
scJp["西行寺幽幽子"]["妖妖梦"] = {
    ["1"] = "亡郷「亡我郷 -さまよえる魂-」",
    ["2"] = "亡郷「亡我郷 -宿罪-」",
    ["3"] = "亡郷「亡我郷 -道無き道-」",
    ["4"] = "亡郷「亡我郷 -自尽-」",
    ["5"] = "亡舞「生者必滅の理 -眩惑-」",
    ["6"] = "亡舞「生者必滅の理 -死蝶-」",
    ["7"] = "亡舞「生者必滅の理 -毒蛾-」",
    ["8"] = "亡舞「生者必滅の理 -魔境-」",
    ["9"] = "華霊「ゴーストバタフライ」",
    ["10"] = "華霊「スワローテイルバタフライ」",
    ["11"] = "華霊「ディープルーティドバタフライ」",
    ["12"] = "華霊「バタフライディルージョン」",
    ["13"] = "幽曲「リポジトリ・オブ・ヒロカワ -偽霊-」",
    ["14"] = "幽曲「リポジトリ・オブ・ヒロカワ -亡霊-」",
    ["15"] = "幽曲「リポジトリ・オブ・ヒロカワ -幻霊-」",
    ["16"] = "幽曲「リポジトリ・オブ・ヒロカワ -神霊-」",
    ["17"] = "桜符「完全なる墨染の桜 -封印-」",
    ["18"] = "桜符「完全なる墨染の桜 -亡我-」",
    ["19"] = "桜符「完全なる墨染の桜 -春眠-」",
    ["20"] = "桜符「完全なる墨染の桜 -開花-」",
    ["21"] = "「反魂蝶 -一分咲-」",
    ["22"] = "「反魂蝶 -参分咲-」",
    ["23"] = "「反魂蝶 -伍分咲-」",
    ["24"] = "「反魂蝶 -八分咲-」"
}
scJp["西行寺幽幽子"]["萃梦想"] = {
    ["1"] = "死符「ギャストリドリーム」",
    ["2"] = "死蝶「華胥の永眠」",
    ["3"] = "冥符「黄泉平坂行路」",
    ["4"] = "再迷「幻想郷の黄泉還り」",
    ["5"] = "霊符「无寿の夢」",
    ["6"] = "寿命「无寿国への約束手形」",
    ["7"] = "符の壱「幽夢の胡蝶」",
    ["8"] = "符の弐「白玉楼の垂れ彼岸」",
    ["9"] = "符の参「果てしなく昔の死地」",
    ["10"] = "桜花「未練未酌宴」",
    ["11"] = "「紫(むらさき)の彼岸は遅れて輝く」"
}
scJp["西行寺幽幽子"]["永夜抄"] = {
    ["1"] = "死符「ギャストリドリーム」",
    ["2"] = "死蝶「華胥の永眠」",
    ["3"] = "「西行寺無余涅槃」"
}
scJp["西行寺幽幽子"]["文花帖"] = {
    ["1"] = "幽雅「死出の誘蛾灯」",
    ["2"] = "蝶符「鳳蝶紋の死槍」",
    ["3"] = "死符「酔人の生、死の夢幻」",
    ["4"] = "「死蝶浮月」"
}
scJp["西行寺幽幽子"]["绯想天"] = {
    ["1"] = "死符「ギャストリドリーム」",
    ["2"] = "冥符「黄泉平坂行路」",
    ["3"] = "霊符「无寿の夢」",
    ["4"] = "死蝶「華胥の永眠」",
    ["5"] = "再迷「幻想郷の黄泉還り」",
    ["6"] = "寿命「无寿国への約束手形」",
    ["7"] = "霊蝶「蝶の羽風生に暫く」",
    ["8"] = "蝶符「鳳蝶紋の死槍」",
    ["9"] = "幽雅「死出の誘蛾灯」",
    ["10"] = "幽符「冥界ミステリースポット」",
    ["11"] = "霊蝶「蝶の羽風生に暫く」",
    ["12"] = "宴会「死して全て大団円」"
}
scJp["西行寺幽幽子"]["非想天则"] = {
    ["1"] = "「反魂蝶」",
    ["2"] = "桜符「センスオブチェリーブロッサム」"
}
scJp["西行寺幽幽子"]["神灵庙"] = {
    ["1"] = "符牒「死蝶の舞」",
    ["2"] = "符牒「死蝶の舞　- 桜花 -」",
    ["3"] = "幽蝶「ゴーストスポット」",
    ["4"] = "幽蝶「ゴーストスポット　- 桜花 -」",
    ["5"] = "冥符「常夜桜」",
    ["6"] = "桜符「西行桜吹雪」",
    ["7"] = "桜符「桜吹雪地獄」"
}
scJp["西行寺幽幽子"]["弹幕天邪鬼"] = {
    ["1"] = "蝶符「花蝶風月」",
    ["2"] = "桜花「桜吹雪花小町」"
}

scJp["八云蓝"] = {}
scJp["八云蓝"]["妖妖梦"] = {
    ["1"] = "式神「仙狐思念」",
    ["2"] = "式神「十二神将の宴」",
    ["3"] = "式輝「狐狸妖怪レーザー」",
    ["4"] = " 式輝「四面楚歌チャーミング」",
    ["5"] = "式輝「プリンセス天狐 -Illusion-」",
    ["6"] = "式弾「アルティメットブディスト」",
    ["7"] = "式弾「ユーニラタルコンタクト」",
    ["8"] = "式神「橙」",
    ["9"] = "「狐狗狸さんの契約」",
    ["10"] = "幻神「飯綱権現降臨」",
    ["11"] = "式神「前鬼後鬼の守護」",
    ["12"] = "式神「憑依荼吉尼天」"
}
scJp["八云蓝"]["文花帖"] = {
    ["1"] = "密符「御大師様の秘鍵」",
    ["2"] = "行符「八千万枚護摩」",
    ["3"] = "超人「飛翔役小角」"
}

scJp["八云紫"] = {}
scJp["八云紫"]["妖妖梦"] = {
    ["1"] = "結界「夢と現の呪」",
    ["2"] = "結界「動と静の均衡」",
    ["3"] = "結界「光と闇の網目」",
    ["4"] = "罔両「ストレートとカーブの夢郷」",
    ["5"] = "罔両「八雲紫の神隠し」",
    ["6"] = "罔両「禅寺に棲む妖蝶」",
    ["7"] = "魍魎「二重黒死蝶」",
    ["8"] = "式神「八雲藍」",
    ["9"] = "「人間と妖怪の境界」",
    ["10"] = "結界「生と死の境界」",
    ["11"] = "紫奥義「弾幕結界」"
}
scJp["八云紫"]["萃梦想"] = {
    ["1"] = "境符「四重結界」",
    ["2"] = "結界「魅力的な四重結界」",
    ["3"] = "式神「八雲藍」",
    ["4"] = "式神「八雲藍＋」",
    ["5"] = "境符「二次元と三次元の境界」",
    ["6"] = "結界「客観結界」",
    ["7"] = "符の壱「四重結界」",
    ["8"] = "符の弐「八雲卍傘」",
    ["9"] = "符の参「八雲藍」　",
    ["10"] = "外力「無限の超高速飛行体」",
    ["11"] = "幻想「第一種永久機関」"
}
scJp["八云紫"]["永夜抄"] = {
    ["1"] = "境符「四重結界」",
    ["2"] = "境界「永夜四重結界」",
    ["3"] = "「深弾幕結界　-夢幻泡影-」"
}
scJp["八云紫"]["文花帖"] = {
    ["1"] = "境符「色と空の境界」",
    ["2"] = "境符「波と粒の境界」"
}
scJp["八云紫"]["绯想天"] = {
    ["1"] = "境符「四重結界」",
    ["2"] = "式神「八雲藍」",
    ["3"] = "境符「二次元と三次元の境界」",
    ["4"] = "結界「魅力的な四重結界」",
    ["5"] = "式神「橙」",
    ["6"] = "結界「客観結界」",
    ["7"] = "幻巣「飛光虫ネスト」",
    ["8"] = "空餌「中毒性のあるエサ」",
    ["9"] = "廃線「ぶらり廃駅下車の旅」",
    ["10"] = "光弾「ドップラーエフェクト」",
    ["11"] = "捌器「全てを二つに捌く物」",
    ["12"] = "幻巣「飛光虫ネスト」",
    ["13"] = "空餌「狂躁高速飛行物体」",
    ["14"] = "「八雲の巣」"
}
scJp["八云紫"]["非想天则"] = {
    ["1"] = "魔眼「ラプラスの魔」"
}
scJp["八云紫"]["天邪鬼"] = {
    ["1"] = "「不可能弾幕結界」",
    ["2"] = "「運鈍根の捕物帖」"
}
scJp["八云紫"]["凭依华"] = {
    ["1"] = "「無人廃線車両爆弾」",
    ["2"] = "式神「八雲藍&橙」",
    ["3"] = "境界「溢れ出る漂流物」",
    ["4"] = "＊その綺麗な足をくれ！＊",
    ["5"] = "「<ruby>憑坐<rt>マスター</rt></ruby>の憂鬱」",
    ["6"] = "「完全憑依と夢想封印」",
    ["7"] = "「<ruby>憑坐<rt>マスター</rt></ruby>と<ruby>神霊<rt>スレイブ</rt></ruby>の境界」",
    ["8"] = "貧符「ミスチャンススキャッター」",
    ["9"] = "「最凶最悪の極貧不幸神」"
}

scJp["伊吹萃香"] = {}
scJp["伊吹萃香"]["萃梦想"] = {
    ["1"] = "萃符「戸隠山投げ」",
    ["2"] = "萃鬼「天手力男投げ」",
    ["3"] = "酔神「鬼縛りの術」",
    ["4"] = "酔夢「施餓鬼縛りの術」",
    ["5"] = "鬼符「ミッシングパワー」",
    ["6"] = "鬼神「ミッシングパープルパワー」",
    ["7"] = "符の壱「投擲の天岩戸」",
    ["8"] = "符の弐「坤軸の大鬼」",
    ["9"] = "符の参「追儺返しブラックホール」",
    ["10"] = "鬼火「超高密度燐禍術」",
    ["11"] = "疎符「六里霧中」",
    ["12"] = "「百万鬼夜行」"
}
scJp["伊吹萃香"]["文花帖"] = {
    ["1"] = "鬼気「濛々迷霧」",
    ["2"] = "「百万鬼夜行」"
}
scJp["伊吹萃香"]["绯想天"] = {
    ["1"] = "萃符「戸隠山投げ」",
    ["2"] = "酔神「鬼缚りの術」",
    ["3"] = "鬼符「ミッシングパワー」",
    ["4"] = "萃鬼「天手力男投げ」",
    ["5"] = "酔夢「施餓鬼縛りの術」",
    ["6"] = "鬼神「ミッシングパープルパワー」",
    ["7"] = "霧符「雲集霧散」",
    ["8"] = "鬼火「超高密度燐禍術」",
    ["9"] = "鬼符「大江山悉皆殺し」",
    ["10"] = "吐息「小鬼の深呼吸」",
    ["11"] = "火弾「地霊活性弾」",
    ["12"] = "鬼神「ミッシングパープルパワー」",
    ["13"] = "鬼気「濛々迷霧」",
    ["14"] = "「百万同一鬼」"
}
scJp["伊吹萃香"]["非想天则"] = {
    ["1"] = "四天王奥義「三歩壊廃」"
}
scJp["伊吹萃香"]["文花帖DS"] = {
    ["1"] = "鬼符「豆粒大の針地獄」",
    ["2"] = "地獄「煉獄吐息」",
    ["3"] = "鬼符「ミッシングパワー」"
}
scJp["伊吹萃香"]["天邪鬼"] = {
    ["1"] = "鬼群「インプスウォーム」",
    ["2"] = "鬼群「百鬼禿童」"
}

scJp["莉格露"] = {}
scJp["莉格露"]["永夜抄"] = {
    ["1"] = "蛍符「地上の流星」",
    ["2"] = "蛍符「地上の彗星」",
    ["3"] = "灯符「ファイヤフライフェノメノン」",
    ["4"] = "蠢符「リトルバグ」",
    ["5"] = "蠢符「リトルバグストーム」",
    ["6"] = "蠢符「ナイトバグストーム」",
    ["7"] = "蠢符「ナイトバグトルネード」",
    ["8"] = "隠蟲「永夜蟄居」",
    ["9"] = "「季節外れのバタフライストーム」"
}
scJp["莉格露"]["文花帖"] = {
    ["1"] = "蛍符「地上の恒星」",
    ["2"] = "蝶符「バタフライストーム」"
}

scJp["米斯蒂娅"] = {}
scJp["米斯蒂娅"]["永夜抄"] = {
    ["1"] = "声符「梟の夜鳴声」",
    ["2"] = "声符「木菟咆哮」",
    ["3"] = "蛾符「天蛾の蠱道」",
    ["4"] = "毒符「毒蛾の鱗粉」",
    ["5"] = "猛毒「毒蛾の暗闇演舞」",
    ["6"] = "鷹符「イルスタードダイブ」",
    ["7"] = "夜盲「夜雀の歌」",
    ["8"] = "夜雀「真夜中のコーラスマスター」",
    ["9"] = "「ブラインドナイトバード」"
}
scJp["米斯蒂娅"]["花映塚"] = {
    ["1"] = "鳥符「ヒューマンケージ」",
    ["2"] = "鳥符「ヒューマンケージダブル」",
    ["3"] = "鳥符「ミステリアスソング」"
}

scJp["上白泽慧音"] = {}
scJp["上白泽慧音"]["永夜抄"] = {
    ["1"] = "産霊「ファーストピラミッド」",
    ["2"] = "始符「エフェメラリティ137」",
    ["3"] = "野符「武烈クライシス」",
    ["4"] = "野符「将門クライシス」",
    ["5"] = "野符「義満クライシス」",
    ["6"] = "野符「GHQクライシス」",
    ["7"] = "国符「三種の神器　剣」",
    ["8"] = "国符「三種の神器　玉」",
    ["9"] = "国符「三種の神器　鏡」",
    ["10"] = "国体「三種の神器　郷」",
    ["11"] = "終符「幻想天皇」",
    ["12"] = "虚史「幻想郷伝説」",
    ["13"] = "未来「高天原」",
    ["14"] = "「日出づる国の天子」",
    ["15"] = "旧史「旧秘境史　-オールドヒストリー-」",
    ["16"] = "転世「一条戻り橋」",
    ["17"] = "新史「新幻想史　-ネクストヒストリー-」",
    ["18"] = "「無何有浄化」"
}
scJp["上白泽慧音"]["文花帖"] = {
    ["1"] = "光符「アマテラス」",
    ["2"] = "包符「昭和の雨」",
    ["3"] = "葵符「水戸の光圀」",
    ["4"] = "倭符「邪馬台の国」"
}
scJp["上白泽慧音"]["天邪鬼"] = {
    ["1"] = "「２０ＸＸ年　死後の旅」",
    ["2"] = "大火「江戸のフラワー」"
}

scJp["因幡帝"] = {}
scJp["因幡帝"]["永夜抄"] = {
    ["1"] = "「エンシェントデューパー」"
}
scJp["因幡帝"]["花映塚"] = {
    ["1"] = "兎符「開運大紋」",
    ["2"] = "兎符「因幡の素兎」"
}
scJp["因幡帝"]["文花帖"] = {
    ["1"] = "脱兎「フラスターエスケープ」",
    ["2"] = "借符「大穴牟遅様の薬」"
}

scJp["铃仙"] = {}
scJp["铃仙"]["永夜抄"] = {
    ["1"] = "波符「赤眼催眠(マインドシェイカー)」",
    ["2"] = "幻波「赤眼催眠(マインドブローイング)」",
    ["3"] = "狂符「幻視調律(ビジョナリチューニング)」",
    ["4"] = "狂視「狂視調律(イリュージョンシーカー)」",
    ["5"] = "懶符「生神停止(アイドリングウェーブ)」",
    ["6"] = "懶惰「生神停止(マインドストッパー)」",
    ["7"] = "散符「真実の月(インビジブルフルムーン)」",
    ["8"] = "月眼「月兎遠隔催眠術(テレメスメリズム)」",
    ["9"] = "「幻朧月睨(ルナティックレッドアイズ)」"
}
scJp["铃仙"]["花映塚"] = {
    ["1"] = "波符「月面波紋(ルナウェーブ)」",
    ["2"] = "散符「栄華之夢(ルナメガロポリス)」"
}
scJp["铃仙"]["文花帖"] = {
    ["1"] = "散符「朧月花栞(ロケット.イン.ミスト)」",
    ["2"] = "波符「幻の月(インビジブルハーフムーン)」",
    ["3"] = "狂夢「風狂の夢(ドリームワールド)」"
}
scJp["铃仙"]["绯想天"] = {
    ["1"] = "迫符「脅迫幻覚(オブセッショナー)」",
    ["2"] = "幻弾「幻想視差(ブラフバラージ)」",
    ["3"] = "幻兎「平行交差(パラレルクロス)」",
    ["4"] = "惑視「離円花冠(カローラヴィジョン)」",
    ["5"] = "幻爆「近眼花火(マインドスターマイン)」",
    ["6"] = "幻惑「花冠視線(クラウンヴィジョン)」",
    ["7"] = "「幻朧月睨(ルナティックレッドアイズ)」",
    ["8"] = "弱心「喪心喪意(ディモチヴィエイション)」",
    ["9"] = "喪心「喪心創痍(ディスカーダー)」",
    ["10"] = "毒煙幕「瓦斯織物の玉」",
    ["11"] = "生薬「国士無双の薬」"
}
scJp["铃仙"]["非想天则"] = {
    ["1"] = "長視「赤月下(インフレアドムーン)」",
    ["2"] = "短視「超短脳波(エックスウェイブ)」",
    ["3"] = "赤眼「望見円月(ルナティックブラスト)」"
}
scJp["铃仙"]["深秘录"] = {
    ["1"] = "「月面跳弾(ルナティックダブル)」",
    ["2"] = "「幻朧月睨(ルナティックレッドアイズ)」",
    ["3"] = "「地上跳弾(ルナティックエコー)」",
    ["4"] = "＊もうお前は狂っている！＊"
}
scJp["铃仙"]["绀珠传"] = {
    ["1"] = "「障壁波動（イビルアンジュレーション）」"
}
scJp["铃仙"]["凭依华"] = {
    ["1"] = "「月面跳弾(ルナティックダブル)」",
    ["2"] = "「幻朧月睨(ルナティックレッドアイズ)」",
    ["3"] = "「地上跳弾(ルナティックエコー)」",
    ["4"] = "＊もうお前は狂っている！＊",
    ["5"] = "狂槌符「狂視幻像（ディスオーダーアイ）も大きくなあれ」",
    ["6"] = "火狂符「人体発火秘匿弾幕（バーニングヒドゥンバレット）」"
}

scJp["八意永琳"] = {}
scJp["八意永琳"]["永夜抄"] = {
    ["1"] = "天丸「壺中の天地」",
    ["2"] = "覚神「神代の記憶」",
    ["3"] = "神符「天人の系譜」",
    ["4"] = "蘇活「生命遊戯　-ライフゲーム-」",
    ["5"] = "蘇生「ライジングゲーム」",
    ["6"] = "操神「オモイカネディバイス」",
    ["7"] = "神脳「オモイカネブレイン」",
    ["8"] = "天呪「アポロ１３」",
    ["9"] = "秘術「天文密葬法」",
    ["10"] = "禁薬「蓬莱の薬」",
    ["11"] = "薬符「壺中の大銀河」",
    ["12"] = "「天網蜘網捕蝶の法」"
}
scJp["八意永琳"]["文花帖"] = {
    ["1"] = "薬符「胡蝶夢丸ナイトメア」",
    ["2"] = "練丹「水銀の海」",
    ["3"] = "秘薬「仙香玉兎」"
}

scJp["蓬莱山辉夜"] = {}
scJp["蓬莱山辉夜"]["永夜抄"] = {
    ["1"] = "難題「龍の頸の玉　-五色の弾丸-」",
    ["2"] = "神宝「ブリリアントドラゴンバレッタ」",
    ["3"] = "難題「仏の御石の鉢　-砕けぬ意思-」",
    ["4"] = "神宝「ブディストダイアモンド」",
    ["5"] = "難題「火鼠の皮衣　-焦れぬ心-」",
    ["6"] = "神宝「サラマンダーシールド」",
    ["7"] = "難題「燕の子安貝　-永命線-」",
    ["8"] = "神宝「ライフスプリングインフィニティ」",
    ["9"] = "難題「蓬莱の弾の枝　-虹色の弾幕-」",
    ["10"] = "神宝「蓬莱の玉の枝　-夢色の郷-」",
    ["11"] = "「永夜返し　-初月-」",
    ["12"] = "「永夜返し　-三日月-」",
    ["13"] = "「永夜返し　-上つ弓張-」",
    ["14"] = "「永夜返し　-待宵-」",
    ["15"] = "「永夜返し　-子の刻-」",
    ["16"] = "「永夜返し　-子の二つ-」",
    ["17"] = "「永夜返し　-子の三つ-」",
    ["18"] = "「永夜返し　-子の四つ-」",
    ["19"] = "「永夜返し　-丑の刻-」",
    ["20"] = "「永夜返し　-丑の二つ-」",
    ["21"] = "「永夜返し　-丑三つ時-」",
    ["22"] = "「永夜返し　-丑の四つ-」",
    ["23"] = "「永夜返し　-寅の刻-」",
    ["24"] = "「永夜返し　-寅の二つ-」",
    ["25"] = "「永夜返し　-寅の三つ-」",
    ["26"] = "「永夜返し　-寅の四つ-」",
    ["27"] = "「永夜返し　-朝靄-」",
    ["28"] = "「永夜返し　-夜明け-」",
    ["29"] = "「永夜返し　-明けの明星-」",
    ["30"] = "「永夜返し　-世明け-」",
    ["31"] = "「蓬莱の樹海」"
}
scJp["蓬莱山辉夜"]["文花帖"] = {
    ["1"] = "新難題「月のイルメナイト」",
    ["2"] = "新難題「エイジャの赤石」",
    ["3"] = "新難題「金閣寺の一枚天井」",
    ["4"] = "新難題「ミステリウム」"
}

scJp["藤原妹红"] = {}
scJp["藤原妹红"]["永夜抄"] = {
    ["1"] = "时効「月のいはかさの呪い」",
    ["2"] = "不死「火の鳥　-鳳翼天翔-」",
    ["3"] = "藤原「滅罪寺院傷」",
    ["4"] = "不死「徐福时空」",
    ["5"] = "滅罪「正直者の死」",
    ["6"] = "虚人「ウー」",
    ["7"] = "不滅「フェニックスの尾」",
    ["8"] = "蓬莱「凱風快晴　-フジヤマヴォルケイノ-」",
    ["9"] = "「パゼストバイフェニックス」",
    ["10"] = "「蓬莱人形」",
    ["11"] = "「インペリシャブルシューティング」",
    ["12"] = "「フェニックス再誕」"
}
scJp["藤原妹红"]["文花帖"] = {
    ["1"] = "貴人「サンジェルマンの忠告」",
    ["2"] = "蓬莱「瑞江浦嶋子と五色の瑞亀」"
}
scJp["藤原妹红"]["天邪鬼"] = {
    ["1"] = "惜命「不死身の捨て身」",
    ["2"] = "「火の鳥　‐不死伝説‐」"
}
scJp["藤原妹红"]["深秘录"] = {
    ["1"] = "焔符「自滅火焔大旋風」",
    ["2"] = "不死「凱風快晴飛翔蹴」",
    ["3"] = "呪札「無差別発火の符」",
    ["4"] = "＊こんな世は燃え尽きてしまえ！＊",
    ["5"] = "炎符「フェニックスの超高温な羽」",
    ["6"] = "＊凱風晴天快晴脚＊",
    ["7"] = "炎符「フェニックスの羽」",
    ["8"] = "爪符「デスパレートクロー」",
    ["9"] = "惜命「不死身の捨て身」",
    ["10"] = "「この何度目かの命、燃え尽きるまで」"
}
scJp["藤原妹红"]["凭依华"] = {
    ["1"] = "焔符「自滅火焔大旋風」",
    ["2"] = "不死「凱風快晴飛翔蹴」",
    ["3"] = "呪札「無差別発火の符」",
    ["4"] = "＊こんな世は燃え尽きてしまえ！＊",
    ["5"] = "化火符「妖怪弾幕変化　葉っぱ発破」",
    ["6"] = "火狂符「人体発火秘匿弾幕（バーニングヒドゥンバレット）」",
    ["7"] = "「この何度目かの命、夢想封印されるまで」"
}

scJp["射命丸文"] = {}
scJp["射命丸文"]["花映塚"] = {
    ["1"] = "風符「風神一扇」",
    ["2"] = "疾風「風神少女」"
}
scJp["射命丸文"]["风神录"] = {
    ["1"] = "岐符「天の八衢」",
    ["2"] = "岐符「サルタクロス」",
    ["3"] = "風神「風神木の葉隠れ」",
    ["4"] = "風神「天狗颪」",
    ["5"] = "風神「二百十日」",
    ["6"] = "「幻想風靡」",
    ["7"] = "「無双風神」",
    ["8"] = "塞符「山神渡御」",
    ["9"] = "塞符「天孫降臨」",
    ["10"] = "塞符「天上天下の照國」"
}
scJp["射命丸文"]["绯想天"] = {
    ["1"] = "旋符「紅葉扇風」",
    ["2"] = "竜巻「天孫降臨の道しるべ」",
    ["3"] = "逆風「人間禁制の道」",
    ["4"] = "突符「天狗のマクロバースト」",
    ["5"] = "風符「天狗道の開風」",
    ["6"] = "「幻想風靡」",
    ["7"] = "魔獣「鎌鼬ベーリング」",
    ["8"] = "突風「猿田彦の先導」",
    ["9"] = "突風「猿田彦の先導」",
    ["10"] = "旋符「飄妖扇」",
    ["11"] = "旋風「鳥居つむじ風」",
    ["12"] = "「幻想風靡」"
}
scJp["射命丸文"]["非想天则"] = {
    ["1"] = "風符「天狗報即日限」",
    ["2"] = "鴉符「暗夜のデイメア」"
}
scJp["射命丸文"]["文花帖DS"] = {
    ["1"] = "取材「射命丸文の圧迫取材」",
    ["2"] = "望遠「キャンディッドショット」",
    ["3"] = "速写「ファストショット」",
    ["4"] = "「幻想風靡」"
}
scJp["射命丸文"]["天邪鬼"] = {
    ["1"] = "写真「激撮テングスクープ」",
    ["2"] = "「瞬撮ジャーナリスト」"
}
scJp["射命丸文"]["天空璋"] = {
    ["1"] = "風符「天狗突風雨」"
}

scJp["梅蒂欣"] = {}
scJp["梅蒂欣"]["花映塚"] = {
    ["1"] = "毒符「神経の毒」",
    ["2"] = "毒符「憂鬱の毒」"
}
scJp["梅蒂欣"]["文花帖"] = {
    ["1"] = "霧符「ガシングガーデン」",
    ["2"] = "毒符「ポイズンブレス」",
    ["3"] = "譫妄「イントゥデリリウム」"
}

scJp["风见幽香"] = {}
scJp["风见幽香"]["花映塚"] = {
    ["1"] = "花符「幻想郷の開花」",
    ["2"] = "幻想「花鳥風月、嘯風弄月」"
}

scJp["小野塚小町"] = {}
scJp["小野塚小町"]["花映塚"] = {
    ["1"] = "投銭「宵越しの銭」",
    ["2"] = "死神「ヒガンルトゥール」"
}
scJp["小野塚小町"]["文花帖"] = {
    ["1"] = "死歌「八重霧の渡し」",
    ["2"] = "古雨「黄泉中有の旅の雨」",
    ["3"] = "死価「プライス.オブ.ライフ」"
}
scJp["小野塚小町"]["绯想天"] = {
    ["1"] = "舟符「河の流れのように」",
    ["2"] = "薄命「余命幾許も無し」",
    ["3"] = "霊符「何処にでもいる浮遊霊」",
    ["4"] = "死歌「八重霧の渡し」",
    ["5"] = "換命「不惜身命、可惜身命」",
    ["6"] = "恨符「未練がましい緊縛霊」",
    ["7"] = "死符「死者選別の鎌」",
    ["8"] = "地獄「無間の狭間」",
    ["9"] = "霊符「古き地縛霊の目覚め」",
    ["10"] = "死符「死者選別の鎌」",
    ["11"] = "魂符「魂の遊戯」"
}
scJp["小野塚小町"]["非想天则"] = {
    ["1"] = "魂符「生魂流離の鎌」"
}

scJp["四季映姬"] = {}
scJp["四季映姬"]["花映塚"] = {
    ["1"] = "罪符「彷徨える大罪」",
    ["2"] = "審判「ラストジャッジメント」"
}
scJp["四季映姬"]["文花帖"] = {
    ["1"] = "嘘言「タン・オブ・ウルフ」",
    ["2"] = "審判「十王裁判」",
    ["3"] = "審判「ギルティ.オア.ノットギルティ」",
    ["4"] = "審判「浄頗梨審判 -射命丸文-」"
}

scJp["秋静叶"] = {}
scJp["秋静叶"]["风神录"] = {
    ["1"] = "葉符「狂いの落葉」"
}
scJp["秋静叶"]["文花帖DS"] = {
    ["1"] = "秋符「フォーリンブラスト」",
    ["2"] = "枯道「ロストウインドロウ」"
}

scJp["秋穰子"] = {}
scJp["秋穰子"]["风神录"] = {
    ["1"] = "秋符「オータムスカイ」",
    ["2"] = "秋符「秋の空と乙女の心」",
    ["3"] = "豊符「オヲトシハーベスター」",
    ["4"] = "豊作「穀物神の約束」"
}
scJp["秋穰子"]["文花帖DS"] = {
    ["1"] = "実符「ウォームカラーハーヴェスト」",
    ["2"] = "焼芋「スイートポテトルーム」"
}

scJp["键山雏"] = {}
scJp["键山雏"]["风神录"] = {
    ["1"] = "厄符「バッドフォーチュン」",
    ["2"] = "厄符「厄神様のバイオリズム」",
    ["3"] = "疵符「ブロークンアミュレット」",
    ["4"] = "疵痕「壊されたお守り」",
    ["5"] = "悪霊「ミスフォーチュンズホイール」",
    ["6"] = "悲運「大鐘婆の火」",
    ["7"] = "創符「ペインフロー」",
    ["8"] = "創符「流刑人形」"
}
scJp["键山雏"]["文花帖DS"] = {
    ["1"] = "厄野「禊川の堆积」",
    ["2"] = "灾祸「呪いの雏人形」"
}

scJp["河城荷取"] = {}
scJp["河城荷取"]["风神录"] = {
    ["1"] = "光学「オプティカルカモフラージュ」",
    ["2"] = "光学「ハイドロカモフラージュ」",
    ["3"] = "洪水「ウーズフラッディング」",
    ["4"] = "洪水「デリューヴィアルメア」",
    ["5"] = "漂溺「光り輝く水底のトラウマ」",
    ["6"] = "水符「河童のポロロッカ」",
    ["7"] = "水符「河童のフラッシュフラッド」",
    ["8"] = "水符「河童の幻想大瀑布」",
    ["9"] = "河童「お化けキューカンバー」",
    ["10"] = "河童「のびーるアーム」",
    ["11"] = "河童「スピン·ザ·セファリックプレート」"
}
scJp["河城荷取"]["文花帖DS"] = {
    ["1"] = "水符「ウォーターカーペット」",
    ["2"] = "河符「ディバイディングエッジ」",
    ["3"] = "河童「乾燥尻子玉」"
}
scJp["河城荷取"]["心绮楼"] = {
    ["1"] = "豪雨「河底大戦争」",
    ["2"] = "泡符「撃て！バブルドラゴン」",
    ["3"] = "戦機「飛べ！三平ファイト」",
    ["4"] = "「スーパースコープ3D」",
    ["5"] = "水符「夏のペットボトルロケット」",
    ["6"] = "妖怪戦艦「三平ファイター」"
}
scJp["河城荷取"]["天邪鬼"] = {
    ["1"] = "瀑符「シライトフォール」",
    ["2"] = "瀑符「ケゴンガン」"
}
scJp["河城荷取"]["深秘录"] = {
    ["1"] = "豪雨「河底大戦争」",
    ["2"] = "泡符「撃て！バブルドラゴン」",
    ["3"] = "戦機「飛べ！三平ファイト」",
    ["4"] = "＊ネス湖は今ここにある！＊",
    ["5"] = "＊ネッシーの完全養殖技術＊"
}
scJp["河城荷取"]["凭依华"] = {
    ["1"] = "豪雨「河底大戦争」",
    ["2"] = "泡符「撃て！バブルドラゴン」",
    ["3"] = "戦機「飛べ！三平ファイト」",
    ["4"] = "＊ネス湖は今ここにある！＊",
    ["5"] = "水面符「ミズバクマスカレード」",
    ["6"] = "拳水符「入道叢雲ミズバク拳」"
}

scJp["犬走椛"] = {}
scJp["犬走椛"]["文花帖DS"] = {
    ["1"] = "狗符「レイビーズバイト」",
    ["2"] = "山窝「エクスペリーズカナン」"
}
scJp["犬走椛"]["天邪鬼"] = {
    ["1"] = "牙符「咀嚼玩味」"
}

scJp["东风谷早苗"] = {}
scJp["东风谷早苗"]["风神录"] = {
    ["1"] = "秘術「グレイソーマタージ」",
    ["2"] = "秘術「忘却の祭儀」",
    ["3"] = "秘術「一子相伝の弾幕」",
    ["4"] = "奇跡「白昼の客星」",
    ["5"] = "奇跡「客星の明るい夜」",
    ["6"] = "奇跡「客星の明るすぎる夜」",
    ["7"] = "開海「海が割れる日」",
    ["8"] = "開海「モーゼの奇跡」",
    ["9"] = "準備「神風を喚ぶ星の儀式」",
    ["10"] = "準備「サモンタケミナカタ」",
    ["11"] = "奇跡「神の風」",
    ["12"] = "大奇跡「八坂の神風」"
}
scJp["东风谷早苗"]["地灵殿"] = {
    ["1"] = "秘法「九字刺し」",
    ["2"] = "奇跡「ミラクルフルーツ」",
    ["3"] = "神徳「五穀豊穣ライスシャワー」"
}
scJp["东风谷早苗"]["星莲船"] = {
    ["1"] = "蛇符「神代大蛇」",
    ["2"] = "蛙符「手管の蝦蟇」"
}
scJp["东风谷早苗"]["非想天则"] = {
    ["1"] = "祈願「商売繁盛守り」",
    ["2"] = "秘術「グレイソーマタージ」",
    ["3"] = "御籤「乱れおみくじ連続引き」",
    ["4"] = "開海「海が割れる日」",
    ["5"] = "奇跡「白昼の客星」",
    ["6"] = "秘術「忘却の祭儀」",
    ["7"] = "奇跡「客星の明るすぎる夜」",
    ["8"] = "開海「モーゼの奇跡」",
    ["9"] = "秘法「九字刺し」",
    ["10"] = "蛇符「雲を泳ぐ大蛇」",
    ["11"] = "奇跡「ファフロッキーズの奇跡」"
}
scJp["东风谷早苗"]["文花帖DS"] = {
    ["1"] = "奇迹「弘安の神风」",
    ["2"] = "蛙符「手管の虾蟇」",
    ["3"] = "妖怪退治「妖力スポイラー」"
}
scJp["东风谷早苗"]["神灵庙"] = {
    ["1"] = "秘術「グレイソーマタージ」"
}
scJp["东风谷早苗"]["天邪鬼"] = {
    ["1"] = "蛇符「バインドスネークカモン」",
    ["2"] = "蛇符「グリーンスネークカモン」"
}
scJp["东风谷早苗"]["绀珠传"] = {
    ["1"] = "蛙符「手管の蝦蟇」"
}

scJp["八坂神奈子"] = {}
scJp["八坂神奈子"]["风神录"] = {
    ["1"] = "神祭「エクスパンデッド·オンバシラ」",
    ["2"] = "奇祭「目処梃子乱舞」",
    ["3"] = "筒粥「神の粥」",
    ["4"] = "忘穀「アンリメンバードクロップ」",
    ["5"] = "神穀「ディバイニングクロップ」",
    ["6"] = "贄符「御射山御狩神事」",
    ["7"] = "神秘「葛井の清水」",
    ["8"] = "神秘「ヤマトトーラス」",
    ["9"] = "天流「お天水の奇跡」",
    ["10"] = "天竜「雨の源泉」",
    ["11"] = "「マウンテン·オブ·フェイス」",
    ["12"] = "「風神様の神徳」",
    ["13"] = "神符「水眼の如き美しき源泉」",
    ["14"] = "神符「杉で結ぶ古き縁」",
    ["15"] = "神符「神が歩かれた御神渡り」"
}
scJp["八坂神奈子"]["文花帖DS"] = {
    ["1"] = "蛇符「グラウンドサーペント」",
    ["2"] = "御柱「メテオリックオンバシラ」",
    ["3"] = "儚道「御神渡りクロス」"
}
scJp["八坂神奈子"]["天邪鬼"] = {
    ["1"] = "御柱「ライジングオンバシラ」",
    ["2"] = "「神の御威光」"
}

scJp["洩矢诹访子"] = {}
scJp["洩矢诹访子"]["风神录"] = {
    ["1"] = "開宴「二拝二拍一拝」",
    ["2"] = "土着神「手長足長さま」",
    ["3"] = "神具「洩矢の鉄の輪」",
    ["4"] = "源符「厭い川の翡翠」",
    ["5"] = "蛙狩「蛙は口ゆえ蛇に呑まるる」",
    ["6"] = "土着神「七つの石と七つの木」",
    ["7"] = "土着神「ケロちゃん風雨に負けず」",
    ["8"] = "土着神「宝永四年の赤蛙」",
    ["9"] = "「諏訪大戦 ～ 土着神話 vs 中央神話」",
    ["10"] = "祟符「ミシャグジさま」"
}
scJp["洩矢诹访子"]["非想天则"] = {
    ["1"] = "源符「諏訪清水」",
    ["2"] = "神具「洩矢の鉄の轮」",
    ["3"] = "土着神「洩矢神」",
    ["4"] = "开宴「二拝二拍一拝」",
    ["5"] = "土着神「ケロちゃん风雨に负けず」",
    ["6"] = "源符「厌い川の翡翠」",
    ["7"] = "蛙狩「蛙は口ゆえ蛇に呑まるる」",
    ["8"] = "土着神「手长足长さま」",
    ["9"] = "土着神「宝永四年の赤蛙」",
    ["10"] = "蛙休「オールウェイズ冬眠できます」",
    ["11"] = "祟り神「赤口(ミシャグチ)さま」",
    ["12"] = "合掌「だいだらぼっちの参拝」",
    ["13"] = "神具「洩矢の鉄の轮」",
    ["14"] = "「狱热の间欠泉」",
    ["15"] = "「マグマの両生类」",
    ["16"] = "「幻想郷空中神戦」"
}
scJp["洩矢诹访子"]["文花帖DS"] = {
    ["1"] = "神桜「湛えの桜吹雪」",
    ["2"] = "姫川「プリンセスジェイドグリーン」",
    ["3"] = "鉄轮「ミシカルリング」",
    ["4"] = "土着神「御射军神さま」"
}
scJp["洩矢诹访子"]["天邪鬼"] = {
    ["1"] = "緑石「ジェイドブレイク」",
    ["2"] = "蛙符「血塗られた赤蛙塚」"
}

scJp["永江衣玖"] = {}
scJp["永江衣玖"]["绯想天"] = {
    ["1"] = "電符「雷鼓弾」",
    ["2"] = "魚符「龍魚ドリル」",
    ["3"] = "雷符「エレキテルの龍宮」",
    ["4"] = "光星「光龍の吐息」",
    ["5"] = "雷魚「雷雲魚遊泳弾」",
    ["6"] = "羽衣「羽衣は空の如く」",
    ["7"] = "棘符「雷雲棘魚」",
    ["8"] = "龍魚「龍宮の使い遊泳弾」",
    ["9"] = "光珠「龍の光る眼」",
    ["10"] = "雷符「神鳴り様の住処」",
    ["11"] = "棘符「雷雲棘魚」",
    ["12"] = "雲界「玄雲海の雷庭」"
}
scJp["永江衣玖"]["非想天则"] = {
    ["1"] = "羽衣「羽衣は時の如く」",
    ["2"] = "珠符「五爪龍の珠」"
}
scJp["永江衣玖"]["文花帖DS"] = {
    ["1"] = "雷符「ライトニングフィッシュ」",
    ["2"] = "珠符「五爪龍の珠」",
    ["3"] = "龍宮「タイヤヒラメダンス」",
    ["4"] = "龍魚「龍宮の使い遊泳弾」"
}

scJp["比那名居天子"] = {}
scJp["比那名居天子"]["绯想天"] = {
    ["1"] = "地符「不譲土壌の剣」",
    ["2"] = "非想「非想非非想の剣」",
    ["3"] = "天符「天道是非の剣」",
    ["4"] = "地震「先憂後楽の剣」",
    ["5"] = "気符「天啓気象の剣」",
    ["6"] = "要石「天地開闢プレス」",
    ["7"] = "気符「無念無想の境地」",
    ["8"] = "「全人类の绯想天」",
    ["9"] = "要石「天空の霊石」",
    ["10"] = "乾坤「荒々しくも母なる大地よ」",
    ["11"] = "霊想「大地を镇める石」",
    ["12"] = "天地「世界を見下ろす遥かなる大地よ」",
    ["13"] = "「全人類の緋想天」"
}
scJp["比那名居天子"]["非想天则"] = {
    ["1"] = "剣技「気炎万丈の剣」",
    ["2"] = "天気「緋想天促」"
}
scJp["比那名居天子"]["文花帖DS"] = {
    ["1"] = "気性「勇気凛々の剣」",
    ["2"] = "地震「避難険路」",
    ["3"] = "要石「カナメファンネル」",
    ["4"] = "「全人類の緋想天」"
}
scJp["比那名居天子"]["天邪鬼"] = {
    ["1"] = "「全妖怪の緋想天」",
    ["2"] = "「鹿島鎮護」"
}
scJp["比那名居天子"]["凭依华"] = {
    ["1"] = "要石「カナメファンネル」",
    ["2"] = "地符「一撃震乾坤」",
    ["3"] = "桃符「堅牢堅固の仙桃」",
    ["4"] = "＊大気圏は我が手中にあり＊",
    ["5"] = "昇槌符「僕らの夢を載せて大きくなあれ」",
    ["6"] = "墜槌符「夢は大気圏に墜ちて大きくなあれ」",
    ["7"] = "「全小人族の緋想天」",
    ["8"] = "夢要符「羊毛色の乾坤一擲」",
    ["9"] = "昇符「遥か宙まで飛べ！　僕らの夢を載せて」",
    ["10"] = "墜符「大気圏に落ちて、夢は地表に降り注ぐ」",
    ["11"] = "「大地を造り直そう、夢のある世界へ！」",
    ["12"] = "「ヒュージバトルシップ　無双ナマズ見参」",
    ["13"] = "「全スペースピープルの緋想天」"
}

scJp["琪斯美"] = {}
scJp["琪斯美"]["地灵殿"] = {
    ["1"] = "怪奇「釣瓶落としの怪」"
}
scJp["琪斯美"]["文花帖DS"] = {
    ["1"] = "釣瓶「飛んで井の中」",
    ["2"] = "釣瓶「ウェルディストラクター」"
}

scJp["黑谷山女"] = {}
scJp["黑谷山女"]["地灵殿"] = {
    ["1"] = "罠符「キャプチャーウェブ」",
    ["2"] = "蜘蛛「石窟の蜘蛛の巣」",
    ["3"] = "瘴符「フィルドミアズマ」",
    ["4"] = "瘴気「原因不明の熱病」"
}
scJp["黑谷山女"]["文花帖DS"] = {
    ["1"] = "細網「カンダタロープ」",
    ["2"] = "毒符「樺黄小町」"
}

scJp["水桥"] = {}
scJp["水桥"]["地灵殿"] = {
    ["1"] = "妬符「グリーンアイドモンスター」",
    ["2"] = "嫉妬「緑色の目をした見えない怪物」",
    ["3"] = "花咲爺「華やかなる仁者への嫉妬」",
    ["4"] = "花咲爺「シロの灰」",
    ["5"] = "舌切雀「謙虚なる富者への片恨」",
    ["6"] = "舌切雀「大きな葛籠と小さな葛籠」",
    ["7"] = "恨符「丑の刻参り」",
    ["8"] = "恨符「丑の刻参り七日目」"
}
scJp["水桥"]["文花帖DS"] = {
    ["1"] = "嫉妬「ジェラシーボンバー」",
    ["2"] = "怨み念法「積怨返し」"
}

scJp["星熊勇仪"] = {}
scJp["星熊勇仪"]["地灵殿"] = {
    ["1"] = "鬼符「怪力乱神」",
    ["2"] = "怪輪「地獄の苦輪」",
    ["3"] = "枷符「咎人の外さぬ枷」",
    ["4"] = "力業「大江山嵐」",
    ["5"] = "力業「大江山颪」",
    ["6"] = "四天王奥義「三歩必殺」"
}
scJp["星熊勇仪"]["文花帖DS"] = {
    ["1"] = "光鬼「金剛螺旋」",
    ["2"] = "鬼符「鬼気狂瀾」",
    ["3"] = "鬼声「壊滅の咆哮」"
}

scJp["古明地觉"] = {}
scJp["古明地觉"]["地灵殿"] = {
    ["1"] = "想起「テリブルスーヴニール」",
    ["2"] = "想起「恐怖催眠術」",
    ["3"] = "想起「二重黒死蝶」",
    ["4"] = "想起「飛行虫ネスト」　",
    ["5"] = "想起「波と粒の境界」",
    ["6"] = "想起「戸隠山投げ」",
    ["7"] = "想起「百万鬼夜行」",
    ["8"] = "想起「濛々迷霧」",
    ["9"] = "想起「風神木の葉隠れ」　",
    ["10"] = "想起「天狗のマクロバースト」",
    ["11"] = "想起「鳥居つむじ風」",
    ["12"] = "想起「春の京人形」",
    ["13"] = "想起「ストロードールカミカゼ」",
    ["14"] = "想起「リターンイナニメトネス」",
    ["15"] = "想起「マーキュリポイズン」",
    ["16"] = "想起「プリンセスウンディネ」",
    ["17"] = "想起「賢者の石」",
    ["18"] = "想起「のびーるアーム」",
    ["19"] = "想起「河童のポロロッカ」",
    ["20"] = "想起「光り輝く水底のトラウマ」"
}
scJp["古明地觉"]["文花帖DS"] = {
    ["1"] = "脳符「ブレインフィンガープリント」",
    ["2"] = "心花「カメラシャイローズ」",
    ["3"] = "想起「うろおぼえの金阁寺」"
}

scJp["火焰猫燐"] = {}
scJp["火焰猫燐"]["地灵殿"] = {
    ["1"] = "猫符「キャッツウォーク」",
    ["2"] = "猫符「怨霊猫乱歩」",
    ["3"] = "呪精「ゾンビフェアリー」",
    ["4"] = "呪精「怨霊憑依妖精」",
    ["5"] = "恨霊「スプリーンイーター」",
    ["6"] = "屍霊「食人怨霊」",
    ["7"] = "贖罪「旧地獄の針山」",
    ["8"] = "贖罪「昔時の針と痛がる怨霊」",
    ["9"] = "「死灰復燃」",
    ["10"] = "「小悪霊復活せし」",
    ["11"] = "妖怪「火焔の車輪」"
}
scJp["火焰猫燐"]["文花帖DS"] = {
    ["1"] = "死符「ゴーストタウン」",
    ["2"] = "「死体繁华街」",
    ["3"] = "酔歩「キャットランダムウォーク」"
}

scJp["灵乌路空"] = {}
scJp["灵乌路空"]["地灵殿"] = {
    ["1"] = "核熱「ニュークリアフュージョン」",
    ["2"] = "核熱「ニュークリアエクスカーション」",
    ["3"] = "核熱「核反応制御不能」",
    ["4"] = "爆符「プチフレア」",
    ["5"] = "爆符「メガフレア」",
    ["6"] = "爆符「ギガフレア」",
    ["7"] = "爆符「ぺタフレア」",
    ["8"] = "焔星「フィクストスター」",
    ["9"] = "焔星「プラネタリーレボリューション」",
    ["10"] = "焔星「十凶星」",
    ["11"] = "「地獄極楽メルトダウン」",
    ["12"] = "「ヘルズトカマク」",
    ["13"] = "「地獄の人工太陽」",
    ["14"] = "「サブタレイニアンサン」"
}
scJp["灵乌路空"]["非想天则"] = {
    ["1"] = "「地獄の人工太陽」",
    ["2"] = "制御「セルフトカマク」",
    ["3"] = "遮光「核熱バイザー」",
    ["4"] = "爆符「メガフレア」",
    ["5"] = "焔星「フィクストスター」",
    ["6"] = "核符「クリーピングサン」",
    ["7"] = "光熱「ハイテンションブレード」",
    ["8"] = "焔星「十凶星」",
    ["9"] = "地熱「核ブレイズゲイザー」",
    ["10"] = "鴉符「八咫烏ダイブ」",
    ["11"] = "核熱「核反応制御不能ダイブ」",
    ["12"] = "「サブタレイニアンサン」",
    ["13"] = "爆符「ギガフレア」",
    ["14"] = "「アビスノヴァ」",
    ["15"] = "熱符「ブレイクプロミネンス」",
    ["16"] = "核熱「核反応制御不能ダイブ」",
    ["17"] = "「ホットジュピター落下モデル」",
    ["18"] = "核熱「人工太陽の黒点」"
}
scJp["灵乌路空"]["文花帖DS"] = {
    ["1"] = "熔解「メルティングホワイト」",
    ["2"] = "巨星「レッドジャイアント」",
    ["3"] = "星符「巨星墜つ」",
    ["4"] = "七星「セプテントリオン」"
}

scJp["古明地恋"] = {}
scJp["古明地恋"]["地灵殿"] = {
    ["1"] = "表象「夢枕にご先祖総立ち」",
    ["2"] = "表象「弾幕パラノイア」",
    ["3"] = "本能「イドの解放」",
    ["4"] = "抑制「スーパーエゴ」",
    ["5"] = "反応「妖怪ポリグラフ」",
    ["6"] = "無意識「弾幕のロールシャッハ」",
    ["7"] = "復燃「恋の埋火」",
    ["8"] = "深層「無意識の遺伝子」",
    ["9"] = "「嫌われ者のフィロソフィ」",
    ["10"] = "「サブタレイニアンローズ」"
}
scJp["古明地恋"]["文花帖DS"] = {
    ["1"] = "心符「没我の愛」",
    ["2"] = "記憶「ＤＮＡの瑕」",
    ["3"] = "「胎児の梦」",
    ["4"] = "「ローズ地狱」"
}
scJp["古明地恋"]["心绮楼"] = {
    ["1"] = "抑制「スーパーエゴ」",
    ["2"] = "本能「イドの解放」",
    ["3"] = "夢符「ご先祖様が見ているぞ」",
    ["4"] = "「ブランブリーローズガーデン」",
    ["5"] = "本能「フロウディアン」",
    ["6"] = "茨符「コンファインドイノセント」"
}
scJp["古明地恋"]["深秘录"] = {
    ["1"] = "抑制「スーパーエゴ」",
    ["2"] = "本能「イドの解放」",
    ["3"] = "夢符「ご先祖様が見ているぞ」",
    ["4"] = "＊今から電話をするから出てね＊",
    ["5"] = "＊呪われたワン切り電話＊"
}
scJp["古明地恋"]["秦心"] = {
    ["1"] = "怒面「怒れる忌狼の面」",
    ["2"] = "憑依「喜怒哀楽ポゼッション」",
    ["3"] = "憂面「杞人地を憂う」",
    ["4"] = "＊これでもアタシ、キレイよね？＊",
    ["5"] = "＊口裂けの感情＊"
}
scJp["古明地恋"]["凭依华"] = {
    ["1"] = "抑制「スーパーエゴ」",
    ["2"] = "本能「イドの解放」",
    ["3"] = "夢符「ご先祖様が見ているぞ」",
    ["4"] = "＊今から電話をするから出てね＊",
    ["5"] = "星恋符「スプリンクルスター＆ハート」",
    ["6"] = "恋拳符「ローズカプリチオ怪雲拳」",
    ["7"] = "槌恋符「大判小判ザックザクハート」"
}

scJp["娜兹玲"] = {}
scJp["娜兹玲"]["星莲船"] = {
    ["1"] = "棒符「ビジーロッド」",
    ["2"] = "捜符「レアメタルディテクター」",
    ["3"] = "捜符「ゴールドディテクター」",
    ["4"] = "視符「ナズーリンペンデュラム」",
    ["5"] = "視符「高感度ナズーリンペンデュラム」",
    ["6"] = "守符「ペンデュラムガード」",
    ["7"] = "宝塔「グレイテストトレジャー」"
}
scJp["娜兹玲"]["文花帖DS"] = {
    ["1"] = "棒符「ナズーリンロッド」",
    ["2"] = "財宝「ゴールドラッシュ」"
}

scJp["多多良小伞"] = {}
scJp["多多良小伞"]["星莲船"] = {
    ["1"] = "大輪「からかさ後光」",
    ["2"] = "大輪「ハロウフォゴットンワールド」",
    ["3"] = "傘符「パラソルスターシンフォニー」",
    ["4"] = "傘符「パラソルスターメモリーズ」",
    ["5"] = "雨符「雨夜の怪談」",
    ["6"] = "雨傘「超撥水かさかさお化け」",
    ["7"] = "化符「忘れ傘の夜行列車」",
    ["8"] = "化鉄「置き傘特急ナイトカーニバル」",
    ["9"] = "伞符「大粒の涙雨」",
    ["10"] = "驚雨「ゲリラ台風」",
    ["11"] = "後光「からかさ驚きフラッシュ」"
}
scJp["多多良小伞"]["文花帖DS"] = {
    ["1"] = "傘符「一本足ピッチャー返し」",
    ["2"] = "虹符「オーバー・ザ・レインボー」",
    ["3"] = "傘符「細雪の過客」"
}
scJp["多多良小伞"]["神灵庙"] = {
    ["1"] = "虹符「アンブレラサイクロン」"
}

scJp["云居一轮"] = {}
scJp["云居一轮"]["星莲船"] = {
    ["1"] = "鉄拳「問答無用の妖怪拳」",
    ["2"] = "神拳「雲上地獄突き」",
    ["3"] = "神拳「天海地獄突き」",
    ["4"] = "拳符「天網サンドバッグ」",
    ["5"] = "連打「雲界クラーケン殴り」",
    ["6"] = "連打「キングクラーケン殴り」",
    ["7"] = "拳打「げんこつスマッシュ」",
    ["8"] = "潰滅「天上天下連続フック」",
    ["9"] = "大喝「時代親父大目玉」",
    ["10"] = "忿怒「天変大目玉焼き」",
    ["11"] = "忿怒「空前絶後大目玉焼き」"
}
scJp["云居一轮"]["文花帖DS"] = {
    ["1"] = "拳骨「天空鉄槌落とし」",
    ["2"] = "稲妻「帯電入道」",
    ["3"] = "鉄拳「入道にょき」"
}
scJp["云居一轮"]["心绮楼"] = {
    ["1"] = "嵐符「仏罰の野分雲」",
    ["2"] = "積乱「見越し入道雲」",
    ["3"] = "拳固「懺悔の殺風」",
    ["4"] = "「華麗なる親父時代」",
    ["5"] = "拳符「怒りの大雲塊」",
    ["6"] = "入道「夏の幻想太郎」"
}
scJp["云居一轮"]["深秘录"] = {
    ["1"] = "嵐符「仏罰の野分雲」",
    ["2"] = "積乱「見越し入道雲」",
    ["3"] = "拳固「懺悔の殺風」",
    ["4"] = "＊２６５センチの魔人現る！＊",
    ["5"] = "悪符「八丈のオカルト柱」",
    ["6"] = "＊謎の女に囚われた真夏の夜＊"
}
scJp["云居一轮"]["凭依华"] = {
    ["1"] = "嵐符「仏罰の野分雲」",
    ["2"] = "積乱「見越し入道雲」",
    ["3"] = "拳固「懺悔の殺風」",
    ["4"] = "＊２６５センチの魔人現る！＊",
    ["5"] = "拳風符「入道叢雲風水拳」",
    ["6"] = "拳星符「入道叢雲スレイブスパーク」",
    ["7"] = "撃拳符「スカンダの怪雲拳」",
    ["8"] = "恋拳符「ローズカプリチオ怪雲拳」",
    ["9"] = "光拳符「インドラのヴァジュラ怪雲拳」",
    ["10"] = "拳水符「入道叢雲ミズバク拳」"
}

scJp["村纱水蜜"] = {}
scJp["村纱水蜜"]["星莲船"] = {
    ["1"] = "転覆「道連れアンカー」",
    ["2"] = "転覆「沈没アンカー」",
    ["3"] = "転覆「撃沈アンカー」",
    ["4"] = "溺符「ディープヴォーテックス」",
    ["5"] = "溺符「シンカブルヴォーテックス」",
    ["6"] = "湊符「ファントムシップハーバー」",
    ["7"] = "湊符「幽霊船の港」",
    ["8"] = "湊符「幽霊船永久停泊」",
    ["9"] = "幽霊「シンカーゴースト」",
    ["10"] = "幽霊「忍び寄る柄杓」"
}
scJp["村纱水蜜"]["文花帖DS"] = {
    ["1"] = "錨符「幽霊船長期停泊」",
    ["2"] = "浸水「船底のヴィーナス」",
    ["3"] = "「ディープシンカー」"
}

scJp["寅丸星"] = {}
scJp["寅丸星"]["星莲船"] = {
    ["1"] = "宝塔「レイディアントトレジャー」",
    ["2"] = "宝塔「レイディアントトレジャーガン」",
    ["3"] = "光符「アブソリュートジャスティス」",
    ["4"] = "光符「正義の威光」",
    ["5"] = "法力「至宝の独鈷杵」",
    ["6"] = "法灯「隙間無い法の独鈷杵」",
    ["7"] = "光符「浄化の魔」",
    ["8"] = "「コンプリートクラリフィケイション」"
}
scJp["寅丸星"]["文花帖DS"] = {
    ["1"] = "寅符「ハングリータイガー」",
    ["2"] = "天符「焦土曼荼羅」",
    ["3"] = "宝符「黄金の震眩」"
}

scJp["圣白莲"] = {}
scJp["圣白莲"]["星莲船"] = {
    ["1"] = "魔法「紫雲のオーメン」",
    ["2"] = "吉兆「紫の雲路」",
    ["3"] = "吉兆「極楽の紫の雲路」",
    ["4"] = "魔法「魔界蝶の妖香」",
    ["5"] = "魔法「マジックバタフライ」",
    ["6"] = "光魔「スターメイルシュトロム」",
    ["7"] = "光魔「魔法銀河系」",
    ["8"] = "大魔法「魔神復誦」",
    ["9"] = "「聖尼公のエア巻物」",
    ["10"] = "超人「聖白蓮」",
    ["11"] = "飛鉢「フライングファンタスティカ」",
    ["12"] = "飛鉢「伝説の飛空円盤」"
}
scJp["圣白莲"]["文花帖DS"] = {
    ["1"] = "「遊行聖」",
    ["2"] = "習合「垂迹大日如来」",
    ["3"] = "「スターソードの護法」"
}
scJp["圣白莲"]["心绮楼"] = {
    ["1"] = "天符「三千大千世界の主」",
    ["2"] = "天符「大日如来の輝き」",
    ["3"] = "天符「釈迦牟尼の五行山」",
    ["4"] = "「アーンギラサヴェーダ」",
    ["5"] = "杵符「ヴァジュラパーニの呪文」",
    ["6"] = "超人「ガルーダの翼」"
}
scJp["圣白莲"]["天邪鬼"] = {
    ["1"] = "「ハリの制縛」",
    ["2"] = "「ブラフマーの瞳」"
}
scJp["圣白莲"]["深秘录"] = {
    ["1"] = "天符「三千大千世界の主」",
    ["2"] = "天符「大日如来の輝き」",
    ["3"] = "天符「釈迦牟尼の五行山」",
    ["4"] = "＊１００キロで空を駆けろ！＊",
    ["5"] = "超音速「老婆のスプリント」",
    ["6"] = "＊ハイウェイターボエアターン＊",
    ["7"] = "＊ターボババァ走死走愛＊",
    ["8"] = "光符「インドラのヴァジュラ」",
    ["9"] = "超人「聖白蓮」",
    ["10"] = "超人「大追跡！ブディストライダー」"
}
scJp["圣白莲"]["凭依华"] = {
    ["1"] = "天符「三千大千世界の主」",
    ["2"] = "天符「大日如来の輝き」",
    ["3"] = "天符「釈迦牟尼の五行山」",
    ["4"] = "＊１００キロで空を駆けろ！＊",
    ["5"] = "光撃符「君を導く王道のヴァジュラシュート」",
    ["6"] = "撃拳符「スカンダの怪雲拳」",
    ["7"] = "撃光符「スカンダの王道の威光」",
    ["8"] = "蹴斬符「ガルーダの聖德斬」",
    ["9"] = "光仙符「日出ずる国の僧侶と道士」",
    ["10"] = "光拳符「インドラのヴァジュラ怪雲拳」",
    ["11"] = "撃符「スカンダに追われる正夢」"
}

scJp["封兽鵺"] = {}
scJp["封兽鵺"]["星莲船"] = {
    ["1"] = "妖雲「平安のダーククラウド」",
    ["2"] = "正体不明「忿怒のレッドUFO襲来」",
    ["3"] = "鵺符「鵺的スネークショー」",
    ["4"] = "正体不明「哀愁のブルーUFO襲来」",
    ["5"] = "鵺符「弾幕キメラ」",
    ["6"] = "正体不明「義心のグリーンUFO襲来」",
    ["7"] = "鵺符「アンディファインドダークネス」",
    ["8"] = "正体不明「恐怖の虹色ＵＦＯ襲来」",
    ["9"] = "「平安京の悪夢」",
    ["10"] = "恨弓「源三位頼政の弓」"
}
scJp["封兽鵺"]["文花帖DS"] = {
    ["1"] = "正体不明「紫鏡」",
    ["2"] = "正体不明「赤マント青マント」",
    ["3"] = "正体不明「厠の花子さん」",
    ["4"] = "「遊星よりの弾幕Ｘ」"
}
scJp["封兽鵺"]["神灵庙"] = {
    ["1"] = "アンノウン「軌道不明の鬼火」",
    ["2"] = "アンノウン「姿態不明の空魚」",
    ["3"] = "アンノウン「原理不明の妖怪玉」"
}

scJp["大鲶鱼"] = {}
scJp["大鲶鱼"]["非想天则"] = {
    ["1"] = "ナマズ「ほらほら世界が震えるぞ？」",
    ["2"] = "ナマズ「液状化現象で大地も泥のようじゃ！」",
    ["3"] = "ナマズ「発電だって頑張っちゃうぞ？」",
    ["4"] = "ナマズ「オール電化でエコロジーじゃ！」",
    ["5"] = "大ナマズ「これで浮き世もおしまいじゃあ！！」"
}

scJp["姬海棠果"] = {}
scJp["姬海棠果"]["文花帖DS"] = {
    ["1"] = "取材「姫海棠はたての练习取材」",
    ["2"] = "连写「ラピッドショット」",
    ["3"] = "远眼「天狗サイコグラフィ」"
}
scJp["姬海棠果"]["天邪鬼"] = {
    ["1"] = "写真「フルパノラマショット」",
    ["2"] = "写真「籠もりパパラッチ」"
}

scJp["光之三妖精"] = {}
scJp["光之三妖精"]["大战争"] = {
    ["1"] = "光符「ルチルフレクション」",
    ["2"] = "空符「エルフィンキャノピー」",
    ["3"] = "光符「トリプルメテオ」",
    ["4"] = "光星「オリオンベルト」",
    ["5"] = "光符「ブライトナイト」",
    ["6"] = "空符「ブレイクキャノピー」",
    ["7"] = "光符「エクステンシブメテオ」",
    ["8"] = "光星「グレートトライアングル」",
    ["9"] = "光符「フルムーンナイト」",
    ["10"] = "降光「トリプルライト」",
    ["11"] = "光符「ハイパーインクレクション」",
    ["12"] = "激光「サンバースト」",
    ["13"] = "星熱「アイスディゾルバー」",
    ["14"] = "月熱「アイスディゾルバー」",
    ["15"] = "日熱「アイスディゾルバー」",
    ["16"] = "協力技「フェアリーオーバードライブ」",
    ["17"] = "「スリーフェアリーズ」"
}

scJp["桑尼"] = {}
scJp["桑尼"]["大战争"] = {
    ["1"] = "陽光「サンシャインブラスト」",
    ["2"] = "虹光「プリズムフラッシュ」",
    ["3"] = "光精「ダイアモンドリング」",
    ["4"] = "光符「ブルーディフレクション」",
    ["5"] = "日符「アグレッシブライト」",
    ["6"] = "日符「ダイレクトサンライト」",
    ["7"] = "瞬光「フェイタルフラッシュ」",
    ["8"] = "光精「クロスディフュージョン」",
    ["9"] = "光符「イエローディフレクション」",
    ["10"] = "陽光「サンシャインニードル」"
}

scJp["露娜"] = {}
scJp["露娜"]["大战争"] = {
    ["1"] = "月符「ルナティックレイン」",
    ["2"] = "月符「ルナサイクロン」",
    ["3"] = "月光「サイレントストーム」",
    ["4"] = "月光「ダークスティルネス」",
    ["5"] = "障光「ムーンライトウォール」",
    ["6"] = "夜符「ナイトフェアリーズ」",
    ["7"] = "月光「サイレントフラワー」",
    ["8"] = "月光「ムーンスティルネス」",
    ["9"] = "光壁「ウォールブレイク」",
    ["10"] = "月光「サイレントサイクロン」"
}

scJp["斯塔"] = {}
scJp["斯塔"]["大战争"] = {
    ["1"] = "流星「プチコメット」",
    ["2"] = "星粒「スプリンクルピース」",
    ["3"] = "星符「トゥインクルサファイア」",
    ["4"] = "星光「スターレーザー」",
    ["5"] = "流星「コメットストリーム」",
    ["6"] = "星粒「スターピースシャワー」",
    ["7"] = "星符「シューティングサファイア」",
    ["8"] = "星光「スターストーム」",
    ["9"] = "星符「スターライトレイン」",
    ["10"] = "星符「レッドスター」"
}

scJp["幽谷响子"] = {}
scJp["幽谷响子"]["神灵庙"] = {
    ["1"] = "響符「マウンテンエコー」",
    ["2"] = "響符「マウンテンエコースクランブル」",
    ["3"] = "響符「パワーレゾナンス」",
    ["4"] = "山彦「ロングレンジエコー」",
    ["5"] = "山彦「アンプリファイエコー」",
    ["6"] = "大声「チャージドクライ」",
    ["7"] = "大声「チャージドヤッホー」",
    ["8"] = "山彦「ヤマビコの本領発揮エコー」"
}
scJp["幽谷响子"]["天邪鬼"] = {
    ["1"] = "叫喚「プライマルスクリーム」",
    ["2"] = "劈音「ピアッシングサークル」",
    ["3"] = "御経「無限念仏」"
}

scJp["宫古芳香"] = {}
scJp["宫古芳香"]["神灵庙"] = {
    ["1"] = "回復「ヒールバイデザイア」",
    ["2"] = "毒爪「ポイズンレイズ」",
    ["3"] = "毒爪「ポイズンマーダー」",
    ["4"] = "欲符「稼欲霊招来」",
    ["5"] = "欲霊「スコアデザイアイーター」",
    ["6"] = "毒爪「死なない殺人鬼」"
}
scJp["宫古芳香"]["天邪鬼"] = {
    ["1"] = "毒爪「ゾンビクロー」"
}

scJp["霍青娥"] = {}
scJp["霍青娥"]["神灵庙"] = {
    ["1"] = "邪符「ヤンシャオグイ」",
    ["2"] = "邪符「グーフンイエグイ」",
    ["3"] = "入魔「ゾウフォルゥモォ」",
    ["4"] = "降霊「死人タンキー」",
    ["5"] = "通霊「トンリン芳香」",
    ["6"] = "道符「タオ胎動」",
    ["7"] = "道符「ＴＡＯ胎動　～道～」"
}
scJp["霍青娥"]["天邪鬼"] = {
    ["1"] = "入魔「過剰ゾウフォルゥモォ」",
    ["2"] = "仙術「ウォールランナー」",
    ["3"] = "仙術「壁抜けワームホール」"
}

scJp["苏我屠自古"] = {}
scJp["苏我屠自古"]["神灵庙"] = {
    ["1"] = "雷矢「ガゴウジサイクロン」",
    ["2"] = "雷矢「ガゴウジトルネード」",
    ["3"] = "怨霊「入鹿の雷」"
}

scJp["物部布都"] = {}
scJp["物部布都"]["神灵庙"] = {
    ["1"] = "天符「雨の磐舟」",
    ["2"] = "天符「天の磐舟よ天へ昇れ」",
    ["3"] = "投皿「物部の八十平瓮」",
    ["4"] = "炎符「廃仏の炎風」",
    ["5"] = "炎符「桜井寺炎上」",
    ["6"] = "聖童女「大物忌正餐」",
    ["7"] = "聖童女「太陽神の贄」"
}
scJp["物部布都"]["心绮楼"] = {
    ["1"] = "風符「三輪の皿嵐」",
    ["2"] = "炎符「太乙真火」",
    ["3"] = "運気「破局の開門」",
    ["4"] = "「大火の改新」",
    ["5"] = "皿投「かわらけ回転投げ」",
    ["6"] = "弓符「星龍弓」"
}
scJp["物部布都"]["天邪鬼"] = {
    ["1"] = "古舟「エンシェントシップ」",
    ["2"] = "熱龍「火焔龍脈」"
}
scJp["物部布都"]["深秘录"] = {
    ["1"] = "風符「三輪の皿嵐」",
    ["2"] = "炎符「太乙真火」",
    ["3"] = "運気「破局の開門」",
    ["4"] = "＊死んでも一枚足りない！＊",
    ["5"] = "皿符「自暴自棄のお菊」",
    ["6"] = "＊仄暗い古井戸の底から＊"
}
scJp["物部布都"]["凭依华"] = {
    ["1"] = "風符「三輪の皿嵐」",
    ["2"] = "炎符「太乙真火」",
    ["3"] = "運気「破局の開門」",
    ["4"] = "＊死んでも一枚足りない！＊",
    ["5"] = "拳風符「入道叢雲風水拳」",
    ["6"] = "風霊符「磐舟かわらけ封印」",
    ["7"] = "面風符「喜怒哀楽風水術」",
    ["8"] = "光風符「レイディアント風水マント」"
}

scJp["丰聪耳神子"] = {}
scJp["丰聪耳神子"]["神灵庙"] = {
    ["1"] = "名誉「十二階の色彩」",
    ["2"] = "名誉「十二階の冠位」",
    ["3"] = "仙符「日出ずる処の道士」",
    ["4"] = "仙符「日出ずる処の天子」",
    ["5"] = "召喚「豪族乱舞」",
    ["6"] = "秘宝「斑鳩寺の天球儀」",
    ["7"] = "秘宝「聖徳太子のオーパーツ」",
    ["8"] = "光符「救世観音の光後光」",
    ["9"] = "光符「グセフラッシュ」",
    ["10"] = "眼光「十七条のレーザー」",
    ["11"] = "神光「逆らう事なきを宗とせよ」",
    ["12"] = "「星降る神霊廟」",
    ["13"] = "「生まれたての神霊」",
    ["14"] = "「神霊大宇宙」"
}
scJp["丰聪耳神子"]["心绮楼"] = {
    ["1"] = "仙符「日出ずる処の道士」",
    ["2"] = "道符「掌の上の天道」",
    ["3"] = "人符「勧善懲悪は古の良き典なり」",
    ["4"] = "「詔を承けては必ず慎め」",
    ["5"] = "徳符「聖徳のプレスティージ」",
    ["6"] = "光符「無限条のレーザー」"
}
scJp["丰聪耳神子"]["天邪鬼"] = {
    ["1"] = "「我こそが天道なり」",
    ["2"] = "「十七条の憲法爆弾」"
}
scJp["丰聪耳神子"]["深秘录"] = {
    ["1"] = "仙符「日出ずる処の道士」",
    ["2"] = "道符「掌の上の天道」",
    ["3"] = "人符「勧善懲悪は古の良き典なり」",
    ["4"] = "＊特別に両方選ばせてやろう！＊",
    ["5"] = "怪人「ヘルメティックマント」",
    ["6"] = "＊大怪人の動脈と静脈＊",
    ["7"] = "＊世紀の怪人赤マント青マント＊",
    ["8"] = "怪人「ブラッディマント」",
    ["9"] = "怪人「カーシング赤青マント」",
    ["10"] = "「死生有命　～自らの意思で最期を選べ」"
}
scJp["丰聪耳神子"]["凭依华"] = {
    ["1"] = "仙符「日出ずる処の道士」",
    ["2"] = "道符「掌の上の天道」",
    ["3"] = "人符「勧善懲悪は古の良き典なり」",
    ["4"] = "＊特別に両方選ばせてやろう！＊",
    ["5"] = "光撃符「君を導く王道のヴァジュラシュート」",
    ["6"] = "撃光符「スカンダの王道の威光」",
    ["7"] = "蹴斬符「ガルーダの聖德斬」",
    ["8"] = "光仙符「日出ずる国の僧侶と道士」",
    ["9"] = "光風符「レイディアント風水マント」",
    ["10"] = "光符「君を導く夢王道の威光」"
}

scJp["二岩猯藏"] = {}
scJp["二岩猯藏"]["神灵庙"] = {
    ["1"] = "壱番勝負「霊長化弾幕変化」",
    ["2"] = "弐番勝負「肉食化弾幕変化」",
    ["3"] = "参番勝負「延羽化弾幕変化」",
    ["4"] = "四番勝負「両生化弾幕変化」",
    ["5"] = "伍番勝負「鳥獣戯画」",
    ["6"] = "六番勝負「狸の化け学校」",
    ["7"] = "七番勝負「野生の離島」",
    ["8"] = "変化「まぬけ巫女の偽調伏」",
    ["9"] = "「マミゾウ化弾幕十変化」",
    ["10"] = "狢符「満月のポンポコリン」",
    ["11"] = "「ワイルドカーペット」"
}
scJp["二岩猯藏"]["心绮楼"] = {
    ["1"] = "変化「分福熱湯風呂」",
    ["2"] = "変化「百鬼妖界の門」",
    ["3"] = "変化「二ッ岩家の裁き」",
    ["4"] = "「八百八狸囃子」",
    ["5"] = "変化「満月の花鳥園」",
    ["6"] = "変化「鸟獣戯画」",
    ["7"] = "変化「百鬼妖界の門」",
    ["8"] = "「たわむれはおわりじゃ」",
    ["9"] = "「ベンテンの琵琶法師」",
    ["10"] = "「神社のお釈迦様」"
}
scJp["二岩猯藏"]["天邪鬼"] = {
    ["1"] = "「鳴かぬなら泣くまで待とう時鳥」",
    ["2"] = "「にんげんって良いな」"
}
scJp["二岩猯藏"]["深秘录"] = {
    ["1"] = "変化「分福熱湯風呂」",
    ["2"] = "変化「百鬼妖界の門」",
    ["3"] = "変化「二ッ岩家の裁き」",
    ["4"] = "＊宇宙機密漏洩！直ちに処置せよ＊",
    ["5"] = "未確認「遊抱戯画」",
    ["6"] = "＊満員のエイリアンボール＊",
    ["7"] = "＊そろそろ帰ろうエイリアン達よ＊"
}
scJp["二岩猯藏"]["凭依华"] = {
    ["1"] = "変化「分福熱湯風呂」",
    ["2"] = "変化「百鬼妖界の門」",
    ["3"] = "変化「二ッ岩家の裁き」",
    ["4"] = "＊宇宙機密漏洩！直ちに処置せよ＊",
    ["5"] = "化火符「妖怪弾幕変化　葉っぱ発破」",
    ["6"] = "槌化符「大判小判弾幕変化」",
    ["7"] = "雷化符「務光と葉っぱの弾幕変化」",
    ["8"] = "龍化符「ドラゴンズエイリアンカプセル」",
    ["9"] = "化符「妖怪弾幕変化　夢見心地」"
}

scJp["秦心"] = {}
scJp["秦心"]["心绮楼"] = {
    ["1"] = "怒面「怒れる忌狼の面」",
    ["2"] = "憑依「喜怒哀楽ポゼッション」",
    ["3"] = "憂面「杞人地を憂う」",
    ["4"] = "「仮面喪心舞　暗黒能楽」",
    ["5"] = "憂符「憂き世は憂しの小車」",
    ["6"] = "喜符「昂揚の神楽獅子」",
    ["7"] = "怒符「怒れる忌狼の面」",
    ["8"] = "「モンキーポゼッション」"
}
scJp["秦心"]["深秘录"] = {
    ["1"] = "怒面「怒れる忌狼の面」",
    ["2"] = "憑依「喜怒哀楽ポゼッション」",
    ["3"] = "憂面「杞人地を憂う」",
    ["4"] = "＊これでもアタシ、キレイよね？＊",
    ["5"] = "＊口裂けの感情＊"
}
scJp["秦心"]["凭依华"] = {
    ["1"] = "怒面「怒れる忌狼の面」",
    ["2"] = "憑依「喜怒哀楽ポゼッション」",
    ["3"] = "憂面「杞人地を憂う」",
    ["4"] = "＊これでもアタシ、キレイよね？＊",
    ["5"] = "水面符「ミズバクマスカレード」",
    ["6"] = "面風符「喜怒哀楽風水術」",
    ["7"] = "面符「喜怒哀楽発狂マスカレード」"
}

scJp["若鹭姬"] = {}
scJp["若鹭姬"]["辉针城"] = {
    ["1"] = "水符「テイルフィンスラップ」",
    ["2"] = "鱗符「スケールウェイブ」",
    ["3"] = "鱗符「逆鱗の荒波」",
    ["4"] = "鱗符「逆鱗の大荒波」"
}
scJp["若鹭姬"]["天邪鬼"] = {
    ["1"] = "水符「ルナティックレッドスラップ」",
    ["2"] = "潮符「湖のタイダルウェイブ」",
    ["3"] = "魚符「スクールオブフィッシュ」"
}

scJp["赤蛮奇"] = {}
scJp["赤蛮奇"]["辉针城"] = {
    ["1"] = "飛符「フライングヘッド」",
    ["2"] = "首符「クローズアイショット」",
    ["3"] = "首符「ろくろ首飛来」",
    ["4"] = "飛頭「マルチプリケイティブヘッド」",
    ["5"] = "飛頭「セブンズヘッド」",
    ["6"] = "飛頭「ナインズヘッド」",
    ["7"] = "飛頭「デュラハンナイト」"
}
scJp["赤蛮奇"]["天邪鬼"] = {
    ["1"] = "飛首「エクストリームロングネック」",
    ["2"] = "眼光「ヘルズレイ」",
    ["3"] = "飛首「ツインロクロヘッド」"
}

scJp["今泉影狼"] = {}
scJp["今泉影狼"]["辉针城"] = {
    ["1"] = "牙符「月下の犬歯」",
    ["2"] = "変身「トライアングルファング」",
    ["3"] = "変身「スターファング」",
    ["4"] = "咆哮「ストレンジロア」",
    ["5"] = "咆哮「満月の远吠え」",
    ["6"] = "狼符「スターリングパウンス」",
    ["7"] = "天狼「ハイスピードバウンス」"
}
scJp["今泉影狼"]["天邪鬼"] = {
    ["1"] = "満月「フルムーンロア」",
    ["2"] = "狼牙「血に餓えたウルフファング」"
}

scJp["九十九姐妹"] = {}
scJp["九十九姐妹"]["辉针城"] = {
    ["1"] = "弦楽「嵐のアンサンブル」",
    ["2"] = "弦楽「浄瑠璃世界」"
}

scJp["九十九弁弁"] = {}
scJp["九十九弁弁"]["辉针城"] = {
    ["1"] = "平曲「祇園精舎の鐘の音」",
    ["2"] = "怨霊「耳無し芳一」",
    ["3"] = "怨霊「平家の大怨霊」",
    ["4"] = "楽符「邪悪な五線譜」",
    ["5"] = "楽符「凶悪な五線譜」",
    ["6"] = "楽符「ダブルスコア」"
}
scJp["九十九弁弁"]["天邪鬼"] = {
    ["1"] = "音符「大熱唱琵琶」",
    ["2"] = "楽譜「スコアウェブ」",
    ["3"] = "両吟「星降る唄」"
}

scJp["九十九八桥"] = {}
scJp["九十九八桥"]["辉针城"] = {
    ["1"] = "琴符「諸行無常の琴の音」",
    ["2"] = "響符「平安の残響」",
    ["3"] = "響符「エコーチェンバー」",
    ["4"] = "筝曲「下克上送筝曲」",
    ["5"] = "筝曲「下克上レクイエム」"
}
scJp["九十九八桥"]["天邪鬼"] = {
    ["1"] = "琴符「天の詔琴」",
    ["2"] = "哀歌「人琴ともに亡ぶ」",
    ["3"] = "両吟「星降る唄」"
}

scJp["鬼人正邪"] = {}
scJp["鬼人正邪"]["辉针城"] = {
    ["1"] = "欺符「逆針撃」",
    ["2"] = "逆符「鏡の国の弾幕」",
    ["3"] = "逆符「イビルインザミラー」",
    ["4"] = "逆符「天地有用」",
    ["5"] = "逆符「天下転覆」",
    ["6"] = "逆弓「天壌夢弓」",
    ["7"] = "逆弓「天壌夢弓の詔勅」",
    ["8"] = "逆転「リバースヒエラルキー」",
    ["9"] = "逆転「チェンジエアブレイブ」"
}

scJp["少名针妙丸"] = {}
scJp["少名针妙丸"]["辉针城"] = {
    ["1"] = "小弾「小人の道」",
    ["2"] = "小弾「小人の茨道」",
    ["3"] = "小槌「大きくなあれ」",
    ["4"] = "小槌「もっと大きくなあれ」",
    ["5"] = "妖剣「輝針剣」",
    ["6"] = "小槌「お前が大きくなあれ」",
    ["7"] = "「進撃の小人」",
    ["8"] = "「ウォールオブイッスン」",
    ["9"] = "「ホップオマイサムセブン」",
    ["10"] = "「七人の一寸法師」"
}
scJp["少名针妙丸"]["天邪鬼"] = {
    ["1"] = "「小人の地獄」",
    ["2"] = "輝針「鬼ごろし両目突きの針」"
}
scJp["少名针妙丸"]["深秘录"] = {
    ["1"] = "小槌「伝説の椀飯振舞」",
    ["2"] = "小人「一寸法師にも五分の魂」",
    ["3"] = "釣符「可愛い太公望」",
    ["4"] = "＊緑の巨人よ、おおきくなれよ！＊",
    ["5"] = "大漁「空中大回転漁法」",
    ["6"] = "＊幻の国ブレフスキュ＊"
}
scJp["少名针妙丸"]["凭依华"] = {
    ["1"] = "小槌「伝説の椀飯振舞」",
    ["2"] = "小人「一寸法師にも五分の魂」",
    ["3"] = "釣符「可愛い太公望」",
    ["4"] = "＊緑の巨人よ、おおきくなれよ！＊",
    ["5"] = "槌化符「大判小判弾幕変化」",
    ["6"] = "昇槌符「僕らの夢を載せて大きくなあれ」",
    ["7"] = "墜槌符「夢は大気圏に墜ちて大きくなあれ」",
    ["8"] = "「全小人族の緋想天」",
    ["9"] = "狂槌符「狂視幻像（ディスオーダーアイ）も大きくなあれ」",
    ["10"] = "槌恋符「大判小判ザックザクハート」",
    ["11"] = "槌礫符「大判小判ザックザクサイコキネシス」"
}

scJp["堀川雷鼓"] = {}
scJp["堀川雷鼓"]["辉针城"] = {
    ["1"] = "一鼓「暴れ宮太鼓」",
    ["2"] = "二鼓「怨霊アヤノツヅミ」",
    ["3"] = "三鼓「午前零時のスリーストライク」",
    ["4"] = "死鼓「ランドパーカス」",
    ["5"] = "五鼓「デンデン太鼓」",
    ["6"] = "六鼓「オルタネイトスティッキング」",
    ["7"] = "七鼓「高速和太鼓ロケット」",
    ["8"] = "八鼓「雷神の怒り」",
    ["9"] = "「ブルーレディショー」",
    ["10"] = "「プリスティンビート」"
}
scJp["堀川雷鼓"]["天邪鬼"] = {
    ["1"] = "雷符「怒りのデンデン太鼓」",
    ["2"] = "太鼓「ファンタジックウーファー」"
}

scJp["茨木华扇"] = {}
scJp["茨木华扇"]["深秘录"] = {
    ["1"] = "包符「義腕プロテウス」",
    ["2"] = "龍符「ドラゴンズグロウル」",
    ["3"] = "鷹符「ホークビーコン」",
    ["4"] = "＊猿の手よ！敵を握りつぶせ！＊",
    ["5"] = "雷符「微速の務光」",
    ["6"] = "虎符「両門の彭祖」",
    ["7"] = "＊死ぬまで願いを叶える手＊",
    ["8"] = "＊猿の手はオカルトな夢を見る＊"
}
scJp["茨木华扇"]["凭依华"] = {
    ["1"] = "包符「義腕プロテウス」",
    ["2"] = "龍符「ドラゴンズグロウル」",
    ["3"] = "鷹符「ホークビーコン」",
    ["4"] = "＊猿の手よ！敵を握りつぶせ！＊",
    ["5"] = "霊鷹符「鷹による夢想封印ハンティング」",
    ["6"] = "雷霊符「務光の雷弾夢想封印」",
    ["7"] = "龍蹴符「ドラゴンズ飛鳥井キック」",
    ["8"] = "雷化符「務光と葉っぱの弾幕変化」",
    ["9"] = "龍化符「ドラゴンズエイリアンカプセル」",
    ["10"] = "雷符「務光の雷霆閃光夢幻弾」",
    ["11"] = "龍符「ドラゴンズオプティカルドリーム」"
}

scJp["宇佐见堇子"] = {}
scJp["宇佐见堇子"]["深秘录"] = {
    ["1"] = "銃符「３Ｄプリンターガン」",
    ["2"] = "念力「サイコキネシスアプリ」",
    ["3"] = "念力「テレキネシス　電波塔」",
    ["4"] = "＊幻視せよ！異世界の狂気を＊",
    ["5"] = "念力「サイコプロ－ジョン」",
    ["6"] = "念力「テレキネシス　不法投棄」",
    ["7"] = "＊現し世のオカルティシャン＊",
    ["8"] = "＊深秘のエソテリックセブン＊"
}
scJp["宇佐见堇子"]["凭依华"] = {
    ["1"] = "銃符「３Ｄプリンターガン」",
    ["2"] = "念力「サイコキネシスアプリ」",
    ["3"] = "念力「テレキネシス　電波塔」",
    ["4"] = "＊幻視せよ！異世界の狂気を＊",
    ["5"] = "超能力「サイコキネシスエンドレス」",
    ["6"] = "夢礫符「羊毛色のサイコキネシス」",
    ["7"] = "Ｗ超能力「サイコキネシステレポーテーション」",
    ["8"] = "Ｗ超能力「絶体絶命メトロポリタン」",
    ["9"] = "「世紀のダブルエスパー　宇佐見菫子」",
    ["10"] = "槌礫符「大判小判ザックザクサイコキネシス」"
}

scJp["清兰"] = {}
scJp["清兰"]["绀珠传"] = {
    ["1"] = "凶弾「スピードストライク」",
    ["2"] = "弾符「イーグルシューティング」",
    ["3"] = "弾符「鷹は撃ち抜いた」",
    ["4"] = "銃符「ルナティックガン」"
}

scJp["铃瑚"] = {}
scJp["铃瑚"]["绀珠传"] = {
    ["1"] = "兎符「ストロベリーダンゴ」",
    ["2"] = "兎符「ベリーベリーダンゴ」",
    ["3"] = "兎符「ダンゴインフリューエンス」",
    ["4"] = "月見「セプテンバーフルムーン」",
    ["5"] = "月見酒「ルナティックセプテンバー」"
}

scJp["哆来咪"] = {}
scJp["哆来咪"]["绀珠传"] = {
    ["1"] = "夢符「緋色の悪夢」",
    ["2"] = "夢符「緋色の圧迫悪夢」",
    ["3"] = "夢符「藍色の愁夢」",
    ["4"] = "夢符「藍色の愁三重夢」",
    ["5"] = "夢符「愁永遠の夢」",
    ["6"] = "夢符「刈安色の迷夢」",
    ["7"] = "夢符「刈安色の錯綜迷夢」",
    ["8"] = "夢符「ドリームキャッチャー」",
    ["9"] = "夢符「蒼色のドリームキャッチャー」",
    ["10"] = "夢符「夢我夢中」",
    ["11"] = "月符「紺色の狂夢」",
    ["12"] = "胡蝶「バタフライサプランテーション」",
    ["13"] = "超特急「ドリームエクスプレス」",
    ["14"] = "這夢「クリーピングバレット」"
}
scJp["哆来咪"]["凭依华"] = {
    ["1"] = "夢符「留紺色の逃走夢」",
    ["2"] = "夢符「漆黑の宇宙夢」",
    ["3"] = "羊符「ナイトメア·オブ·キメラ」",
    ["4"] = "＊もう目覚めなくて良いのよ＊",
    ["5"] = "超能力「サイコキネシスエンドレス」",
    ["6"] = "夢礫符「羊毛色のサイコキネシス」",
    ["7"] = "霊符「夢想封印　夢限」",
    ["8"] = "星符「アステロイドベルトナイトメア」",
    ["9"] = "夢要符「羊毛色の乾坤一擲」",
    ["10"] = "面符「喜怒哀楽発狂マスカレード」",
    ["11"] = "化符「妖怪弾幕変化　夢見心地」",
    ["12"] = "光符「君を導く夢王道の威光」",
    ["13"] = "撃符「スカンダに追われる正夢」",
    ["14"] = "雷符「務光の雷霆閃光夢幻弾」",
    ["15"] = "龍符「ドラゴンズオプティカルドリーム」",
    ["16"] = "昇符「遥か宙まで飛べ！　僕らの夢を載せて」",
    ["17"] = "墜符「大気圏に落ちて、夢は地表に降り注ぐ」",
    ["18"] = "「大地を造り直そう、夢のある世界へ！」"
}

scJp["稀神探女"] = {}
scJp["稀神探女"]["绀珠传"] = {
    ["1"] = "玉符「烏合の呪」",
    ["2"] = "玉符「烏合の逆呪」",
    ["3"] = "玉符「烏合の二重呪」",
    ["4"] = "玉符「穢身探知型機雷」",
    ["5"] = "玉符「穢身探知型機雷　改」",
    ["6"] = "玉符「神々の弾冠」",
    ["7"] = "玉符「神々の光り輝く弾冠」",
    ["8"] = "「片翼の白鷺」"
}

scJp["克劳恩皮丝"] = {}
scJp["克劳恩皮丝"]["绀珠传"] = {
    ["1"] = "獄符「ヘルエクリプス」",
    ["2"] = "獄符「地獄の蝕」",
    ["3"] = "獄符「フラッシュアンドストライプ」",
    ["4"] = "獄符「スターアンドストライプ」",
    ["5"] = "獄炎「グレイズインフェルノ」",
    ["6"] = "獄炎「かすりの獄意」",
    ["7"] = "地獄「ストライプドアビス」",
    ["8"] = "「フェイクアポロ」",
    ["9"] = "「アポロ捏造説」"
}

scJp["纯狐"] = {}
scJp["纯狐"]["绀珠传"] = {
    ["1"] = "「掌の純光」",
    ["2"] = "「殺意の百合」",
    ["3"] = "「原始の神霊界」",
    ["4"] = "「現代の神霊界」",
    ["5"] = "「震え凍える星」",
    ["6"] = "「純粋なる狂気」",
    ["7"] = "「溢れ出る瑕穢」",
    ["8"] = "「地上穢の純化」",
    ["9"] = "純符「ピュアリーバレットヘル」",
    ["10"] = "純符「純粋な弾幕地獄」",
    ["11"] = "「袋の鼠を追い詰める為の単純な弾幕」",
    ["12"] = "「人を殺める為の純粋な弾幕」",
    ["13"] = "「最初で最後の無名の弾幕」"
}

scJp["赫卡提亚"] = {}
scJp["赫卡提亚"]["绀珠传"] = {
    ["1"] = "異界「逢魔ガ刻」",
    ["2"] = "地球「邪穢在身」",
    ["3"] = "月「アポロ反射鏡」",
    ["4"] = "異界「地獄のノンイデアル弾幕」",
    ["5"] = "地球「地獄に降る雨」",
    ["6"] = "月「ルナティックインパクト」",
    ["7"] = "「トリニタリアンラプソディ」",
    ["8"] = "「最初で最後の無名の弾幕」"
}

scJp["依神女苑"] = {}
scJp["依神女苑"]["凭依华"] = {
    ["1"] = "憑依剝奪「スレイブロバー」",
    ["2"] = "貧符「超貧乏玉」",
    ["3"] = "「クイーンオブバブル」",
    ["4"] = "「80'sのエクストーショナー」",
    ["5"] = "不運「ようこそ極貧の世界へ」",
    ["6"] = "財禍「プラックピジョン」",
    ["7"] = "憑依交換「アブソリュートルーザー」",
    ["8"] = "「最強最良の異変解決巫女」"
}

scJp["依神紫苑"] = {}
scJp["依神紫苑"]["凭依华"] = {
    ["1"] = "不運「ようこそ極貧の世界へ」",
    ["2"] = "財禍「プラックピジョン」",
    ["3"] = "憑依交換「アブソリュートルーザー」",
    ["4"] = "貧符「ミスチャンススキャッター」",
    ["5"] = "「最凶最悪の極貧不幸神」"
}

scJp["爱塔"] = {}
scJp["爱塔"]["天空璋"] = {
    ["1"] = "蝶符「ミニットスケールス」",
    ["2"] = "蝶符「アゲハの鱗粉」",
    ["3"] = "蝶符「フラッタリングサマー」",
    ["4"] = "蝶符「真夏の羽ばたき」"
}

scJp["坂田合欢乃"] = {}
scJp["坂田合欢乃"]["天空璋"] = {
    ["1"] = "雨符「囚われの秋雨」",
    ["2"] = "雨符「呪われた柴榑雨」",
    ["3"] = "刃符「山姥の包丁研ぎ」",
    ["4"] = "刃符「山姥の鬼包丁研ぎ」",
    ["5"] = "尽符「マウンテンマーダー」",
    ["6"] = "尽符「ブラッディマウンテンマーダー」"
}

scJp["莉莉"] = {}
scJp["莉莉"]["天空璋"] = {
    ["1"] = "春符「サプライズスプリング」"
}

scJp["高丽野阿吽"] = {}
scJp["高丽野阿吽"]["天空璋"] = {
    ["1"] = "犬符「野良犬の散歩」",
    ["2"] = "狗符「山狗の散歩」",
    ["3"] = "独楽「コマ犬回し」",
    ["4"] = "敌机 3面2符 独楽「カールアップアンドダイ」",
    ["5"] = "狛符「独り阿吽の呼吸」"
}

scJp["矢田寺成美"] = {}
scJp["矢田寺成美"]["天空璋"] = {
    ["1"] = "魔符「インスタントボーディ」 ",
    ["2"] = "魔符「即席菩提」",
    ["3"] = "魔符「バレットゴーレム」",
    ["4"] = "魔符「ペットの巨大弾生命体」",
    ["5"] = "地蔵「クリミナルサルヴェイション」",
    ["6"] = "地蔵「業火救済」"
}

scJp["尔子田里乃"] = {}
scJp["尔子田里乃"]["天空璋"] = {
    ["1"] = "茗荷「フォゲットユアネーム」",
    ["2"] = "冥加「ビハインドユー」",
    ["3"] = "舞符「ビハインドフェスティバル」",
    ["4"] = "狂舞「テングオドシ」",
    ["5"] = "狂舞「狂乱天狗怖し」",
    ["6"] = "鼓舞「パワフルチアーズ」",
    ["7"] = "狂舞「クレイジーバックダンス」",
    ["8"] = "弾舞「二つ目の台風」"
}

scJp["丁礼田舞"] = {}
scJp["丁礼田舞"]["天空璋"] = {
    ["1"] = "竹符「バンブースピアダンス」",
    ["2"] = "竹符「バンブークレイジーダンス」",
    ["3"] = "笹符「タナバタスターフェスティバル」",
    ["4"] = "舞符「ビハインドフェスティバル」",
    ["5"] = "狂舞「テングオドシ」",
    ["6"] = "狂舞「狂乱天狗怖し」",
    ["7"] = "鼓舞「パワフルチアーズ」",
    ["8"] = "狂舞「クレイジーバックダンス」",
    ["9"] = "弾舞「二つ目の台風」"
}

scJp["摩多罗隐岐奈"] = {}
scJp["摩多罗隐岐奈"]["天空璋"] = {
    ["1"] = "後符「秘神の後光」",
    ["2"] = "後符「絶対秘神の後光」",
    ["3"] = "裏夏「スコーチ・バイ・ホットサマー」",
    ["4"] = "裏夏「異常猛暑の焦土」",
    ["5"] = "裏秋「ダイ・オブ・ファミン」",
    ["6"] = "裏秋「異常枯死の餓鬼」",
    ["7"] = "裏冬「ブラックスノーマン」",
    ["8"] = "裏冬「異常降雪の雪だるま」",
    ["9"] = "裏春「エイプリルウィザード」",
    ["10"] = "裏春「異常落花の魔術使い」",
    ["11"] = "「裏・ブリージーチェリーブロッサム」",
    ["12"] = "「裏・パーフェクトサマーアイス」",
    ["13"] = "「裏・クレイジーフォールウィンド」",
    ["14"] = "「裏・エクストリームウィンター」",
    ["15"] = "秘儀「リバースインヴォーカー」",
    ["16"] = "秘儀「裏切りの後方射撃」",
    ["17"] = "秘儀「弾幕の玉繭」",
    ["18"] = "秘儀「穢那の火」",
    ["19"] = "秘儀「後戸の狂言」",
    ["20"] = "秘儀「マターラドゥッカ」",
    ["21"] = "秘儀「七星の剣」",
    ["22"] = "秘儀「無縁の芸能者」",
    ["23"] = "「背面の暗黒猿楽」",
    ["24"] = "「アナーキーバレットヘル」"
}

scJp["绵月依姬"] = {}
scJp["绵月依姬"]["儚月抄"] = {
    ["1"] = "「火雷神」",
    ["2"] = "「金山彦命」",
    ["3"] = "「天津甕星」",
    ["4"] = "「石凝姥命」",
    ["5"] = "「天宇受売命」",
    ["6"] = "「天照大御神」",
    ["7"] = "「伊豆能売」"
}

return scJp
