--符卡日文
local scJp = {}

scJp["博丽灵梦"] = {}
scJp["博丽灵梦"]["红魔乡"] = {
    "霊符「夢想封印」",
    "夢符「封魔陣」"
}
scJp["博丽灵梦"]["妖妖梦"] = {
    "霊符「夢想封印　散」",
    "霊符「夢想封印　集」",
    "夢符「封魔陣」",
    "夢符「二重結界」"
}
scJp["博丽灵梦"]["萃梦想"] = {
    "霊符「夢想妙珠」",
    "神霊「夢想封印」",
    "夢符「封魔陣」",
    "神技「八方鬼縛陣」",
    "宝符「陰陽宝玉」",
    "宝具「陰陽鬼神玉」",
    "符の壱「夢想妙珠連」",
    "符の弐「陰陽散華」",
    "符の参「魔浄閃結」",
    "力符「陰陽玉将」",
    "夢戦「幻想之月」",
    "無題「空を飛ぶ不思議な巫女」"
}
scJp["博丽灵梦"]["永夜抄"] = {
    "霊符「夢想妙珠」",
    "神霊「夢想封印　瞬」",
    "夢符「二重結界」",
    "夢境「二重大結界」",
    "霊符「夢想封印　散」",
    "散霊「夢想封印　寂」",
    "夢符「封魔陣」",
    "神技「八方鬼縛陣」",
    "神技「八方龍殺陣」",
    "霊符「夢想封印　集」",
    "回霊「夢想封印　侘」",
    "境界「二重弾幕結界」",
    "大結界「博麗弾幕結界」",
    "神霊「夢想封印　瞬」",
    "「夢想天生」"
}
scJp["博丽灵梦"]["花映塚"] = {
    "霊符「陰陽印」",
    "霊符「夢想封印」",
    "霊符「博麗幻影」"
}
scJp["博丽灵梦"]["绯想天"] = {
    "祈願「厄除け祈願」",
    "宝符「躍る陰陽玉」",
    "夢境「二重大結界」",
    "光霊「神霊宝珠」",
    "「境界の内側に潜む霊と不思議な巫女」",
    "霊符「夢想妙珠」",
    "神霊「夢想封印」",
    "神技「八方鬼縛陣」",
    "珠符「明珠暗投」",
    "宝符「陰陽宝玉」",
    "宝具「陰陽鬼神玉」",
    "神技「天覇風神脚」",
    "「夢想天生」"
}
scJp["博丽灵梦"]["地灵殿"] = {
    "非常識の裏側",
    "「萃霊花」",
    "「鴉の闇」"
}
scJp["博丽灵梦"]["星莲船"] = {
    "夢符「退魔符乱舞」",
    "霊符「夢想封印」"
}
scJp["博丽灵梦"]["非想天则"] = {
    "御守「妖怪足止めお守り」",
    "霊符「夢想封印　円」",
    "神霊「夢想封印　瞬」",
    "「最も凶悪なびっくり巫女玉」",
    "夢符「封魔陣」",
    "結界「拡散結界」"
}
scJp["博丽灵梦"]["文花帖DS"] = {
    "お札「新聞拡張団調伏」",
    "結界「パパラッチ撃退結界」",
    "夢符「夢想亜空穴」"
}
scJp["博丽灵梦"]["神灵庙"] = {
    "霊符「夢想封印」"
}
scJp["博丽灵梦"]["心绮楼"] = {
    "御札「神社繁盛祈願札」",
    "御札「夢幻の高速祈願札」",
    "御札「対妖怪方位除」",
    "「信仰心増大祈願の儀」",
    "「二大宗教九字護身法」",
    "「面霊気大調伏」",
    "「最後のトリニティリリージョン」",
    "霊符「夢想封印」",
    "宝具「陰陽飛鳥井」",
    "神技「八方龍殺陣」",
    "「夢想天生」"
}
scJp["博丽灵梦"]["辉针城"] = {
    "妖器「無慈悲なお祓い棒」",
    "霊符「夢想封印」"
}
scJp["博丽灵梦"]["天邪鬼"] = {
    "神籤「反則結界」",
    "「パスウェイジョンニードル」"
}
scJp["博丽灵梦"]["天邪鬼GR"] = {
    "「反則結界」",
    "「天国にいちばん近いお賽銭」",
    "「だんまく長者」"
}
scJp["博丽灵梦"]["深秘录"] = {
    "霊符「夢想封印」",
    "神技「八方龍殺陣」",
    "宝具「陰陽飛鳥井」",
    "＊あんな隙間に巫女がいるなんて！＊",
    "結界「至る所の青山」",
    "針符「月卿を封じる針」",
    "結界「乱暴な世界の裂け目」",
    "結界「幻想バウンダリークラック」"
}
scJp["博丽灵梦"]["绀珠传"] = {
    "霊符「夢想封印」"
}
scJp["博丽灵梦"]["凭依华"] = {
    "霊符「夢想封印」",
    "神技「八方龍殺陣」",
    "宝具「陰陽飛鳥井」",
    "＊あんな隙間に巫女がいるなんて！＊",
    "霊鷹符「鷹による夢想封印ハンティング」",
    "風霊符「磐舟かわらけ封印」",
    "星霊符「スプリンクルスター封印」",
    "雷霊符「務光の雷弾夢想封印」",
    "龍蹴符「ドラゴンズ飛鳥井キック」",
    "針星符「月卿を封じる針スパーク」",
    "「この何度目かの命、夢想封印されるまで」",
    "霊符「夢想封印　夢限」",
    "「完全憑依と夢想封印」",
    "「憑坐マスターと神霊スレイブの境界」",
    "「最強最良の異変解決巫女」"
}
scJp["博丽灵梦"]["天空璋"] = {
    "霊符「夢想桜花封印」"
}
scJp["博丽灵梦"]["噩梦日记"] = {
    "「盗撮者調伏マスタースパーク」",
    "「背後からの盗撮者調伏」",
    "「許可無く弾幕は撮影禁止です」"
}
scJp["博丽灵梦"]["儚月抄"] = {
    "「大禍津日」"
}
scJp["博丽灵梦"]["东方LWC"] = {
    "夢符「幻想一重」"
}

scJp["雾雨魔理沙"] = {}
scJp["雾雨魔理沙"]["红魔乡"] = {
    "魔符「スターダストレヴァリエ」",
    "恋符「マスタースパーク」"
}
scJp["雾雨魔理沙"]["妖妖梦"] = {
    "魔符「スターダストレヴァリエ」",
    "魔符「ミルキーウェイ」",
    "恋符「ノンディレクショナルレーザー」",
    "恋符「マスタースパーク」"
}
scJp["雾雨魔理沙"]["萃梦想"] = {
    "恋符「マスタースパーク」",
    "魔砲「ファイナルスパーク」",
    "魔符「スターダストレヴァリエ」",
    "彗星「ブレイジングスター」",
    "儀符「オーレリーズサン」",
    "天儀「オーレリーズソーラーシステム」",
    "符の壱「スターダストレヴァリエ」",
    "符の弐「アステロイドベルト」",
    "符の参「マスタースパーク」",
    "星符「ドラゴンメテオ」"
}
scJp["雾雨魔理沙"]["永夜抄"] = {
    "恋符「マスタースパーク」",
    "魔砲「ファイナルスパーク」",
    "魔符「ミルキーウェイ」",
    "魔空「アステロイドベルト」",
    "魔符「スターダストレヴァリエ」",
    "黒魔「イベントホライズン」",
    "恋符「ノンディレクショナルレーザー」",
    "恋風「スターライトタイフーン」",
    "恋符「マスタースパーク」",
    "恋心「ダブルスパーク」",
    "光符「アースライトレイ」",
    "光撃「シュート・ザ・ムーン」",
    "魔砲「ファイナルスパーク」",
    "魔砲「ファイナルマスタースパーク」",
    "「ブレイジングスター」"
}
scJp["雾雨魔理沙"]["花映塚"] = {
    "魔符「スターダスト」",
    "魔符「スターダストレヴァリエ」",
    " 魔符「イリュージョンスター」"
}
scJp["雾雨魔理沙"]["绯想天"] = {
    "星符「ポラリスユニーク」",
    "天儀「オーレリーズユニバース」",
    "邪恋「実りやすいマスタースパーク」",
    "恋符「マスタースパーク」",
    "星符「ドラゴンメテオ」",
    "魔符「スターダストレヴァリエ」",
    "魔砲「ファイナルスパーク」",
    "彗星「ブレイジングスター」",
    "星符「エスケープベロシティ」",
    "星符「メテオニックシャワー」",
    "光符「ルミネスストライク」",
    "仪符「オーレリーズサン」",
    "邪恋「実りやすいマスタースパーク」"
}
scJp["雾雨魔理沙"]["地灵殿"] = {
    "「リモートサクリファイス」",
    "「ファイブシーズン」",
    "「オプティカルカモフラージュ」"
}
scJp["雾雨魔理沙"]["星莲船"] = {
    "恋符「マスタースパーク」",
    "魔符「アルティメットショートウェーブ」"
}
scJp["雾雨魔理沙"]["非想天则"] = {
    "星符「エキセントリックアステロイド」",
    "流光「シューティングエコー」",
    "魔符「マジカルＲ３６０」",
    "星符「グラビティビート」",
    "光符「アースライトレイ」",
    "恋符「ノンディレクショナルレーザー」",
    "魔廃「ディープエコロジカルボム」"
}
scJp["雾雨魔理沙"]["文花帖DS"] = {
    "星符「オールトクラウド」",
    "天儀「オーレリーズソーラーシステム」",
    "彗星「ブレイジングスター」"
}
scJp["雾雨魔理沙"]["大战争"] = {
    "光符「ミステリアスビーム」",
    "光撃「シュート・ザ・リトルムーン」",
    "魔弾「テストスレイブ」",
    "闭符「ビッグクランチ」",
    "恋符「マスタースパークのような懐中電灯」",
    "魔开「オープンユニバース」",
    "魔十字「グランドクロス」",
    "流星「スーパーペルセイド」",
    "「ブレイジングスターのような鬼ごっこ」",
    "「妖精尽滅光」"
}
scJp["雾雨魔理沙"]["神灵庙"] = {
    "恋符「マスタースパーク」"
}
scJp["雾雨魔理沙"]["心绮楼"] = {
    "恋符「マスタースパーク」",
    "彗星「ブレイジングスター」",
    "星符「サテライトイリュージョン」",
    "「サングレイザー」",
    "星符「ミリ秒パルサー」",
    "魔符「ブレイズアウェイ」"
}
scJp["雾雨魔理沙"]["辉针城"] = {
    "妖器「ダークスパーク」",
    "マジックアブソーバー"
}
scJp["雾雨魔理沙"]["天邪鬼"] = {
    "恋符「ワイドマスター」",
    "恋符「マシンガンスパーク」"
}
scJp["雾雨魔理沙"]["深秘录"] = {
    "恋符「マスタースパーク」",
    "彗星「ブレイジングスター」",
    "星符「サテライトイリュージョン」",
    "＊ステキ！厠の花子さん！＊",
    "星符「オカルテイション」",
    "＊呪われた歴代校長の肖像＊",
    "＊夜の学校怪談行脚＊"
}
scJp["雾雨魔理沙"]["绀珠传"] = {
    "恋符「マスタースパーク」"
}
scJp["雾雨魔理沙"]["凭依华"] = {
    "恋符「マスタースパーク」",
    "彗星「ブレイジングスター」",
    "星符「サテライトイリュージョン」",
    "＊ステキ！厠の花子さん！＊",
    "星恋符「スプリンクルスター＆ハート」",
    "拳星符「入道叢雲スレイブスパーク」",
    "星霊符「スプリンクルスター封印」",
    "針星符「月卿を封じる針スパーク」",
    "星符「アステロイドベルトナイトメア」"
}
scJp["雾雨魔理沙"]["天空璋"] = {
    "恋符「マスタースパークフローズン」"
}
scJp["雾雨魔理沙"]["噩梦日记"] = {
    "「盗撮者調伏マスタースパーク」",
    "「弾幕結界を撃ち抜け！」",
    "「卑怯者マスタースパーク」"
}
scJp["雾雨魔理沙"]["儚月抄"] = {
    "「スターダストレヴァリエ」",
    "「イベントホライズン」",
    "「ファイナルスパーク」",
    "「ダブルスパーク」"
}

scJp["露米娅"] = {}
scJp["露米娅"]["红魔乡"] = {
    "月符「ムーンライトレイ」",
    "夜符「ナイトバード」",
    "闇符「ディマーケイション」"
}
scJp["露米娅"]["文花帖"] = {
    "闇符「ダークサイドオブザムーン」",
    "夜符「ミッドナイトバード」"
}

scJp["琪露诺"] = {}
scJp["琪露诺"]["红魔乡"] = {
    "氷符「アイシクルフォール」",
    "雹符「ヘイルストーム」",
    "凍符「パーフェクトフリーズ」",
    "雪符「ダイアモンドブリザード」"
}
scJp["琪露诺"]["妖妖梦"] = {
    "凍符「フリーズアクトレス」",
    "霜符「フロストコラムス」"
}
scJp["琪露诺"]["花映塚"] = {
    "凍符「パーフェクトフリーズ」",
    "凍符「コールドディヴィニティー」"
}
scJp["琪露诺"]["文花帖"] = {
    "雪符「ダイヤモンドブリザード」",
    "凍符「マイナスＫ」"
}
scJp["琪露诺"]["非想天则"] = {
    "氷符「アイシクルフォール」",
    "凍符「マイナスＫ」",
    "氷符「アイシクルマシンガン」",
    "氷符「フェアリースピン」",
    "氷塊「コールドスプリンクラー」",
    "冷体「スーパーアイスキック」",
    "氷符「ソードフリーザー」",
    "凍符「フリーズアトモスフェア」",
    "冷符「瞬間冷凍ビーム」",
    "霜符「フロストコラムス」",
    "吹氷「アイストルネード」",
    "凍符「パーフェクトフリーズ」",
    "氷塊「グレートクラッシャー」"
}
scJp["琪露诺"]["大战争"] = {
    "パーフェクトフリーズ"
}
scJp["琪露诺"]["辉针城"] = {
    "氷符「アルティメットブリザード」"
}
scJp["琪露诺"]["天邪鬼"] = {
    "氷符「パーフェクトグレーシェリスト」",
    "氷王「フロストキング」"
}
scJp["琪露诺"]["天空璋"] = {
    "氷符「クールサンフラワー」"
}

scJp["红美铃"] = {}
scJp["红美铃"]["红魔乡"] = {
    "華符「芳華絢爛」",
    "華符「セラギネラ９」",
    "虹符「彩虹の風鈴」",
    "幻符「華想夢葛」",
    "彩符「彩雨」",
    "彩符「彩光乱舞」",
    "彩符「極彩颱風」"
}
scJp["红美铃"]["萃梦想"] = {
    "彩符「彩光風鈴」",
    "光符「華光玉」",
    "華符「破山砲」",
    "極彩「彩光乱舞」",
    "極光「華厳明星」",
    "三華「崩山彩極砲」"
}
scJp["红美铃"]["文花帖"] = {
    "華符「彩光蓮華掌」",
    "彩翔「飛花落葉」",
    "彩華「虹色太極拳」"
}
scJp["红美铃"]["非想天则"] = {
    "彩符「極彩沛雨」",
    "彩翔「飛花落葉」",
    "彩符「彩光風鈴」",
    "虹符「烈虹真拳」",
    "気符「星脈弾」",
    "撃符「大鵬拳」",
    "気符「地龍天龍脚」",
    "極彩「彩光乱舞」",
    "彩華「虹色太極拳」",
    "気符「猛虎内勁」",
    "星気「星脈地転弾」",
    "熾撃「大鵬墜撃拳」",
    "華符「彩光蓮華掌」"
}

scJp["帕秋莉"] = {}
scJp["帕秋莉"]["红魔乡"] = {
    "火符「アグニシャイン」 ",
    "水符「プリンセスウンディネ」 ",
    "木符「シルフィホルン」 ",
    "土符「レイジィトリリトン」 ",
    "金符「メタルファティーグ」 ",
    "火符「アグニシャイン上級」 ",
    "木符「シルフィホルン上級」 ",
    "土符「レイジィトリリトン上級」 ",
    "火符「アグニレイディアンス」 ",
    "水符「ベリーインレイク」 ",
    "木符「グリーンストーム」 ",
    "土符「トリリトンシェイク」 ",
    "金符「シルバードラゴン」 ",
    "火＆土符「ラーヴァクロムレク」 ",
    "木＆火符「フォレストブレイズ」 ",
    "水＆木符「ウォーターエルフ」 ",
    "金＆水符「マーキュリポイズン」 ",
    "土＆金符「エメラルドメガリス」 ",
    "月符「サイレントセレナ」 ",
    "日符「ロイヤルフレア」 ",
    "火水木金土符「賢者の石」 ",
}
scJp["帕秋莉"]["萃梦想"] = {
    "火金符「セントエルモピラー」",
    "土水符「ノエキアンデリュージュ」",
    "金木符「エレメンタルハーベスター」",
    "日符「ロイヤルフレア」",
    "月符「サイレントセレナ」",
    "火水木金土符「賢者の石」",
    "符の壱「セントエルモエクスプロージョン」",
    "符の弐「デリュージュフォーティディ」",
    "金土符「ジンジャガスト」"
}
scJp["帕秋莉"]["文花帖"] = {
    "日＆水符「ハイドロジェナスプロミネンス」",
    "水＆火符「フロギスティックレイン」",
    "月＆木符「サテライトヒマワリ」",
    "日＆月符「ロイヤルダイヤモンドリング」"
}
scJp["帕秋莉"]["绯想天"] = {
    "火金符「セントエルモピラー」",
    "土水符「ノエキアンデリュージュ」",
    "金木符「エレメンタルハーベスター」",
    "日符「ロイヤルフレア」",
    "月符「サイレントセレナ」",
    "火水木金土符「賢者の石」",
    "水符「ジェリーフィッシュプリンセス」",
    "月木符「サテライトヒマワリ」",
    "日木符「フォトシンセシス」",
    "火符「アキバサマー」",
    "水符「ジェリーフィッシュプリンセス」",
    "月金符「サンシャインリフレクター」"
}
scJp["帕秋莉"]["非想天则"] = {
    "火水符「フロギスティックピラー」",
    "土金符「エメラルドメガロポリス」",
    "日月符「ロイヤルダイアモンドリング」",
    "火符「リングオブアグニ」",
    "水符「プリンセスウンディネ」"
}

scJp["十六夜咲夜"] = {}
scJp["十六夜咲夜"]["红魔乡"] = {
    "奇術「ミスディレクション」",
    "奇術「幻惑ミスディレクション」",
    "幻在「クロックコープス」",
    "幻幽「ジャック·ザ·ルドビレ」",
    "幻象「ルナクロック」",
    "幻世「ザ·ワールド」",
    "メイド秘技「操りドール」",
    "メイド秘技「殺人ドール」",
    "奇術「エターナルミーク」"
}
scJp["十六夜咲夜"]["妖妖梦"] = {
    "幻符「インディスクリミネイト」",
    "幻符「殺人ドール」",
    "時符「パーフェクトスクウェア」",
    "時符「プライベートスクウェア」"
}
scJp["十六夜咲夜"]["萃梦想"] = {
    "幻符「殺人ドール」",
    "幻葬「夜霧の幻影殺人鬼」",
    "時符「プライベートスクウェア」",
    "「咲夜の世界」",
    "傷符「インスクライブレッドソウル」",
    "傷魂「ソウルスカルプチュア」",
    "符の壱「連続殺人ドール」",
    "符の弐「チェックメイド」",
    "戏法「クロースアップ殺人鬼」"
}
scJp["十六夜咲夜"]["永夜抄"] = {
    "幻符「殺人ドール」",
    "幻葬「夜霧の幻影殺人鬼」",
    "「デフレーションワールド」"
}
scJp["十六夜咲夜"]["花映塚"] = {
    "時符「プライベートヴィジョン」",
    "時符「ミステリアスジャック」"
}
scJp["十六夜咲夜"]["文花帖"] = {
    "時符「トンネルエフェクト」",
    "空虚「インフレーションスクウェア」",
    "銀符「パーフェクトメイド」"
}
scJp["十六夜咲夜"]["绯想天"] = {
    "幻符「殺人ドール」",
    "時符「プライベートスクウェア」",
    "傷符「インスクライブレッドソウル」",
    "幻葬「夜霧の幻影殺人鬼」",
    "「咲夜の世界」",
    "傷魂「ソウルスカルプチュア」",
    "銀符「シルバーバウンド」",
    "奇術「エターナルミーク」",
    "速符「ルミネスリコシェ」",
    "時符「咲夜特製ストップウォッチ」",
    "銀符「シルバーバウンド」",
    "時符「咲夜特製ストップウォッチ」",
    "幻術「マイナイフリカージョン」",
    "時符「シルバーアキュート360」"
}
scJp["十六夜咲夜"]["非想天则"] = {
    "時符「イマジナリバーチカルタイム」",
    "時計「ルナダイアル」",
    "光速「Ｃ．リコシェ」"
}
scJp["十六夜咲夜"]["辉针城"] = {
    "妖器「银色のアナザーディメンジョン」",
    "时符「デュアルバニッシュ」"
}
scJp["十六夜咲夜"]["天邪鬼"] = {
    "時符「タイムストッパー咲夜」",
    "時符「チェンジリングマジック」"
}
scJp["十六夜咲夜"]["儚月抄"] = {
    " 「ルミネスリコシェ」",
    "「私の世界」"
}

scJp["蕾米莉亚"] = {}
scJp["蕾米莉亚"]["红魔乡"] = {
    "天罰「スターオブダビデ」",
    "神罰「幼きデーモンロード」",
    "冥符「紅色の冥界」",
    "獄符「千本の針の山」",
    "呪詛「ブラド・ツェペシュの呪い」",
    "神術「吸血鬼幻想」",
    "紅符「スカーレットシュート」",
    "紅符「スカーレットマイスタ」",
    "「レッドマジック」",
    "「紅色の幻想郷」"
}
scJp["蕾米莉亚"]["萃梦想"] = {
    "紅符「不夜城レッド」",
    "紅魔「スカーレットデビル」",
    "必殺「ハートブレイク」",
    "神槍「スピア・ザ・グングニル」",
    "夜符「デーモンキングクレイドル」",
    "夜王「ドラキュラクレイドル」",
    "符の壱「バッドレディスクランブル」",
    "符の弐「マイハートブレイク」",
    "符の参「ヘルカタストロフィ」",
    "夜符「クイーン·オブ·ミッドナイト」",
    "「レッドマジック」"
}
scJp["蕾米莉亚"]["永夜抄"] = {
    "紅符「不夜城レッド」",
    "紅魔「スカーレットデビル」",
    "「スカーレットディスティニー」"
}
scJp["蕾米莉亚"]["文花帖"] = {
    "魔符「全世界ナイトメア」",
    "紅符「ブラッディマジックスクウェア」",
    "紅蝙蝠「ヴァンピリッシュナイト」",
    "神鬼「レミリアストーカー」"
}
scJp["蕾米莉亚"]["绯想天"] = {
    "紅符「不夜城レッド」",
    "必殺「ハートブレイク」",
    "夜符「デーモンキングクレイドル」",
    "紅魔「スカーレットデビル」",
    "神槍「スピア・ザ・グングニル」",
    "夜王「ドラキュラクレイドル」",
    "夜符「バッドレディスクランブル」",
    "運命「ミゼラブルフェイト」",
    "運命「ミゼラブルフェイト」",
    "夜符「ボンバードナイト」",
    "蝙蝠「ヴァンパイアスウィープ」",
    "神鬼「レミリアストーカー」"
}
scJp["蕾米莉亚"]["非想天则"] = {
    "悪魔「レミリアストレッチ」",
    "「ミレニアムの吸血鬼」"
}
scJp["蕾米莉亚"]["天邪鬼"] = {
    "「フィットフルナイトメア」",
    "「きゅうけつ鬼ごっこ」"
}
scJp["蕾米莉亚"]["噩梦日记"] = {
    "紅魔符「ブラッディカタストロフ」",
    "紅星符「超人ブラッディナイフ」",
    "神紅符「ブラッディ十七条のレーザー」"
}
scJp["蕾米莉亚"]["儚月抄"] = {
    "「クイーン·オブ·ミッドナイト」"
}

scJp["芙兰朵露"] = {}
scJp["芙兰朵露"]["红魔乡"] = {
    "禁忌「クランベリートラップ」",
    "禁忌「レーヴァテイン」",
    "禁忌「フォーオブアカインド」",
    "禁忌「カゴメカゴメ」",
    "禁忌「恋の迷路」",
    "禁弾「スターボウブレイク」",
    "禁弾「カタディオプトリック」",
    "禁弾「過去を刻む時計」",
    "秘弾「そして誰もいなくなるか？」",
    "QED「495年の波紋」"
}
scJp["芙兰朵露"]["文花帖"] = {
    "禁忌「フォービドゥンフルーツ」",
    "禁忌「禁じられた遊び」"
}
scJp["芙兰朵露"]["噩梦日记"] = {
    "紅魔符「ブラッディカタストロフ」",
    "紅神符「十七条のカタストロフ」",
    "紅星符「超人カタストロフ行脚」"
}

scJp["蕾蒂"] = {}
scJp["蕾蒂"]["妖妖梦"] = {
    "寒符「リンガリングコールド」",
    "冬符「フラワーウィザラウェイ」",
    "白符「アンデュレイションレイ」",
    "怪符「テーブルターニング」"
}
scJp["蕾蒂"]["文花帖"] = {
    "寒符「コールドスナップ」",
    "冬符「ノーザンウイナー」"
}

scJp["橙"] = {}
scJp["橙"]["妖妖梦"] = {
    "仙符「鳳凰卵」",
    "仙符「鳳凰展翅」",
    "式符「飛翔晴明」",
    "陰陽「道満晴明」",
    "陰陽「晴明大紋」",
    "天符「天仙鳴動」",
    "翔符「飛翔韋駄天」",
    "童符「護法天童乱舞」",
    "仙符「屍解永遠」",
    "鬼符「鬼門金神」",
    "方符「奇門遁甲」",
    "鬼符「青鬼赤鬼」",
    "鬼神「飛翔毘沙門天」"
}
scJp["橙"]["文花帖"] = {
    "星符「飛び重ね鱗」",
    "鬼神「鳴動持国天」",
    "化猫「橙」"
}

scJp["爱丽丝"] = {}
scJp["爱丽丝"]["妖妖梦"] = {
    "操符「乙女文楽」",
    "蒼符「博愛の仏蘭西人形」",
    "蒼符「博愛のオルレアン人形」",
    "紅符「紅毛の和蘭人形」",
    "白符「白亜の露西亜人形」",
    "闇符「霧の倫敦人形」",
    "廻符「輪廻の西蔵人形」",
    "雅符「春の京人形」",
    "咒詛「魔彩光の上海人形」",
    "咒詛「首吊り蓬莱人形」"
}
scJp["爱丽丝"]["萃梦想"] = {
    "魔符「アーティフルサクリファイス」",
    "魔操「リターンイナニメトネス」",
    "戦符「リトルレギオン」",
    "戦操「ドールズウォー」",
    "咒符「上海人形」",
    "咒詛「蓬莱人形」",
    "符の壱「アーティフルチャンター」",
    "符の弐「ドールクルセイダー」",
    "魔光「デヴィリーライトレイ」"
}
scJp["爱丽丝"]["永夜抄"] = {
    "魔符「アーティフルサクリファイス」",
    "魔操「リターンイナニメトネス」",
    "「グランギニョル座の怪人」"
}
scJp["爱丽丝"]["文花帖"] = {
    "操符「ドールズインシー」",
    "呪符「ストロードールカミカゼ」",
    "赤符「ドールミラセティ」"
}
scJp["爱丽丝"]["绯想天"] = {
    "魔符「アーティフルサクリファス」",
    "戦符「リトルレギオン」",
    "咒符「上海人形」",
    "魔操「リターンイナニメトネス」",
    "戦操「ドールズウォー」",
    "咒詛「蓬莱人形」",
    "偵符「シーカードールズ」",
    "紅符「和蘭人形」",
    "人形「未来文楽」",
    "注力「トリップワイヤー」",
    "足軽「スーサイドスクワッド」",
    "剣符「ソルジャーオブクロス」",
    "人形「魂のないフォークダンス」"
}
scJp["爱丽丝"]["非想天则"] = {
    "槍符「キューティー大千槍」",
    "人形「レミングスパレード」",
    "人形「セミオートマトン」",
    "騎士「ドールオブラウンドテーブル」",
    "犠牲「スーサイドパクト」",
    "試験中「レベルティターニア」",
    "試験中「ゴリアテ人形」"
}

scJp["莉莉"] = {}
scJp["莉莉"]["天空璋"] = {
    "春符「サプライズスプリング」"
}

scJp["骚灵三姐妹"] = {}
scJp["骚灵三姐妹"]["妖妖梦"] = {
    "騒符「ファントムディニング」",
    "騒符「ライブポルターガイスト」",
    "合葬「プリズムコンチェルト」",
    "騒葬「スティジャンリバーサイド」",
    "大合葬「霊車コンチェルトグロッソ」",
    "大合葬「霊車コンチェルトグロッソ改」",
    "大合葬「霊車コンチェルトグロッソ怪」"
}

scJp["露娜萨"] = {}
scJp["露娜萨"]["妖妖梦"] = {
    "弦奏「グァルネリ・デル・ジェス」",
    "神弦「ストラディヴァリウス」",
    "偽弦「スードストラディヴァリウス」"
}
scJp["露娜萨"]["花映塚"] = {
    "騒符「ノイズメランコリー」",
    "騒符「ルナサ・ソロライブ」"
}

scJp["梅露兰"] = {}
scJp["梅露兰"]["妖妖梦"] = {
    "管霊「ヒノファンタズム」",
    "冥管「ゴーストクリフォード」",
    "管霊「ゴーストクリフォード」"
}
scJp["梅露兰"]["花映塚"] = {
    "騒符「ソウルゴーハッピー」",
    "騒符「メルラン・ハッピーライブ」"
}

scJp["莉莉卡"] = {}
scJp["莉莉卡"]["妖妖梦"] = {
    "冥鍵「ファツィオーリ冥奏」",
    "鍵霊「ベーゼンドルファー神奏」"
}
scJp["莉莉卡"]["花映塚"] = {
    "騒符「ソウルノイズフロー」",
    "騒符「リリカ・ソロライブ」"
}

scJp["魂魄妖梦"] = {}
scJp["魂魄妖梦"]["妖妖梦"] = {
    "幽鬼剣「妖童餓鬼の断食」",
    "餓鬼剣「餓鬼道草紙」",
    "餓王剣「餓鬼十王の報い」",
    "獄界剣「二百由旬の一闪」",
    "獄炎剣「業風閃影陣」",
    "獄神剣「業風神閃斬」",
    "畜趣剣「無為無策の冥罰」",
    "修羅剣「現世妄執」",
    "人界剣「悟入幻想」",
    "人世剣「大悟顕晦」",
    "人神剣「俗諦常住」",
    "天上剣「天人の五衰」",
    "天界剣「七魄忌諱」",
    "天神剣「叁魂七魄」",
    "六道剣「一念無量劫」"
}
scJp["魂魄妖梦"]["萃梦想"] = {
    "人符「現世斬」",
    "人鬼「未来永劫斬」",
    "断命剣「冥想斬」",
    "断迷剣「迷津慈航斬」",
    "魂符「幽明の苦輪」",
    "魂魄「幽明求聞持聡明の法」",
    "符の壱「二重の苦輪」",
    "符の弐「心眼迷想斬」",
    "符の参「業風神閃斬」",
    "奥義「西行春風斬」"
}
scJp["魂魄妖梦"]["永夜抄"] = {
    "人符「现世斩」",
    "人鬼「未来永劫斩」",
    "「待宵反射卫星斩」"
}
scJp["魂魄妖梦"]["花映塚"] = {
    "迷符「缠缚剑」",
    "迷符「半身大悟」"
}
scJp["魂魄妖梦"]["文花帖"] = {
    "人智剣「天女返し」",
    "妄執剣「修羅の血」",
    "天星剣「涅槃寂静の如し」",
    "四生剣「衆生無性の響き」"
}
scJp["魂魄妖梦"]["绯想天"] = {
    "人智剣「天女返し」",
    "桜花剣「閃々散華」",
    "断想剣「草木成仏斬」",
    "瞑斬「楼観から弾をも断つ心の眼」",
    "人符「現世斬」",
    "断命剣「冥想斬」",
    "魂符「幽明の苦輪」",
    "人鬼「未来永劫斬」",
    "断迷剣「迷津慈航斬」",
    "魂魄「幽明求聞持聡明の法」　",
    "剣伎「桜花闪々」",
    "断霊剣「成仏得脱斬」"
}
scJp["魂魄妖梦"]["非想天则"] = {
    "空観剣「六根清浄斬」",
    "転生剣「円心流転斬」"
}
scJp["魂魄妖梦"]["神灵庙"] = {
    "空観剣「六根清浄斬」"
}
scJp["魂魄妖梦"]["弹幕天邪鬼"] = {
    "光符「冥府光芒一閃」",
    "彼岸剣「地獄極楽滅多斬り」"
}

scJp["西行寺幽幽子"] = {}
scJp["西行寺幽幽子"]["妖妖梦"] = {
    "亡郷「亡我郷 -さまよえる魂-」",
    "亡郷「亡我郷 -宿罪-」",
    "亡郷「亡我郷 -道無き道-」",
    "亡郷「亡我郷 -自尽-」",
    "亡舞「生者必滅の理 -眩惑-」",
    "亡舞「生者必滅の理 -死蝶-」",
    "亡舞「生者必滅の理 -毒蛾-」",
    "亡舞「生者必滅の理 -魔境-」",
    "華霊「ゴーストバタフライ」",
    "華霊「スワローテイルバタフライ」",
    "華霊「ディープルーティドバタフライ」",
    "華霊「バタフライディルージョン」",
    "幽曲「リポジトリ・オブ・ヒロカワ -偽霊-」",
    "幽曲「リポジトリ・オブ・ヒロカワ -亡霊-」",
    "幽曲「リポジトリ・オブ・ヒロカワ -幻霊-」",
    "幽曲「リポジトリ・オブ・ヒロカワ -神霊-」",
    "桜符「完全なる墨染の桜 -封印-」",
    "桜符「完全なる墨染の桜 -亡我-」",
    "桜符「完全なる墨染の桜 -春眠-」",
    "桜符「完全なる墨染の桜 -開花-」",
    "「反魂蝶 -一分咲-」",
    "「反魂蝶 -参分咲-」",
    "「反魂蝶 -伍分咲-」",
    "「反魂蝶 -八分咲-」"
}
scJp["西行寺幽幽子"]["萃梦想"] = {
    "死符「ギャストリドリーム」",
    "死蝶「華胥の永眠」",
    "冥符「黄泉平坂行路」",
    "再迷「幻想郷の黄泉還り」",
    "霊符「无寿の夢」",
    "寿命「无寿国への約束手形」",
    "符の壱「幽夢の胡蝶」",
    "符の弐「白玉楼の垂れ彼岸」",
    "符の参「果てしなく昔の死地」",
    "桜花「未練未酌宴」",
    "「紫(むらさき)の彼岸は遅れて輝く」"
}
scJp["西行寺幽幽子"]["永夜抄"] = {
    "死符「ギャストリドリーム」",
    "死蝶「華胥の永眠」",
    "「西行寺無余涅槃」"
}
scJp["西行寺幽幽子"]["文花帖"] = {
    "幽雅「死出の誘蛾灯」",
    "蝶符「鳳蝶紋の死槍」",
    "死符「酔人の生、死の夢幻」",
    "「死蝶浮月」"
}
scJp["西行寺幽幽子"]["绯想天"] = {
    "死符「ギャストリドリーム」",
    "冥符「黄泉平坂行路」",
    "霊符「无寿の夢」",
    "死蝶「華胥の永眠」",
    "再迷「幻想郷の黄泉還り」",
    "寿命「无寿国への約束手形」",
    "霊蝶「蝶の羽風生に暫く」",
    "蝶符「鳳蝶紋の死槍」",
    "幽雅「死出の誘蛾灯」",
    "幽符「冥界ミステリースポット」",
    "霊蝶「蝶の羽風生に暫く」",
    "宴会「死して全て大団円」"
}
scJp["西行寺幽幽子"]["非想天则"] = {
    "「反魂蝶」",
    "桜符「センスオブチェリーブロッサム」"
}
scJp["西行寺幽幽子"]["神灵庙"] = {
    "符牒「死蝶の舞」",
    "符牒「死蝶の舞　- 桜花 -」",
    "幽蝶「ゴーストスポット」",
    "幽蝶「ゴーストスポット　- 桜花 -」",
    "冥符「常夜桜」",
    "桜符「西行桜吹雪」",
    "桜符「桜吹雪地獄」"
}
scJp["西行寺幽幽子"]["弹幕天邪鬼"] = {
    "蝶符「花蝶風月」",
    "桜花「桜吹雪花小町」"
}
scJp["西行寺幽幽子"]["噩梦日记"] = {
    "妖花符「バタフライストーム閻魔笏」",
    "風妖符「死蝶オンバシラ」",
    "妖風符「土着蝶ストーム」"
}

scJp["八云蓝"] = {}
scJp["八云蓝"]["妖妖梦"] = {
    "式神「仙狐思念」",
    "式神「十二神将の宴」",
    "式輝「狐狸妖怪レーザー」",
    " 式輝「四面楚歌チャーミング」",
    "式輝「プリンセス天狐 -Illusion-」",
    "式弾「アルティメットブディスト」",
    "式弾「ユーニラタルコンタクト」",
    "式神「橙」",
    "「狐狗狸さんの契約」",
    "幻神「飯綱権現降臨」",
    "式神「前鬼後鬼の守護」",
    "式神「憑依荼吉尼天」"
}
scJp["八云蓝"]["文花帖"] = {
    "密符「御大師様の秘鍵」",
    "行符「八千万枚護摩」",
    "超人「飛翔役小角」"
}
scJp["八云蓝"]["噩梦日记"] = {
    "地妖符「イドの式神」",
    "地妖符「式神大星」",
    "地妖符「エゴの式神」"
}

scJp["八云紫"] = {}
scJp["八云紫"]["妖妖梦"] = {
    "結界「夢と現の呪」",
    "結界「動と静の均衡」",
    "結界「光と闇の網目」",
    "罔両「ストレートとカーブの夢郷」",
    "罔両「八雲紫の神隠し」",
    "罔両「禅寺に棲む妖蝶」",
    "魍魎「二重黒死蝶」",
    "式神「八雲藍」",
    "「人間と妖怪の境界」",
    "結界「生と死の境界」",
    "紫奥義「弾幕結界」"
}
scJp["八云紫"]["萃梦想"] = {
    "境符「四重結界」",
    "結界「魅力的な四重結界」",
    "式神「八雲藍」",
    "式神「八雲藍＋」",
    "境符「二次元と三次元の境界」",
    "結界「客観結界」",
    "符の壱「四重結界」",
    "符の弐「八雲卍傘」",
    "符の参「八雲藍」　",
    "外力「無限の超高速飛行体」",
    "幻想「第一種永久機関」"
}
scJp["八云紫"]["永夜抄"] = {
    "境符「四重結界」",
    "境界「永夜四重結界」",
    "「深弾幕結界　-夢幻泡影-」"
}
scJp["八云紫"]["文花帖"] = {
    "境符「色と空の境界」",
    "境符「波と粒の境界」"
}
scJp["八云紫"]["绯想天"] = {
    "境符「四重結界」",
    "式神「八雲藍」",
    "境符「二次元と三次元の境界」",
    "結界「魅力的な四重結界」",
    "式神「橙」",
    "結界「客観結界」",
    "幻巣「飛光虫ネスト」",
    "空餌「中毒性のあるエサ」",
    "廃線「ぶらり廃駅下車の旅」",
    "光弾「ドップラーエフェクト」",
    "捌器「全てを二つに捌く物」",
    "幻巣「飛光虫ネスト」",
    "空餌「狂躁高速飛行物体」",
    "「八雲の巣」"
}
scJp["八云紫"]["非想天则"] = {
    "魔眼「ラプラスの魔」"
}
scJp["八云紫"]["天邪鬼"] = {
    "「不可能弾幕結界」",
    "「運鈍根の捕物帖」"
}
scJp["八云紫"]["凭依华"] = {
    "「無人廃線車両爆弾」",
    "式神「八雲藍&橙」",
    "境界「溢れ出る漂流物」",
    "＊その綺麗な足をくれ！＊",
    "「<ruby>憑坐<rt>マスター</rt></ruby>の憂鬱」",
    "「完全憑依と夢想封印」",
    "「<ruby>憑坐<rt>マスター</rt></ruby>と<ruby>神霊<rt>スレイブ</rt></ruby>の境界」",
    "貧符「ミスチャンススキャッター」",
    "「最凶最悪の極貧不幸神」"
}
scJp["八云紫"]["噩梦日记"] = {
    "「秘神結界」",
    "「弾幕結界を撃ち抜け！」",
    "「許可無く弾幕は撮影禁止です」",
    "紙符「結界中のＥＳＰカード手裏剣」"
}

scJp["伊吹萃香"] = {}
scJp["伊吹萃香"]["萃梦想"] = {
    "萃符「戸隠山投げ」",
    "萃鬼「天手力男投げ」",
    "酔神「鬼縛りの術」",
    "酔夢「施餓鬼縛りの術」",
    "鬼符「ミッシングパワー」",
    "鬼神「ミッシングパープルパワー」",
    "符の壱「投擲の天岩戸」",
    "符の弐「坤軸の大鬼」",
    "符の参「追儺返しブラックホール」",
    "鬼火「超高密度燐禍術」",
    "疎符「六里霧中」",
    "「百万鬼夜行」"
}
scJp["伊吹萃香"]["文花帖"] = {
    "鬼気「濛々迷霧」",
    "「百万鬼夜行」"
}
scJp["伊吹萃香"]["绯想天"] = {
    "萃符「戸隠山投げ」",
    "酔神「鬼缚りの術」",
    "鬼符「ミッシングパワー」",
    "萃鬼「天手力男投げ」",
    "酔夢「施餓鬼縛りの術」",
    "鬼神「ミッシングパープルパワー」",
    "霧符「雲集霧散」",
    "鬼火「超高密度燐禍術」",
    "鬼符「大江山悉皆殺し」",
    "吐息「小鬼の深呼吸」",
    "火弾「地霊活性弾」",
    "鬼神「ミッシングパープルパワー」",
    "鬼気「濛々迷霧」",
    "「百万同一鬼」"
}
scJp["伊吹萃香"]["非想天则"] = {
    "四天王奥義「三歩壊廃」"
}
scJp["伊吹萃香"]["文花帖DS"] = {
    "鬼符「豆粒大の針地獄」",
    "地獄「煉獄吐息」",
    "鬼符「ミッシングパワー」"
}
scJp["伊吹萃香"]["天邪鬼"] = {
    "鬼群「インプスウォーム」",
    "鬼群「百鬼禿童」"
}
scJp["伊吹萃香"]["噩梦日记"] = {
    "萃夜符「身命霧散」",
    "萃珠符「純粋な五里霧中」",
    "萃珠符「ミストレイ」"
}

scJp["莉格露"] = {}
scJp["莉格露"]["永夜抄"] = {
    "蛍符「地上の流星」",
    "蛍符「地上の彗星」",
    "灯符「ファイヤフライフェノメノン」",
    "蠢符「リトルバグ」",
    "蠢符「リトルバグストーム」",
    "蠢符「ナイトバグストーム」",
    "蠢符「ナイトバグトルネード」",
    "隠蟲「永夜蟄居」",
    "「季節外れのバタフライストーム」"
}
scJp["莉格露"]["文花帖"] = {
    "蛍符「地上の恒星」",
    "蝶符「バタフライストーム」"
}

scJp["米斯蒂娅"] = {}
scJp["米斯蒂娅"]["永夜抄"] = {
    "声符「梟の夜鳴声」",
    "声符「木菟咆哮」",
    "蛾符「天蛾の蠱道」",
    "毒符「毒蛾の鱗粉」",
    "猛毒「毒蛾の暗闇演舞」",
    "鷹符「イルスタードダイブ」",
    "夜盲「夜雀の歌」",
    "夜雀「真夜中のコーラスマスター」",
    "「ブラインドナイトバード」"
}
scJp["米斯蒂娅"]["花映塚"] = {
    "鳥符「ヒューマンケージ」",
    "鳥符「ヒューマンケージダブル」",
    "鳥符「ミステリアスソング」"
}

scJp["上白泽慧音"] = {}
scJp["上白泽慧音"]["永夜抄"] = {
    "産霊「ファーストピラミッド」",
    "始符「エフェメラリティ137」",
    "野符「武烈クライシス」",
    "野符「将門クライシス」",
    "野符「義満クライシス」",
    "野符「GHQクライシス」",
    "国符「三種の神器　剣」",
    "国符「三種の神器　玉」",
    "国符「三種の神器　鏡」",
    "国体「三種の神器　郷」",
    "終符「幻想天皇」",
    "虚史「幻想郷伝説」",
    "未来「高天原」",
    "「日出づる国の天子」",
    "旧史「旧秘境史　-オールドヒストリー-」",
    "転世「一条戻り橋」",
    "新史「新幻想史　-ネクストヒストリー-」",
    "「無何有浄化」"
}
scJp["上白泽慧音"]["文花帖"] = {
    "光符「アマテラス」",
    "包符「昭和の雨」",
    "葵符「水戸の光圀」",
    "倭符「邪馬台の国」"
}
scJp["上白泽慧音"]["天邪鬼"] = {
    "「２０ＸＸ年　死後の旅」",
    "大火「江戸のフラワー」"
}

scJp["因幡帝"] = {}
scJp["因幡帝"]["永夜抄"] = {
    "「エンシェントデューパー」"
}
scJp["因幡帝"]["花映塚"] = {
    "兎符「開運大紋」",
    "兎符「因幡の素兎」"
}
scJp["因幡帝"]["文花帖"] = {
    "脱兎「フラスターエスケープ」",
    "借符「大穴牟遅様の薬」"
}

scJp["铃仙"] = {}
scJp["铃仙"]["永夜抄"] = {
    "波符「赤眼催眠(マインドシェイカー)」",
    "幻波「赤眼催眠(マインドブローイング)」",
    "狂符「幻視調律(ビジョナリチューニング)」",
    "狂視「狂視調律(イリュージョンシーカー)」",
    "懶符「生神停止(アイドリングウェーブ)」",
    "懶惰「生神停止(マインドストッパー)」",
    "散符「真実の月(インビジブルフルムーン)」",
    "月眼「月兎遠隔催眠術(テレメスメリズム)」",
    "「幻朧月睨(ルナティックレッドアイズ)」"
}
scJp["铃仙"]["花映塚"] = {
    "波符「月面波紋(ルナウェーブ)」",
    "散符「栄華之夢(ルナメガロポリス)」"
}
scJp["铃仙"]["文花帖"] = {
    "散符「朧月花栞(ロケット.イン.ミスト)」",
    "波符「幻の月(インビジブルハーフムーン)」",
    "狂夢「風狂の夢(ドリームワールド)」"
}
scJp["铃仙"]["绯想天"] = {
    "迫符「脅迫幻覚(オブセッショナー)」",
    "幻弾「幻想視差(ブラフバラージ)」",
    "幻兎「平行交差(パラレルクロス)」",
    "惑視「離円花冠(カローラヴィジョン)」",
    "幻爆「近眼花火(マインドスターマイン)」",
    "幻惑「花冠視線(クラウンヴィジョン)」",
    "「幻朧月睨(ルナティックレッドアイズ)」",
    "弱心「喪心喪意(ディモチヴィエイション)」",
    "喪心「喪心創痍(ディスカーダー)」",
    "毒煙幕「瓦斯織物の玉」",
    "生薬「国士無双の薬」"
}
scJp["铃仙"]["非想天则"] = {
    "長視「赤月下(インフレアドムーン)」",
    "短視「超短脳波(エックスウェイブ)」",
    "赤眼「望見円月(ルナティックブラスト)」"
}
scJp["铃仙"]["深秘录"] = {
    "「月面跳弾(ルナティックダブル)」",
    "「幻朧月睨(ルナティックレッドアイズ)」",
    "「地上跳弾(ルナティックエコー)」",
    "＊もうお前は狂っている！＊"
}
scJp["铃仙"]["绀珠传"] = {
    "「障壁波動（イビルアンジュレーション）」"
}
scJp["铃仙"]["凭依华"] = {
    "「月面跳弾(ルナティックダブル)」",
    "「幻朧月睨(ルナティックレッドアイズ)」",
    "「地上跳弾(ルナティックエコー)」",
    "＊もうお前は狂っている！＊",
    "狂槌符「狂視幻像（ディスオーダーアイ）も大きくなあれ」",
    "火狂符「人体発火秘匿弾幕（バーニングヒドゥンバレット）」"
}

scJp["八意永琳"] = {}
scJp["八意永琳"]["永夜抄"] = {
    "天丸「壺中の天地」",
    "覚神「神代の記憶」",
    "神符「天人の系譜」",
    "蘇活「生命遊戯　-ライフゲーム-」",
    "蘇生「ライジングゲーム」",
    "操神「オモイカネディバイス」",
    "神脳「オモイカネブレイン」",
    "天呪「アポロ１３」",
    "秘術「天文密葬法」",
    "禁薬「蓬莱の薬」",
    "薬符「壺中の大銀河」",
    "「天網蜘網捕蝶の法」"
}
scJp["八意永琳"]["文花帖"] = {
    "薬符「胡蝶夢丸ナイトメア」",
    "練丹「水銀の海」",
    "秘薬「仙香玉兎」"
}
scJp["八意永琳"]["噩梦日记"] = {
    "永夜符「蓬莱壺中の弾の枝」",
    "永緋符「墜落する壺中の有頂天」",
    "妖風符「土着蝶ストーム」"
}

scJp["蓬莱山辉夜"] = {}
scJp["蓬莱山辉夜"]["永夜抄"] = {
    "難題「龍の頸の玉　-五色の弾丸-」",
    "神宝「ブリリアントドラゴンバレッタ」",
    "難題「仏の御石の鉢　-砕けぬ意思-」",
    "神宝「ブディストダイアモンド」",
    "難題「火鼠の皮衣　-焦れぬ心-」",
    "神宝「サラマンダーシールド」",
    "難題「燕の子安貝　-永命線-」",
    "神宝「ライフスプリングインフィニティ」",
    "難題「蓬莱の弾の枝　-虹色の弾幕-」",
    "神宝「蓬莱の玉の枝　-夢色の郷-」",
    "「永夜返し　-初月-」",
    "「永夜返し　-三日月-」",
    "「永夜返し　-上つ弓張-」",
    "「永夜返し　-待宵-」",
    "「永夜返し　-子の刻-」",
    "「永夜返し　-子の二つ-」",
    "「永夜返し　-子の三つ-」",
    "「永夜返し　-子の四つ-」",
    "「永夜返し　-丑の刻-」",
    "「永夜返し　-丑の二つ-」",
    "「永夜返し　-丑三つ時-」",
    "「永夜返し　-丑の四つ-」",
    "「永夜返し　-寅の刻-」",
    "「永夜返し　-寅の二つ-」",
    "「永夜返し　-寅の三つ-」",
    "「永夜返し　-寅の四つ-」",
    "「永夜返し　-朝靄-」",
    "「永夜返し　-夜明け-」",
    "「永夜返し　-明けの明星-」",
    "「永夜返し　-世明け-」",
    "「蓬莱の樹海」"
}
scJp["蓬莱山辉夜"]["文花帖"] = {
    "新難題「月のイルメナイト」",
    "新難題「エイジャの赤石」",
    "新難題「金閣寺の一枚天井」",
    "新難題「ミステリウム」"
}
scJp["蓬莱山辉夜"]["噩梦日记"] = {
    "永夜符「蓬莱壺中の弾の枝」",
    "輝夜符「蓬莱の大きな弾の枝」",
    "緋夜符「蓬莱の弾の要石」"
}

scJp["藤原妹红"] = {}
scJp["藤原妹红"]["永夜抄"] = {
    "时効「月のいはかさの呪い」",
    "不死「火の鳥　-鳳翼天翔-」",
    "藤原「滅罪寺院傷」",
    "不死「徐福时空」",
    "滅罪「正直者の死」",
    "虚人「ウー」",
    "不滅「フェニックスの尾」",
    "蓬莱「凱風快晴　-フジヤマヴォルケイノ-」",
    "「パゼストバイフェニックス」",
    "「蓬莱人形」",
    "「インペリシャブルシューティング」",
    "「フェニックス再誕」"
}
scJp["藤原妹红"]["文花帖"] = {
    "貴人「サンジェルマンの忠告」",
    "蓬莱「瑞江浦嶋子と五色の瑞亀」"
}
scJp["藤原妹红"]["天邪鬼"] = {
    "惜命「不死身の捨て身」",
    "「火の鳥　‐不死伝説‐」"
}
scJp["藤原妹红"]["深秘录"] = {
    "焔符「自滅火焔大旋風」",
    "不死「凱風快晴飛翔蹴」",
    "呪札「無差別発火の符」",
    "＊こんな世は燃え尽きてしまえ！＊",
    "炎符「フェニックスの超高温な羽」",
    "＊凱風晴天快晴脚＊",
    "炎符「フェニックスの羽」",
    "爪符「デスパレートクロー」",
    "惜命「不死身の捨て身」",
    "「この何度目かの命、燃え尽きるまで」"
}
scJp["藤原妹红"]["凭依华"] = {
    "焔符「自滅火焔大旋風」",
    "不死「凱風快晴飛翔蹴」",
    "呪札「無差別発火の符」",
    "＊こんな世は燃え尽きてしまえ！＊",
    "化火符「妖怪弾幕変化　葉っぱ発破」",
    "火狂符「人体発火秘匿弾幕（バーニングヒドゥンバレット）」",
    "「この何度目かの命、夢想封印されるまで」"
}
scJp["藤原妹红"]["噩梦日记"] = {
    "萃夜符「身命霧散」",
    "永珠符「捨て身のリフレクション」",
    "永珠符「穢れ無き珠と穢れ多き霊」"
}

scJp["射命丸文"] = {}
scJp["射命丸文"]["花映塚"] = {
    "風符「風神一扇」",
    "疾風「風神少女」"
}
scJp["射命丸文"]["风神录"] = {
    "岐符「天の八衢」",
    "岐符「サルタクロス」",
    "風神「風神木の葉隠れ」",
    "風神「天狗颪」",
    "風神「二百十日」",
    "「幻想風靡」",
    "「無双風神」",
    "塞符「山神渡御」",
    "塞符「天孫降臨」",
    "塞符「天上天下の照國」"
}
scJp["射命丸文"]["绯想天"] = {
    "旋符「紅葉扇風」",
    "竜巻「天孫降臨の道しるべ」",
    "逆風「人間禁制の道」",
    "突符「天狗のマクロバースト」",
    "風符「天狗道の開風」",
    "「幻想風靡」",
    "魔獣「鎌鼬ベーリング」",
    "突風「猿田彦の先導」",
    "突風「猿田彦の先導」",
    "旋符「飄妖扇」",
    "旋風「鳥居つむじ風」",
    "「幻想風靡」"
}
scJp["射命丸文"]["非想天则"] = {
    "風符「天狗報即日限」",
    "鴉符「暗夜のデイメア」"
}
scJp["射命丸文"]["文花帖DS"] = {
    "取材「射命丸文の圧迫取材」",
    "望遠「キャンディッドショット」",
    "速写「ファストショット」",
    "「幻想風靡」"
}
scJp["射命丸文"]["天邪鬼"] = {
    "写真「激撮テングスクープ」",
    "「瞬撮ジャーナリスト」"
}
scJp["射命丸文"]["天空璋"] = {
    "風符「天狗突風雨」"
}

scJp["梅蒂欣"] = {}
scJp["梅蒂欣"]["花映塚"] = {
    "毒符「神経の毒」",
    "毒符「憂鬱の毒」"
}
scJp["梅蒂欣"]["文花帖"] = {
    "霧符「ガシングガーデン」",
    "毒符「ポイズンブレス」",
    "譫妄「イントゥデリリウム」"
}

scJp["风见幽香"] = {}
scJp["风见幽香"]["花映塚"] = {
    "花符「幻想郷の開花」",
    "幻想「花鳥風月、嘯風弄月」"
}

scJp["小野塚小町"] = {}
scJp["小野塚小町"]["花映塚"] = {
    "投銭「宵越しの銭」",
    "死神「ヒガンルトゥール」"
}
scJp["小野塚小町"]["文花帖"] = {
    "死歌「八重霧の渡し」",
    "古雨「黄泉中有の旅の雨」",
    "死価「プライス.オブ.ライフ」"
}
scJp["小野塚小町"]["绯想天"] = {
    "舟符「河の流れのように」",
    "薄命「余命幾許も無し」",
    "霊符「何処にでもいる浮遊霊」",
    "死歌「八重霧の渡し」",
    "換命「不惜身命、可惜身命」",
    "恨符「未練がましい緊縛霊」",
    "死符「死者選別の鎌」",
    "地獄「無間の狭間」",
    "霊符「古き地縛霊の目覚め」",
    "死符「死者選別の鎌」",
    "魂符「魂の遊戯」"
}
scJp["小野塚小町"]["非想天则"] = {
    "魂符「生魂流離の鎌」"
}

scJp["四季映姬"] = {}
scJp["四季映姬"]["花映塚"] = {
    "罪符「彷徨える大罪」",
    "審判「ラストジャッジメント」"
}
scJp["四季映姬"]["文花帖"] = {
    "嘘言「タン・オブ・ウルフ」",
    "審判「十王裁判」",
    "審判「ギルティ.オア.ノットギルティ」",
    "審判「浄頗梨審判 -射命丸文-」"
}
scJp["四季映姬"]["噩梦日记"] = {
    "妖花符「バタフライストーム閻魔笏」",
    "風花符「ミシャグジ様の是非」",
    "風花符「オンバシラ裁判」"
}

scJp["秋静叶"] = {}
scJp["秋静叶"]["风神录"] = {
    "葉符「狂いの落葉」"
}
scJp["秋静叶"]["文花帖DS"] = {
    "秋符「フォーリンブラスト」",
    "枯道「ロストウインドロウ」"
}

scJp["秋穰子"] = {}
scJp["秋穰子"]["风神录"] = {
    "秋符「オータムスカイ」",
    "秋符「秋の空と乙女の心」",
    "豊符「オヲトシハーベスター」",
    "豊作「穀物神の約束」"
}
scJp["秋穰子"]["文花帖DS"] = {
    "実符「ウォームカラーハーヴェスト」",
    "焼芋「スイートポテトルーム」"
}

scJp["键山雏"] = {}
scJp["键山雏"]["风神录"] = {
    "厄符「バッドフォーチュン」",
    "厄符「厄神様のバイオリズム」",
    "疵符「ブロークンアミュレット」",
    "疵痕「壊されたお守り」",
    "悪霊「ミスフォーチュンズホイール」",
    "悲運「大鐘婆の火」",
    "創符「ペインフロー」",
    "創符「流刑人形」"
}
scJp["键山雏"]["文花帖DS"] = {
    "厄野「禊川の堆积」",
    "灾祸「呪いの雏人形」"
}

scJp["河城荷取"] = {}
scJp["河城荷取"]["风神录"] = {
    "光学「オプティカルカモフラージュ」",
    "光学「ハイドロカモフラージュ」",
    "洪水「ウーズフラッディング」",
    "洪水「デリューヴィアルメア」",
    "漂溺「光り輝く水底のトラウマ」",
    "水符「河童のポロロッカ」",
    "水符「河童のフラッシュフラッド」",
    "水符「河童の幻想大瀑布」",
    "河童「お化けキューカンバー」",
    "河童「のびーるアーム」",
    "河童「スピン·ザ·セファリックプレート」"
}
scJp["河城荷取"]["文花帖DS"] = {
    "水符「ウォーターカーペット」",
    "河符「ディバイディングエッジ」",
    "河童「乾燥尻子玉」"
}
scJp["河城荷取"]["心绮楼"] = {
    "豪雨「河底大戦争」",
    "泡符「撃て！バブルドラゴン」",
    "戦機「飛べ！三平ファイト」",
    "「スーパースコープ3D」",
    "水符「夏のペットボトルロケット」",
    "妖怪戦艦「三平ファイター」"
}
scJp["河城荷取"]["天邪鬼"] = {
    "瀑符「シライトフォール」",
    "瀑符「ケゴンガン」"
}
scJp["河城荷取"]["深秘录"] = {
    "豪雨「河底大戦争」",
    "泡符「撃て！バブルドラゴン」",
    "戦機「飛べ！三平ファイト」",
    "＊ネス湖は今ここにある！＊",
    "＊ネッシーの完全養殖技術＊"
}
scJp["河城荷取"]["凭依华"] = {
    "豪雨「河底大戦争」",
    "泡符「撃て！バブルドラゴン」",
    "戦機「飛べ！三平ファイト」",
    "＊ネス湖は今ここにある！＊",
    "水面符「ミズバクマスカレード」",
    "拳水符「入道叢雲ミズバク拳」"
}

scJp["犬走椛"] = {}
scJp["犬走椛"]["文花帖DS"] = {
    "狗符「レイビーズバイト」",
    "山窝「エクスペリーズカナン」"
}
scJp["犬走椛"]["天邪鬼"] = {
    "牙符「咀嚼玩味」"
}

scJp["东风谷早苗"] = {}
scJp["东风谷早苗"]["风神录"] = {
    "秘術「グレイソーマタージ」",
    "秘術「忘却の祭儀」",
    "秘術「一子相伝の弾幕」",
    "奇跡「白昼の客星」",
    "奇跡「客星の明るい夜」",
    "奇跡「客星の明るすぎる夜」",
    "開海「海が割れる日」",
    "開海「モーゼの奇跡」",
    "準備「神風を喚ぶ星の儀式」",
    "準備「サモンタケミナカタ」",
    "奇跡「神の風」",
    "大奇跡「八坂の神風」"
}
scJp["东风谷早苗"]["地灵殿"] = {
    "秘法「九字刺し」",
    "奇跡「ミラクルフルーツ」",
    "神徳「五穀豊穣ライスシャワー」"
}
scJp["东风谷早苗"]["星莲船"] = {
    "蛇符「神代大蛇」",
    "蛙符「手管の蝦蟇」"
}
scJp["东风谷早苗"]["非想天则"] = {
    "祈願「商売繁盛守り」",
    "秘術「グレイソーマタージ」",
    "御籤「乱れおみくじ連続引き」",
    "開海「海が割れる日」",
    "奇跡「白昼の客星」",
    "秘術「忘却の祭儀」",
    "奇跡「客星の明るすぎる夜」",
    "開海「モーゼの奇跡」",
    "秘法「九字刺し」",
    "蛇符「雲を泳ぐ大蛇」",
    "奇跡「ファフロッキーズの奇跡」"
}
scJp["东风谷早苗"]["文花帖DS"] = {
    "奇迹「弘安の神风」",
    "蛙符「手管の虾蟇」",
    "妖怪退治「妖力スポイラー」"
}
scJp["东风谷早苗"]["神灵庙"] = {
    "秘術「グレイソーマタージ」"
}
scJp["东风谷早苗"]["天邪鬼"] = {
    "蛇符「バインドスネークカモン」",
    "蛇符「グリーンスネークカモン」"
}
scJp["东风谷早苗"]["绀珠传"] = {
    "蛙符「手管の蝦蟇」"
}

scJp["八坂神奈子"] = {}
scJp["八坂神奈子"]["风神录"] = {
    "神祭「エクスパンデッド·オンバシラ」",
    "奇祭「目処梃子乱舞」",
    "筒粥「神の粥」",
    "忘穀「アンリメンバードクロップ」",
    "神穀「ディバイニングクロップ」",
    "贄符「御射山御狩神事」",
    "神秘「葛井の清水」",
    "神秘「ヤマトトーラス」",
    "天流「お天水の奇跡」",
    "天竜「雨の源泉」",
    "「マウンテン·オブ·フェイス」",
    "「風神様の神徳」",
    "神符「水眼の如き美しき源泉」",
    "神符「杉で結ぶ古き縁」",
    "神符「神が歩かれた御神渡り」"
}
scJp["八坂神奈子"]["文花帖DS"] = {
    "蛇符「グラウンドサーペント」",
    "御柱「メテオリックオンバシラ」",
    "儚道「御神渡りクロス」"
}
scJp["八坂神奈子"]["天邪鬼"] = {
    "御柱「ライジングオンバシラ」",
    "「神の御威光」"
}
scJp["八坂神奈子"]["噩梦日记"] = {
    "風神符「ミシャバシラ」",
    "風妖符「死蝶オンバシラ」",
    "風花符「オンバシラ裁判」"
}

scJp["洩矢诹访子"] = {}
scJp["洩矢诹访子"]["风神录"] = {
    "開宴「二拝二拍一拝」",
    "土着神「手長足長さま」",
    "神具「洩矢の鉄の輪」",
    "源符「厭い川の翡翠」",
    "蛙狩「蛙は口ゆえ蛇に呑まるる」",
    "土着神「七つの石と七つの木」",
    "土着神「ケロちゃん風雨に負けず」",
    "土着神「宝永四年の赤蛙」",
    "「諏訪大戦 ～ 土着神話 vs 中央神話」",
    "祟符「ミシャグジさま」"
}
scJp["洩矢诹访子"]["非想天则"] = {
    "源符「諏訪清水」",
    "神具「洩矢の鉄の轮」",
    "土着神「洩矢神」",
    "开宴「二拝二拍一拝」",
    "土着神「ケロちゃん风雨に负けず」",
    "源符「厌い川の翡翠」",
    "蛙狩「蛙は口ゆえ蛇に呑まるる」",
    "土着神「手长足长さま」",
    "土着神「宝永四年の赤蛙」",
    "蛙休「オールウェイズ冬眠できます」",
    "祟り神「赤口(ミシャグチ)さま」",
    "合掌「だいだらぼっちの参拝」",
    "神具「洩矢の鉄の轮」",
    "「狱热の间欠泉」",
    "「マグマの両生类」",
    "「幻想郷空中神戦」"
}
scJp["洩矢诹访子"]["文花帖DS"] = {
    "神桜「湛えの桜吹雪」",
    "姫川「プリンセスジェイドグリーン」",
    "鉄轮「ミシカルリング」",
    "土着神「御射军神さま」"
}
scJp["洩矢诹访子"]["天邪鬼"] = {
    "緑石「ジェイドブレイク」",
    "蛙符「血塗られた赤蛙塚」"
}
scJp["洩矢诹访子"]["噩梦日记"] = {
    "風神符「ミシャバシラ」",
    "風花符「ミシャグジ様の是非」",
    "妖風符「土着蝶ストーム」"
}

scJp["永江衣玖"] = {}
scJp["永江衣玖"]["绯想天"] = {
    "電符「雷鼓弾」",
    "魚符「龍魚ドリル」",
    "雷符「エレキテルの龍宮」",
    "光星「光龍の吐息」",
    "雷魚「雷雲魚遊泳弾」",
    "羽衣「羽衣は空の如く」",
    "棘符「雷雲棘魚」",
    "龍魚「龍宮の使い遊泳弾」",
    "光珠「龍の光る眼」",
    "雷符「神鳴り様の住処」",
    "棘符「雷雲棘魚」",
    "雲界「玄雲海の雷庭」"
}
scJp["永江衣玖"]["非想天则"] = {
    "羽衣「羽衣は時の如く」",
    "珠符「五爪龍の珠」"
}
scJp["永江衣玖"]["文花帖DS"] = {
    "雷符「ライトニングフィッシュ」",
    "珠符「五爪龍の珠」",
    "龍宮「タイヤヒラメダンス」",
    "龍魚「龍宮の使い遊泳弾」"
}
scJp["永江衣玖"]["噩梦日记"] = {
    "輝天符「迅雷のドンドコ太鼓」",
    "緋星符「正体不明の落雷」",
    "神緋符「雷雨の中のストーカー」"
}

scJp["比那名居天子"] = {}
scJp["比那名居天子"]["绯想天"] = {
    "地符「不譲土壌の剣」",
    "非想「非想非非想の剣」",
    "天符「天道是非の剣」",
    "地震「先憂後楽の剣」",
    "気符「天啓気象の剣」",
    "要石「天地開闢プレス」",
    "気符「無念無想の境地」",
    "「全人类の绯想天」",
    "要石「天空の霊石」",
    "乾坤「荒々しくも母なる大地よ」",
    "霊想「大地を镇める石」",
    "天地「世界を見下ろす遥かなる大地よ」",
    "「全人類の緋想天」"
}
scJp["比那名居天子"]["非想天则"] = {
    "剣技「気炎万丈の剣」",
    "天気「緋想天促」"
}
scJp["比那名居天子"]["文花帖DS"] = {
    "気性「勇気凛々の剣」",
    "地震「避難険路」",
    "要石「カナメファンネル」",
    "「全人類の緋想天」"
}
scJp["比那名居天子"]["天邪鬼"] = {
    "「全妖怪の緋想天」",
    "「鹿島鎮護」"
}
scJp["比那名居天子"]["凭依华"] = {
    "要石「カナメファンネル」",
    "地符「一撃震乾坤」",
    "桃符「堅牢堅固の仙桃」",
    "＊大気圏は我が手中にあり＊",
    "昇槌符「僕らの夢を載せて大きくなあれ」",
    "墜槌符「夢は大気圏に墜ちて大きくなあれ」",
    "「全小人族の緋想天」",
    "夢要符「羊毛色の乾坤一擲」",
    "昇符「遥か宙まで飛べ！　僕らの夢を載せて」",
    "墜符「大気圏に落ちて、夢は地表に降り注ぐ」",
    "「大地を造り直そう、夢のある世界へ！」",
    "「ヒュージバトルシップ　無双ナマズ見参」",
    "「全スペースピープルの緋想天」"
}
scJp["比那名居天子"]["噩梦日记"] = {
    "緋針符「要石も大きくなあれ」",
    "永緋符「墜落する壺中の有頂天」",
    "緋夜符「蓬莱の弾の要石」"
}

scJp["琪斯美"] = {}
scJp["琪斯美"]["地灵殿"] = {
    "怪奇「釣瓶落としの怪」"
}
scJp["琪斯美"]["文花帖DS"] = {
    "釣瓶「飛んで井の中」",
    "釣瓶「ウェルディストラクター」"
}

scJp["黑谷山女"] = {}
scJp["黑谷山女"]["地灵殿"] = {
    "罠符「キャプチャーウェブ」",
    "蜘蛛「石窟の蜘蛛の巣」",
    "瘴符「フィルドミアズマ」",
    "瘴気「原因不明の熱病」"
}
scJp["黑谷山女"]["文花帖DS"] = {
    "細網「カンダタロープ」",
    "毒符「樺黄小町」"
}

scJp["水桥"] = {}
scJp["水桥"]["地灵殿"] = {
    "妬符「グリーンアイドモンスター」",
    "嫉妬「緑色の目をした見えない怪物」",
    "花咲爺「華やかなる仁者への嫉妬」",
    "花咲爺「シロの灰」",
    "舌切雀「謙虚なる富者への片恨」",
    "舌切雀「大きな葛籠と小さな葛籠」",
    "恨符「丑の刻参り」",
    "恨符「丑の刻参り七日目」"
}
scJp["水桥"]["文花帖DS"] = {
    "嫉妬「ジェラシーボンバー」",
    "怨み念法「積怨返し」"
}

scJp["星熊勇仪"] = {}
scJp["星熊勇仪"]["地灵殿"] = {
    "鬼符「怪力乱神」",
    "怪輪「地獄の苦輪」",
    "枷符「咎人の外さぬ枷」",
    "力業「大江山嵐」",
    "力業「大江山颪」",
    "四天王奥義「三歩必殺」"
}
scJp["星熊勇仪"]["文花帖DS"] = {
    "光鬼「金剛螺旋」",
    "鬼符「鬼気狂瀾」",
    "鬼声「壊滅の咆哮」"
}

scJp["古明地觉"] = {}
scJp["古明地觉"]["地灵殿"] = {
    "想起「テリブルスーヴニール」",
    "想起「恐怖催眠術」",
    "想起「二重黒死蝶」",
    "想起「飛行虫ネスト」　",
    "想起「波と粒の境界」",
    "想起「戸隠山投げ」",
    "想起「百万鬼夜行」",
    "想起「濛々迷霧」",
    "想起「風神木の葉隠れ」　",
    "想起「天狗のマクロバースト」",
    "想起「鳥居つむじ風」",
    "想起「春の京人形」",
    "想起「ストロードールカミカゼ」",
    "想起「リターンイナニメトネス」",
    "想起「マーキュリポイズン」",
    "想起「プリンセスウンディネ」",
    "想起「賢者の石」",
    "想起「のびーるアーム」",
    "想起「河童のポロロッカ」",
    "想起「光り輝く水底のトラウマ」"
}
scJp["古明地觉"]["文花帖DS"] = {
    "脳符「ブレインフィンガープリント」",
    "心花「カメラシャイローズ」",
    "想起「うろおぼえの金阁寺」"
}
scJp["古明地觉"]["噩梦日记"] = {
    "地霊符「マインドステラスチール」",
    "「パーフェクトマインドコントロール」",
    "地妖符「エゴの式神」"
}

scJp["火焰猫燐"] = {}
scJp["火焰猫燐"]["地灵殿"] = {
    "猫符「キャッツウォーク」",
    "猫符「怨霊猫乱歩」",
    "呪精「ゾンビフェアリー」",
    "呪精「怨霊憑依妖精」",
    "恨霊「スプリーンイーター」",
    "屍霊「食人怨霊」",
    "贖罪「旧地獄の針山」",
    "贖罪「昔時の針と痛がる怨霊」",
    "「死灰復燃」",
    "「小悪霊復活せし」",
    "妖怪「火焔の車輪」"
}
scJp["火焰猫燐"]["文花帖DS"] = {
    "死符「ゴーストタウン」",
    "「死体繁华街」",
    "酔歩「キャットランダムウォーク」"
}

scJp["灵乌路空"] = {}
scJp["灵乌路空"]["地灵殿"] = {
    "核熱「ニュークリアフュージョン」",
    "核熱「ニュークリアエクスカーション」",
    "核熱「核反応制御不能」",
    "爆符「プチフレア」",
    "爆符「メガフレア」",
    "爆符「ギガフレア」",
    "爆符「ぺタフレア」",
    "焔星「フィクストスター」",
    "焔星「プラネタリーレボリューション」",
    "焔星「十凶星」",
    "「地獄極楽メルトダウン」",
    "「ヘルズトカマク」",
    "「地獄の人工太陽」",
    "「サブタレイニアンサン」"
}
scJp["灵乌路空"]["非想天则"] = {
    "「地獄の人工太陽」",
    "制御「セルフトカマク」",
    "遮光「核熱バイザー」",
    "爆符「メガフレア」",
    "焔星「フィクストスター」",
    "核符「クリーピングサン」",
    "光熱「ハイテンションブレード」",
    "焔星「十凶星」",
    "地熱「核ブレイズゲイザー」",
    "鴉符「八咫烏ダイブ」",
    "核熱「核反応制御不能ダイブ」",
    "「サブタレイニアンサン」",
    "爆符「ギガフレア」",
    "「アビスノヴァ」",
    "熱符「ブレイクプロミネンス」",
    "核熱「核反応制御不能ダイブ」",
    "「ホットジュピター落下モデル」",
    "核熱「人工太陽の黒点」"
}
scJp["灵乌路空"]["文花帖DS"] = {
    "熔解「メルティングホワイト」",
    "巨星「レッドジャイアント」",
    "星符「巨星墜つ」",
    "七星「セプテントリオン」"
}
scJp["灵乌路空"]["噩梦日记"] = {
    "地霊符「マインドステラスチール」",
    "地妖符「式神大星」",
    "地霊符「マインドステラリリーフ」"
}

scJp["古明地恋"] = {}
scJp["古明地恋"]["地灵殿"] = {
    "表象「夢枕にご先祖総立ち」",
    "表象「弾幕パラノイア」",
    "本能「イドの解放」",
    "抑制「スーパーエゴ」",
    "反応「妖怪ポリグラフ」",
    "無意識「弾幕のロールシャッハ」",
    "復燃「恋の埋火」",
    "深層「無意識の遺伝子」",
    "「嫌われ者のフィロソフィ」",
    "「サブタレイニアンローズ」"
}
scJp["古明地恋"]["文花帖DS"] = {
    "心符「没我の愛」",
    "記憶「ＤＮＡの瑕」",
    "「胎児の梦」",
    "「ローズ地狱」"
}
scJp["古明地恋"]["心绮楼"] = {
    "抑制「スーパーエゴ」",
    "本能「イドの解放」",
    "夢符「ご先祖様が見ているぞ」",
    "「ブランブリーローズガーデン」",
    "本能「フロウディアン」",
    "茨符「コンファインドイノセント」"
}
scJp["古明地恋"]["深秘录"] = {
    "抑制「スーパーエゴ」",
    "本能「イドの解放」",
    "夢符「ご先祖様が見ているぞ」",
    "＊今から電話をするから出てね＊",
    "＊呪われたワン切り電話＊"
}
scJp["古明地恋"]["凭依华"] = {
    "抑制「スーパーエゴ」",
    "本能「イドの解放」",
    "夢符「ご先祖様が見ているぞ」",
    "＊今から電話をするから出てね＊",
    "星恋符「スプリンクルスター＆ハート」",
    "恋拳符「ローズカプリチオ怪雲拳」",
    "槌恋符「大判小判ザックザクハート」"
}
scJp["古明地恋"]["噩梦日记"] = {
    "地妖符「イドの式神」",
    "「パーフェクトマインドコントロール」",
    "地霊符「マインドステラリリーフ」"
}

scJp["娜兹玲"] = {}
scJp["娜兹玲"]["星莲船"] = {
    "棒符「ビジーロッド」",
    "捜符「レアメタルディテクター」",
    "捜符「ゴールドディテクター」",
    "視符「ナズーリンペンデュラム」",
    "視符「高感度ナズーリンペンデュラム」",
    "守符「ペンデュラムガード」",
    "宝塔「グレイテストトレジャー」"
}
scJp["娜兹玲"]["文花帖DS"] = {
    "棒符「ナズーリンロッド」",
    "財宝「ゴールドラッシュ」"
}

scJp["多多良小伞"] = {}
scJp["多多良小伞"]["星莲船"] = {
    "大輪「からかさ後光」",
    "大輪「ハロウフォゴットンワールド」",
    "傘符「パラソルスターシンフォニー」",
    "傘符「パラソルスターメモリーズ」",
    "雨符「雨夜の怪談」",
    "雨傘「超撥水かさかさお化け」",
    "化符「忘れ傘の夜行列車」",
    "化鉄「置き傘特急ナイトカーニバル」",
    "伞符「大粒の涙雨」",
    "驚雨「ゲリラ台風」",
    "後光「からかさ驚きフラッシュ」"
}
scJp["多多良小伞"]["文花帖DS"] = {
    "傘符「一本足ピッチャー返し」",
    "虹符「オーバー・ザ・レインボー」",
    "傘符「細雪の過客」"
}
scJp["多多良小伞"]["神灵庙"] = {
    "虹符「アンブレラサイクロン」"
}

scJp["云居一轮"] = {}
scJp["云居一轮"]["星莲船"] = {
    "鉄拳「問答無用の妖怪拳」",
    "神拳「雲上地獄突き」",
    "神拳「天海地獄突き」",
    "拳符「天網サンドバッグ」",
    "連打「雲界クラーケン殴り」",
    "連打「キングクラーケン殴り」",
    "拳打「げんこつスマッシュ」",
    "潰滅「天上天下連続フック」",
    "大喝「時代親父大目玉」",
    "忿怒「天変大目玉焼き」",
    "忿怒「空前絶後大目玉焼き」"
}
scJp["云居一轮"]["文花帖DS"] = {
    "拳骨「天空鉄槌落とし」",
    "稲妻「帯電入道」",
    "鉄拳「入道にょき」"
}
scJp["云居一轮"]["心绮楼"] = {
    "嵐符「仏罰の野分雲」",
    "積乱「見越し入道雲」",
    "拳固「懺悔の殺風」",
    "「華麗なる親父時代」",
    "拳符「怒りの大雲塊」",
    "入道「夏の幻想太郎」"
}
scJp["云居一轮"]["深秘录"] = {
    "嵐符「仏罰の野分雲」",
    "積乱「見越し入道雲」",
    "拳固「懺悔の殺風」",
    "＊２６５センチの魔人現る！＊",
    "悪符「八丈のオカルト柱」",
    "＊謎の女に囚われた真夏の夜＊"
}
scJp["云居一轮"]["凭依华"] = {
    "嵐符「仏罰の野分雲」",
    "積乱「見越し入道雲」",
    "拳固「懺悔の殺風」",
    "＊２６５センチの魔人現る！＊",
    "拳風符「入道叢雲風水拳」",
    "拳星符「入道叢雲スレイブスパーク」",
    "撃拳符「スカンダの怪雲拳」",
    "恋拳符「ローズカプリチオ怪雲拳」",
    "光拳符「インドラのヴァジュラ怪雲拳」",
    "拳水符「入道叢雲ミズバク拳」"
}

scJp["村纱水蜜"] = {}
scJp["村纱水蜜"]["星莲船"] = {
    "転覆「道連れアンカー」",
    "転覆「沈没アンカー」",
    "転覆「撃沈アンカー」",
    "溺符「ディープヴォーテックス」",
    "溺符「シンカブルヴォーテックス」",
    "湊符「ファントムシップハーバー」",
    "湊符「幽霊船の港」",
    "湊符「幽霊船永久停泊」",
    "幽霊「シンカーゴースト」",
    "幽霊「忍び寄る柄杓」"
}
scJp["村纱水蜜"]["文花帖DS"] = {
    "錨符「幽霊船長期停泊」",
    "浸水「船底のヴィーナス」",
    "「ディープシンカー」"
}

scJp["寅丸星"] = {}
scJp["寅丸星"]["星莲船"] = {
    "宝塔「レイディアントトレジャー」",
    "宝塔「レイディアントトレジャーガン」",
    "光符「アブソリュートジャスティス」",
    "光符「正義の威光」",
    "法力「至宝の独鈷杵」",
    "法灯「隙間無い法の独鈷杵」",
    "光符「浄化の魔」",
    "「コンプリートクラリフィケイション」"
}
scJp["寅丸星"]["文花帖DS"] = {
    "寅符「ハングリータイガー」",
    "天符「焦土曼荼羅」",
    "宝符「黄金の震眩」"
}

scJp["圣白莲"] = {}
scJp["圣白莲"]["星莲船"] = {
    "魔法「紫雲のオーメン」",
    "吉兆「紫の雲路」",
    "吉兆「極楽の紫の雲路」",
    "魔法「魔界蝶の妖香」",
    "魔法「マジックバタフライ」",
    "光魔「スターメイルシュトロム」",
    "光魔「魔法銀河系」",
    "大魔法「魔神復誦」",
    "「聖尼公のエア巻物」",
    "超人「聖白蓮」",
    "飛鉢「フライングファンタスティカ」",
    "飛鉢「伝説の飛空円盤」"
}
scJp["圣白莲"]["文花帖DS"] = {
    "「遊行聖」",
    "習合「垂迹大日如来」",
    "「スターソードの護法」"
}
scJp["圣白莲"]["心绮楼"] = {
    "天符「三千大千世界の主」",
    "天符「大日如来の輝き」",
    "天符「釈迦牟尼の五行山」",
    "「アーンギラサヴェーダ」",
    "杵符「ヴァジュラパーニの呪文」",
    "超人「ガルーダの翼」"
}
scJp["圣白莲"]["天邪鬼"] = {
    "「ハリの制縛」",
    "「ブラフマーの瞳」"
}
scJp["圣白莲"]["深秘录"] = {
    "天符「三千大千世界の主」",
    "天符「大日如来の輝き」",
    "天符「釈迦牟尼の五行山」",
    "＊１００キロで空を駆けろ！＊",
    "超音速「老婆のスプリント」",
    "＊ハイウェイターボエアターン＊",
    "＊ターボババァ走死走愛＊",
    "光符「インドラのヴァジュラ」",
    "超人「聖白蓮」",
    "超人「大追跡！ブディストライダー」"
}
scJp["圣白莲"]["凭依华"] = {
    "天符「三千大千世界の主」",
    "天符「大日如来の輝き」",
    "天符「釈迦牟尼の五行山」",
    "＊１００キロで空を駆けろ！＊",
    "光撃符「君を導く王道のヴァジュラシュート」",
    "撃拳符「スカンダの怪雲拳」",
    "撃光符「スカンダの王道の威光」",
    "蹴斬符「ガルーダの聖德斬」",
    "光仙符「日出ずる国の僧侶と道士」",
    "光拳符「インドラのヴァジュラ怪雲拳」",
    "撃符「スカンダに追われる正夢」"
}
scJp["圣白莲"]["噩梦日记"] = {
    "星神符「十七条の超人」",
    "紅星符「超人ブラッディナイフ」",
    "紅星符「超人カタストロフ行脚」"
}

scJp["封兽鵺"] = {}
scJp["封兽鵺"]["星莲船"] = {
    "妖雲「平安のダーククラウド」",
    "正体不明「忿怒のレッドUFO襲来」",
    "鵺符「鵺的スネークショー」",
    "正体不明「哀愁のブルーUFO襲来」",
    "鵺符「弾幕キメラ」",
    "正体不明「義心のグリーンUFO襲来」",
    "鵺符「アンディファインドダークネス」",
    "正体不明「恐怖の虹色ＵＦＯ襲来」",
    "「平安京の悪夢」",
    "恨弓「源三位頼政の弓」"
}
scJp["封兽鵺"]["文花帖DS"] = {
    "正体不明「紫鏡」",
    "正体不明「赤マント青マント」",
    "正体不明「厠の花子さん」",
    "「遊星よりの弾幕Ｘ」"
}
scJp["封兽鵺"]["神灵庙"] = {
    "アンノウン「軌道不明の鬼火」",
    "アンノウン「姿態不明の空魚」",
    "アンノウン「原理不明の妖怪玉」"
}
scJp["封兽鵺"]["噩梦日记"] = {
    "神星符「正体不明の怪光人だかり」",
    "緋星符「正体不明の落雷」",
    "輝星符「正体不明のドンドコ太鼓」"
}

scJp["大鲶鱼"] = {}
scJp["大鲶鱼"]["非想天则"] = {
    "ナマズ「ほらほら世界が震えるぞ？」",
    "ナマズ「液状化現象で大地も泥のようじゃ！」",
    "ナマズ「発電だって頑張っちゃうぞ？」",
    "ナマズ「オール電化でエコロジーじゃ！」",
    "大ナマズ「これで浮き世もおしまいじゃあ！！」"
}

scJp["姬海棠果"] = {}
scJp["姬海棠果"]["文花帖DS"] = {
    "取材「姫海棠はたての练习取材」",
    "连写「ラピッドショット」",
    "远眼「天狗サイコグラフィ」"
}
scJp["姬海棠果"]["天邪鬼"] = {
    "写真「フルパノラマショット」",
    "写真「籠もりパパラッチ」"
}

scJp["光之三妖精"] = {}
scJp["光之三妖精"]["大战争"] = {
    "光符「ルチルフレクション」",
    "空符「エルフィンキャノピー」",
    "光符「トリプルメテオ」",
    "光星「オリオンベルト」",
    "光符「ブライトナイト」",
    "空符「ブレイクキャノピー」",
    "光符「エクステンシブメテオ」",
    "光星「グレートトライアングル」",
    "光符「フルムーンナイト」",
    "降光「トリプルライト」",
    "光符「ハイパーインクレクション」",
    "激光「サンバースト」",
    "星熱「アイスディゾルバー」",
    "月熱「アイスディゾルバー」",
    "日熱「アイスディゾルバー」",
    "協力技「フェアリーオーバードライブ」",
    "「スリーフェアリーズ」"
}

scJp["桑尼"] = {}
scJp["桑尼"]["大战争"] = {
    "陽光「サンシャインブラスト」",
    "虹光「プリズムフラッシュ」",
    "光精「ダイアモンドリング」",
    "光符「ブルーディフレクション」",
    "日符「アグレッシブライト」",
    "日符「ダイレクトサンライト」",
    "瞬光「フェイタルフラッシュ」",
    "光精「クロスディフュージョン」",
    "光符「イエローディフレクション」",
    "陽光「サンシャインニードル」"
}

scJp["露娜"] = {}
scJp["露娜"]["大战争"] = {
    "月符「ルナティックレイン」",
    "月符「ルナサイクロン」",
    "月光「サイレントストーム」",
    "月光「ダークスティルネス」",
    "障光「ムーンライトウォール」",
    "夜符「ナイトフェアリーズ」",
    "月光「サイレントフラワー」",
    "月光「ムーンスティルネス」",
    "光壁「ウォールブレイク」",
    "月光「サイレントサイクロン」"
}

scJp["斯塔"] = {}
scJp["斯塔"]["大战争"] = {
    "流星「プチコメット」",
    "星粒「スプリンクルピース」",
    "星符「トゥインクルサファイア」",
    "星光「スターレーザー」",
    "流星「コメットストリーム」",
    "星粒「スターピースシャワー」",
    "星符「シューティングサファイア」",
    "星光「スターストーム」",
    "星符「スターライトレイン」",
    "星符「レッドスター」"
}

scJp["幽谷响子"] = {}
scJp["幽谷响子"]["神灵庙"] = {
    "響符「マウンテンエコー」",
    "響符「マウンテンエコースクランブル」",
    "響符「パワーレゾナンス」",
    "山彦「ロングレンジエコー」",
    "山彦「アンプリファイエコー」",
    "大声「チャージドクライ」",
    "大声「チャージドヤッホー」",
    "山彦「ヤマビコの本領発揮エコー」"
}
scJp["幽谷响子"]["天邪鬼"] = {
    "叫喚「プライマルスクリーム」",
    "劈音「ピアッシングサークル」",
    "御経「無限念仏」"
}

scJp["宫古芳香"] = {}
scJp["宫古芳香"]["神灵庙"] = {
    "回復「ヒールバイデザイア」",
    "毒爪「ポイズンレイズ」",
    "毒爪「ポイズンマーダー」",
    "欲符「稼欲霊招来」",
    "欲霊「スコアデザイアイーター」",
    "毒爪「死なない殺人鬼」"
}
scJp["宫古芳香"]["天邪鬼"] = {
    "毒爪「ゾンビクロー」"
}

scJp["霍青娥"] = {}
scJp["霍青娥"]["神灵庙"] = {
    "邪符「ヤンシャオグイ」",
    "邪符「グーフンイエグイ」",
    "入魔「ゾウフォルゥモォ」",
    "降霊「死人タンキー」",
    "通霊「トンリン芳香」",
    "道符「タオ胎動」",
    "道符「ＴＡＯ胎動　～道～」"
}
scJp["霍青娥"]["天邪鬼"] = {
    "入魔「過剰ゾウフォルゥモォ」",
    "仙術「ウォールランナー」",
    "仙術「壁抜けワームホール」"
}

scJp["苏我屠自古"] = {}
scJp["苏我屠自古"]["神灵庙"] = {
    "雷矢「ガゴウジサイクロン」",
    "雷矢「ガゴウジトルネード」",
    "怨霊「入鹿の雷」"
}

scJp["物部布都"] = {}
scJp["物部布都"]["神灵庙"] = {
    "天符「雨の磐舟」",
    "天符「天の磐舟よ天へ昇れ」",
    "投皿「物部の八十平瓮」",
    "炎符「廃仏の炎風」",
    "炎符「桜井寺炎上」",
    "聖童女「大物忌正餐」",
    "聖童女「太陽神の贄」"
}
scJp["物部布都"]["心绮楼"] = {
    "風符「三輪の皿嵐」",
    "炎符「太乙真火」",
    "運気「破局の開門」",
    "「大火の改新」",
    "皿投「かわらけ回転投げ」",
    "弓符「星龍弓」"
}
scJp["物部布都"]["天邪鬼"] = {
    "古舟「エンシェントシップ」",
    "熱龍「火焔龍脈」"
}
scJp["物部布都"]["深秘录"] = {
    "風符「三輪の皿嵐」",
    "炎符「太乙真火」",
    "運気「破局の開門」",
    "＊死んでも一枚足りない！＊",
    "皿符「自暴自棄のお菊」",
    "＊仄暗い古井戸の底から＊"
}
scJp["物部布都"]["凭依华"] = {
    "風符「三輪の皿嵐」",
    "炎符「太乙真火」",
    "運気「破局の開門」",
    "＊死んでも一枚足りない！＊",
    "拳風符「入道叢雲風水拳」",
    "風霊符「磐舟かわらけ封印」",
    "面風符「喜怒哀楽風水術」",
    "光風符「レイディアント風水マント」"
}

scJp["丰聪耳神子"] = {}
scJp["丰聪耳神子"]["神灵庙"] = {
    "名誉「十二階の色彩」",
    "名誉「十二階の冠位」",
    "仙符「日出ずる処の道士」",
    "仙符「日出ずる処の天子」",
    "召喚「豪族乱舞」",
    "秘宝「斑鳩寺の天球儀」",
    "秘宝「聖徳太子のオーパーツ」",
    "光符「救世観音の光後光」",
    "光符「グセフラッシュ」",
    "眼光「十七条のレーザー」",
    "神光「逆らう事なきを宗とせよ」",
    "「星降る神霊廟」",
    "「生まれたての神霊」",
    "「神霊大宇宙」"
}
scJp["丰聪耳神子"]["心绮楼"] = {
    "仙符「日出ずる処の道士」",
    "道符「掌の上の天道」",
    "人符「勧善懲悪は古の良き典なり」",
    "「詔を承けては必ず慎め」",
    "徳符「聖徳のプレスティージ」",
    "光符「無限条のレーザー」"
}
scJp["丰聪耳神子"]["天邪鬼"] = {
    "「我こそが天道なり」",
    "「十七条の憲法爆弾」"
}
scJp["丰聪耳神子"]["深秘录"] = {
    "仙符「日出ずる処の道士」",
    "道符「掌の上の天道」",
    "人符「勧善懲悪は古の良き典なり」",
    "＊特別に両方選ばせてやろう！＊",
    "怪人「ヘルメティックマント」",
    "＊大怪人の動脈と静脈＊",
    "＊世紀の怪人赤マント青マント＊",
    "怪人「ブラッディマント」",
    "怪人「カーシング赤青マント」",
    "「死生有命　～自らの意思で最期を選べ」"
}
scJp["丰聪耳神子"]["凭依华"] = {
    "仙符「日出ずる処の道士」",
    "道符「掌の上の天道」",
    "人符「勧善懲悪は古の良き典なり」",
    "＊特別に両方選ばせてやろう！＊",
    "光撃符「君を導く王道のヴァジュラシュート」",
    "撃光符「スカンダの王道の威光」",
    "蹴斬符「ガルーダの聖德斬」",
    "光仙符「日出ずる国の僧侶と道士」",
    "光風符「レイディアント風水マント」",
    "光符「君を導く夢王道の威光」"
}
scJp["丰聪耳神子"]["噩梦日记"] = {
    "星神符「十七条の超人」",
    "紅神符「十七条のカタストロフ」",
    "神紅符「ブラッディ十七条のレーザー」"
}

scJp["二岩猯藏"] = {}
scJp["二岩猯藏"]["神灵庙"] = {
    "壱番勝負「霊長化弾幕変化」",
    "弐番勝負「肉食化弾幕変化」",
    "参番勝負「延羽化弾幕変化」",
    "四番勝負「両生化弾幕変化」",
    "伍番勝負「鳥獣戯画」",
    "六番勝負「狸の化け学校」",
    "七番勝負「野生の離島」",
    "変化「まぬけ巫女の偽調伏」",
    "「マミゾウ化弾幕十変化」",
    "狢符「満月のポンポコリン」",
    "「ワイルドカーペット」"
}
scJp["二岩猯藏"]["心绮楼"] = {
    "変化「分福熱湯風呂」",
    "変化「百鬼妖界の門」",
    "変化「二ッ岩家の裁き」",
    "「八百八狸囃子」",
    "変化「満月の花鳥園」",
    "変化「鸟獣戯画」",
    "変化「百鬼妖界の門」",
    "「たわむれはおわりじゃ」",
    "「ベンテンの琵琶法師」",
    "「神社のお釈迦様」"
}
scJp["二岩猯藏"]["天邪鬼"] = {
    "「鳴かぬなら泣くまで待とう時鳥」",
    "「にんげんって良いな」"
}
scJp["二岩猯藏"]["深秘录"] = {
    "変化「分福熱湯風呂」",
    "変化「百鬼妖界の門」",
    "変化「二ッ岩家の裁き」",
    "＊宇宙機密漏洩！直ちに処置せよ＊",
    "未確認「遊抱戯画」",
    "＊満員のエイリアンボール＊",
    "＊そろそろ帰ろうエイリアン達よ＊"
}
scJp["二岩猯藏"]["凭依华"] = {
    "変化「分福熱湯風呂」",
    "変化「百鬼妖界の門」",
    "変化「二ッ岩家の裁き」",
    "＊宇宙機密漏洩！直ちに処置せよ＊",
    "化火符「妖怪弾幕変化　葉っぱ発破」",
    "槌化符「大判小判弾幕変化」",
    "雷化符「務光と葉っぱの弾幕変化」",
    "龍化符「ドラゴンズエイリアンカプセル」",
    "化符「妖怪弾幕変化　夢見心地」"
}
scJp["二岩猯藏"]["噩梦日记"] = {
    "神星符「正体不明の怪光人だかり」",
    "輝神符「謎のドンドコ人だかり」",
    "神緋符「雷雨の中のストーカー」"
}

scJp["秦心"] = {}
scJp["秦心"]["心绮楼"] = {
    "怒面「怒れる忌狼の面」",
    "憑依「喜怒哀楽ポゼッション」",
    "憂面「杞人地を憂う」",
    "「仮面喪心舞　暗黒能楽」",
    "憂符「憂き世は憂しの小車」",
    "喜符「昂揚の神楽獅子」",
    "怒符「怒れる忌狼の面」",
    "「モンキーポゼッション」"
}
scJp["秦心"]["深秘录"] = {
    "怒面「怒れる忌狼の面」",
    "憑依「喜怒哀楽ポゼッション」",
    "憂面「杞人地を憂う」",
    "＊これでもアタシ、キレイよね？＊",
    "＊口裂けの感情＊"
}
scJp["秦心"]["凭依华"] = {
    "怒面「怒れる忌狼の面」",
    "憑依「喜怒哀楽ポゼッション」",
    "憂面「杞人地を憂う」",
    "＊これでもアタシ、キレイよね？＊",
    "水面符「ミズバクマスカレード」",
    "面風符「喜怒哀楽風水術」",
    "面符「喜怒哀楽発狂マスカレード」"
}

scJp["若鹭姬"] = {}
scJp["若鹭姬"]["辉针城"] = {
    "水符「テイルフィンスラップ」",
    "鱗符「スケールウェイブ」",
    "鱗符「逆鱗の荒波」",
    "鱗符「逆鱗の大荒波」"
}
scJp["若鹭姬"]["天邪鬼"] = {
    "水符「ルナティックレッドスラップ」",
    "潮符「湖のタイダルウェイブ」",
    "魚符「スクールオブフィッシュ」"
}

scJp["赤蛮奇"] = {}
scJp["赤蛮奇"]["辉针城"] = {
    "飛符「フライングヘッド」",
    "首符「クローズアイショット」",
    "首符「ろくろ首飛来」",
    "飛頭「マルチプリケイティブヘッド」",
    "飛頭「セブンズヘッド」",
    "飛頭「ナインズヘッド」",
    "飛頭「デュラハンナイト」"
}
scJp["赤蛮奇"]["天邪鬼"] = {
    "飛首「エクストリームロングネック」",
    "眼光「ヘルズレイ」",
    "飛首「ツインロクロヘッド」"
}

scJp["今泉影狼"] = {}
scJp["今泉影狼"]["辉针城"] = {
    "牙符「月下の犬歯」",
    "変身「トライアングルファング」",
    "変身「スターファング」",
    "咆哮「ストレンジロア」",
    "咆哮「満月の远吠え」",
    "狼符「スターリングパウンス」",
    "天狼「ハイスピードバウンス」"
}
scJp["今泉影狼"]["天邪鬼"] = {
    "満月「フルムーンロア」",
    "狼牙「血に餓えたウルフファング」"
}

scJp["九十九姐妹"] = {}
scJp["九十九姐妹"]["辉针城"] = {
    "弦楽「嵐のアンサンブル」",
    "弦楽「浄瑠璃世界」"
}

scJp["九十九弁弁"] = {}
scJp["九十九弁弁"]["辉针城"] = {
    "平曲「祇園精舎の鐘の音」",
    "怨霊「耳無し芳一」",
    "怨霊「平家の大怨霊」",
    "楽符「邪悪な五線譜」",
    "楽符「凶悪な五線譜」",
    "楽符「ダブルスコア」"
}
scJp["九十九弁弁"]["天邪鬼"] = {
    "音符「大熱唱琵琶」",
    "楽譜「スコアウェブ」",
    "両吟「星降る唄」"
}

scJp["九十九八桥"] = {}
scJp["九十九八桥"]["辉针城"] = {
    "琴符「諸行無常の琴の音」",
    "響符「平安の残響」",
    "響符「エコーチェンバー」",
    "筝曲「下克上送筝曲」",
    "筝曲「下克上レクイエム」"
}
scJp["九十九八桥"]["天邪鬼"] = {
    "琴符「天の詔琴」",
    "哀歌「人琴ともに亡ぶ」",
    "両吟「星降る唄」"
}

scJp["鬼人正邪"] = {}
scJp["鬼人正邪"]["辉针城"] = {
    "欺符「逆針撃」",
    "逆符「鏡の国の弾幕」",
    "逆符「イビルインザミラー」",
    "逆符「天地有用」",
    "逆符「天下転覆」",
    "逆弓「天壌夢弓」",
    "逆弓「天壌夢弓の詔勅」",
    "逆転「リバースヒエラルキー」",
    "逆転「チェンジエアブレイブ」"
}

scJp["少名针妙丸"] = {}
scJp["少名针妙丸"]["辉针城"] = {
    "小弾「小人の道」",
    "小弾「小人の茨道」",
    "小槌「大きくなあれ」",
    "小槌「もっと大きくなあれ」",
    "妖剣「輝針剣」",
    "小槌「お前が大きくなあれ」",
    "「進撃の小人」",
    "「ウォールオブイッスン」",
    "「ホップオマイサムセブン」",
    "「七人の一寸法師」"
}
scJp["少名针妙丸"]["天邪鬼"] = {
    "「小人の地獄」",
    "輝針「鬼ごろし両目突きの針」"
}
scJp["少名针妙丸"]["深秘录"] = {
    "小槌「伝説の椀飯振舞」",
    "小人「一寸法師にも五分の魂」",
    "釣符「可愛い太公望」",
    "＊緑の巨人よ、おおきくなれよ！＊",
    "大漁「空中大回転漁法」",
    "＊幻の国ブレフスキュ＊"
}
scJp["少名针妙丸"]["凭依华"] = {
    "小槌「伝説の椀飯振舞」",
    "小人「一寸法師にも五分の魂」",
    "釣符「可愛い太公望」",
    "＊緑の巨人よ、おおきくなれよ！＊",
    "槌化符「大判小判弾幕変化」",
    "昇槌符「僕らの夢を載せて大きくなあれ」",
    "墜槌符「夢は大気圏に墜ちて大きくなあれ」",
    "「全小人族の緋想天」",
    "狂槌符「狂視幻像（ディスオーダーアイ）も大きくなあれ」",
    "槌恋符「大判小判ザックザクハート」",
    "槌礫符「大判小判ザックザクサイコキネシス」"
}
scJp["少名针妙丸"]["噩梦日记"] = {
    "緋針符「要石も大きくなあれ」",
    "輝夜符「蓬莱の大きな弾の枝」",
    "妖風符「土着蝶ストーム」"
}

scJp["堀川雷鼓"] = {}
scJp["堀川雷鼓"]["辉针城"] = {
    "一鼓「暴れ宮太鼓」",
    "二鼓「怨霊アヤノツヅミ」",
    "三鼓「午前零時のスリーストライク」",
    "死鼓「ランドパーカス」",
    "五鼓「デンデン太鼓」",
    "六鼓「オルタネイトスティッキング」",
    "七鼓「高速和太鼓ロケット」",
    "八鼓「雷神の怒り」",
    "「ブルーレディショー」",
    "「プリスティンビート」"
}
scJp["堀川雷鼓"]["天邪鬼"] = {
    "雷符「怒りのデンデン太鼓」",
    "太鼓「ファンタジックウーファー」"
}
scJp["堀川雷鼓"]["噩梦日记"] = {
    "輝天符「迅雷のドンドコ太鼓」",
    "輝神符「謎のドンドコ人だかり」",
    "輝星符「正体不明のドンドコ太鼓」"
}

scJp["茨木华扇"] = {}
scJp["茨木华扇"]["深秘录"] = {
    "包符「義腕プロテウス」",
    "龍符「ドラゴンズグロウル」",
    "鷹符「ホークビーコン」",
    "＊猿の手よ！敵を握りつぶせ！＊",
    "雷符「微速の務光」",
    "虎符「両門の彭祖」",
    "＊死ぬまで願いを叶える手＊",
    "＊猿の手はオカルトな夢を見る＊"
}
scJp["茨木华扇"]["凭依华"] = {
    "包符「義腕プロテウス」",
    "龍符「ドラゴンズグロウル」",
    "鷹符「ホークビーコン」",
    "＊猿の手よ！敵を握りつぶせ！＊",
    "霊鷹符「鷹による夢想封印ハンティング」",
    "雷霊符「務光の雷弾夢想封印」",
    "龍蹴符「ドラゴンズ飛鳥井キック」",
    "雷化符「務光と葉っぱの弾幕変化」",
    "龍化符「ドラゴンズエイリアンカプセル」",
    "雷符「務光の雷霆閃光夢幻弾」",
    "龍符「ドラゴンズオプティカルドリーム」"
}

scJp["宇佐见堇子"] = {}
scJp["宇佐见堇子"]["深秘录"] = {
    "銃符「３Ｄプリンターガン」",
    "念力「サイコキネシスアプリ」",
    "念力「テレキネシス　電波塔」",
    "＊幻視せよ！異世界の狂気を＊",
    "念力「サイコプロ－ジョン」",
    "念力「テレキネシス　不法投棄」",
    "＊現し世のオカルティシャン＊",
    "＊深秘のエソテリックセブン＊"
}
scJp["宇佐见堇子"]["凭依华"] = {
    "銃符「３Ｄプリンターガン」",
    "念力「サイコキネシスアプリ」",
    "念力「テレキネシス　電波塔」",
    "＊幻視せよ！異世界の狂気を＊",
    "超能力「サイコキネシスエンドレス」",
    "夢礫符「羊毛色のサイコキネシス」",
    "Ｗ超能力「サイコキネシステレポーテーション」",
    "Ｗ超能力「絶体絶命メトロポリタン」",
    "「世紀のダブルエスパー　宇佐見菫子」",
    "槌礫符「大判小判ザックザクサイコキネシス」"
}
scJp["宇佐见堇子"]["噩梦日记"] = {
    "紙符「ＥＳＰカード手裏剣」",
    "紙符「結界中のＥＳＰカード手裏剣」"
}

scJp["清兰"] = {}
scJp["清兰"]["绀珠传"] = {
    "凶弾「スピードストライク」",
    "弾符「イーグルシューティング」",
    "弾符「鷹は撃ち抜いた」",
    "銃符「ルナティックガン」"
}
scJp["清兰"]["噩梦日记"] = {
    "弾符「イーグルシューティング」",
    "弾符「ラビットファルコナー」",
    "夢弾「ルナティックドリームショット」"
}

scJp["铃瑚"] = {}
scJp["铃瑚"]["绀珠传"] = {
    "兎符「ストロベリーダンゴ」",
    "兎符「ベリーベリーダンゴ」",
    "兎符「ダンゴインフリューエンス」",
    "月見「セプテンバーフルムーン」",
    "月見酒「ルナティックセプテンバー」"
}
scJp["铃瑚"]["噩梦日记"] = {
    "兎符「ストロベリー大ダンゴ」",
    "兎符「ダンゴ三姉妹」",
    "団子「ダンゴフラワー」"
}

scJp["哆来咪"] = {}
scJp["哆来咪"]["绀珠传"] = {
    "夢符「緋色の悪夢」",
    "夢符「緋色の圧迫悪夢」",
    "夢符「藍色の愁夢」",
    "夢符「藍色の愁三重夢」",
    "夢符「愁永遠の夢」",
    "夢符「刈安色の迷夢」",
    "夢符「刈安色の錯綜迷夢」",
    "夢符「ドリームキャッチャー」",
    "夢符「蒼色のドリームキャッチャー」",
    "夢符「夢我夢中」",
    "月符「紺色の狂夢」",
    "胡蝶「バタフライサプランテーション」",
    "超特急「ドリームエクスプレス」",
    "這夢「クリーピングバレット」"
}
scJp["哆来咪"]["凭依华"] = {
    "夢符「留紺色の逃走夢」",
    "夢符「漆黑の宇宙夢」",
    "羊符「ナイトメア·オブ·キメラ」",
    "＊もう目覚めなくて良いのよ＊",
    "超能力「サイコキネシスエンドレス」",
    "夢礫符「羊毛色のサイコキネシス」",
    "霊符「夢想封印　夢限」",
    "星符「アステロイドベルトナイトメア」",
    "夢要符「羊毛色の乾坤一擲」",
    "面符「喜怒哀楽発狂マスカレード」",
    "化符「妖怪弾幕変化　夢見心地」",
    "光符「君を導く夢王道の威光」",
    "撃符「スカンダに追われる正夢」",
    "雷符「務光の雷霆閃光夢幻弾」",
    "龍符「ドラゴンズオプティカルドリーム」",
    "昇符「遥か宙まで飛べ！　僕らの夢を載せて」",
    "墜符「大気圏に落ちて、夢は地表に降り注ぐ」",
    "「大地を造り直そう、夢のある世界へ！」"
}
scJp["哆来咪"]["噩梦日记"] = {
    "「最後の日曜日に見る悪夢」"
}

scJp["稀神探女"] = {}
scJp["稀神探女"]["绀珠传"] = {
    "玉符「烏合の呪」",
    "玉符「烏合の逆呪」",
    "玉符「烏合の二重呪」",
    "玉符「穢身探知型機雷」",
    "玉符「穢身探知型機雷　改」",
    "玉符「神々の弾冠」",
    "玉符「神々の光り輝く弾冠」",
    "「片翼の白鷺」"
}
scJp["稀神探女"]["噩梦日记"] = {
    "玉符「金城鉄壁の陰陽玉」",
    "玉符「神々の写し難い弾冠」",
    "夢鷺「片翼の夢鷺」"
}

scJp["克劳恩皮丝"] = {}
scJp["克劳恩皮丝"]["绀珠传"] = {
    "獄符「ヘルエクリプス」",
    "獄符「地獄の蝕」",
    "獄符「フラッシュアンドストライプ」",
    "獄符「スターアンドストライプ」",
    "獄炎「グレイズインフェルノ」",
    "獄炎「かすりの獄意」",
    "地獄「ストライプドアビス」",
    "「フェイクアポロ」",
    "「アポロ捏造説」"
}
scJp["克劳恩皮丝"]["噩梦日记"] = {
    "獄符「バースティンググラッジ」",
    "獄符「ダブルストライプ」",
    "月夢「エクリプスナイトメア」"
}

scJp["纯狐"] = {}
scJp["纯狐"]["绀珠传"] = {
    "「掌の純光」",
    "「殺意の百合」",
    "「原始の神霊界」",
    "「現代の神霊界」",
    "「震え凍える星」",
    "「純粋なる狂気」",
    "「溢れ出る瑕穢」",
    "「地上穢の純化」",
    "純符「ピュアリーバレットヘル」",
    "純符「純粋な弾幕地獄」",
    "「袋の鼠を追い詰める為の単純な弾幕」",
    "「人を殺める為の純粋な弾幕」",
    "「最初で最後の無名の弾幕」"
}
scJp["纯狐"]["噩梦日记"] = {
    "「震え凍える悪夢」",
    "「サイケデリックマンダラ」",
    "「極めて威厳のある純光」",
    "「確実に悪夢で殺す為の弾幕」",
    "紺珠符「純粋と不純の弾幕」",
    "萃珠符「純粋な五里霧中」",
    "永珠符「穢れ無き珠と穢れ多き霊」"
}

scJp["赫卡提亚"] = {}
scJp["赫卡提亚"]["绀珠传"] = {
    "異界「逢魔ガ刻」",
    "地球「邪穢在身」",
    "月「アポロ反射鏡」",
    "異界「地獄のノンイデアル弾幕」",
    "地球「地獄に降る雨」",
    "月「ルナティックインパクト」",
    "「トリニタリアンラプソディ」",
    "「最初で最後の無名の弾幕」"
}
scJp["赫卡提亚"]["噩梦日记"] = {
    "異界「ディストーテッドファイア」",
    "異界「恨みがましい地獄の雨」",
    "月「コズミックレディエーション」",
    "異界「逢魔ガ刻　夢」",
    "「月が堕ちてくる！」",
    "紺珠符「純粋と不純の弾幕」",
    "永珠符「捨て身のリフレクション」",
    "萃珠符「ミストレイ」"
}

scJp["依神女苑"] = {}
scJp["依神女苑"]["凭依华"] = {
    "憑依剝奪「スレイブロバー」",
    "貧符「超貧乏玉」",
    "「クイーンオブバブル」",
    "「80'sのエクストーショナー」",
    "不運「ようこそ極貧の世界へ」",
    "財禍「プラックピジョン」",
    "憑依交換「アブソリュートルーザー」",
    "「最強最良の異変解決巫女」"
}

scJp["依神紫苑"] = {}
scJp["依神紫苑"]["凭依华"] = {
    "不運「ようこそ極貧の世界へ」",
    "財禍「プラックピジョン」",
    "憑依交換「アブソリュートルーザー」",
    "貧符「ミスチャンススキャッター」",
    "「最凶最悪の極貧不幸神」"
}

scJp["爱塔"] = {}
scJp["爱塔"]["天空璋"] = {
    "蝶符「ミニットスケールス」",
    "蝶符「アゲハの鱗粉」",
    "蝶符「フラッタリングサマー」",
    "蝶符「真夏の羽ばたき」"
}
scJp["爱塔"]["噩梦日记"] = {
    "蝶符「バタフライドリーム」",
    "蝶符「纏わり付く鱗粉」",
    "夢蝶「クレージーバタフライ」"
}

scJp["坂田合欢乃"] = {}
scJp["坂田合欢乃"]["天空璋"] = {
    "雨符「囚われの秋雨」",
    "雨符「呪われた柴榑雨」",
    "刃符「山姥の包丁研ぎ」",
    "刃符「山姥の鬼包丁研ぎ」",
    "尽符「マウンテンマーダー」",
    "尽符「ブラッディマウンテンマーダー」"
}
scJp["坂田合欢乃"]["噩梦日记"] = {
    "研符「狂い輝く鬼包丁」",
    "殺符「窮僻の山姥」",
    "夢尽「殺人鬼の懐」"
}

scJp["高丽野阿吽"] = {}
scJp["高丽野阿吽"]["天空璋"] = {
    "犬符「野良犬の散歩」",
    "狗符「山狗の散歩」",
    "独楽「コマ犬回し」",
    "敌机 3面2符 独楽「カールアップアンドダイ」",
    "狛符「独り阿吽の呼吸」"
}
scJp["高丽野阿吽"]["噩梦日记"] = {
    "独楽「コマ犬大回転」",
    "独楽「阿吽の閃光」",
    "夢犬「１０１匹の野良犬」"
}

scJp["矢田寺成美"] = {}
scJp["矢田寺成美"]["天空璋"] = {
    "魔符「インスタントボーディ」 ",
    "魔符「即席菩提」",
    "魔符「バレットゴーレム」",
    "魔符「ペットの巨大弾生命体」",
    "地蔵「クリミナルサルヴェイション」",
    "地蔵「業火救済」"
}
scJp["矢田寺成美"]["噩梦日记"] = {
    "魔符「慈愛の地蔵」",
    "地蔵「菩薩ストンプ」",
    "地蔵「活きの良いバレットゴーレム」",
    "夢地蔵「劫火の希望」"
}

scJp["尔子田里乃"] = {}
scJp["尔子田里乃"]["天空璋"] = {
    "茗荷「フォゲットユアネーム」",
    "冥加「ビハインドユー」",
    "舞符「ビハインドフェスティバル」",
    "狂舞「テングオドシ」",
    "狂舞「狂乱天狗怖し」",
    "鼓舞「パワフルチアーズ」",
    "狂舞「クレイジーバックダンス」",
    "弾舞「二つ目の台風」"
}
scJp["尔子田里乃"]["噩梦日记"] = {
    "茗荷「メスメリズムダンス」",
    "冥加「ビハインドナイトメア」"
}

scJp["丁礼田舞"] = {}
scJp["丁礼田舞"]["天空璋"] = {
    "竹符「バンブースピアダンス」",
    "竹符「バンブークレイジーダンス」",
    "笹符「タナバタスターフェスティバル」",
    "舞符「ビハインドフェスティバル」",
    "狂舞「テングオドシ」",
    "狂舞「狂乱天狗怖し」",
    "鼓舞「パワフルチアーズ」",
    "狂舞「クレイジーバックダンス」",
    "弾舞「二つ目の台風」"
}
scJp["丁礼田舞"]["噩梦日记"] = {
    "竹符「バンブーラビリンス」",
    "笹符「タナバタスタードリーム」"
}

scJp["摩多罗隐岐奈"] = {}
scJp["摩多罗隐岐奈"]["天空璋"] = {
    "後符「秘神の後光」",
    "後符「絶対秘神の後光」",
    "裏夏「スコーチ・バイ・ホットサマー」",
    "裏夏「異常猛暑の焦土」",
    "裏秋「ダイ・オブ・ファミン」",
    "裏秋「異常枯死の餓鬼」",
    "裏冬「ブラックスノーマン」",
    "裏冬「異常降雪の雪だるま」",
    "裏春「エイプリルウィザード」",
    "裏春「異常落花の魔術使い」",
    "「裏・ブリージーチェリーブロッサム」",
    "「裏・パーフェクトサマーアイス」",
    "「裏・クレイジーフォールウィンド」",
    "「裏・エクストリームウィンター」",
    "秘儀「リバースインヴォーカー」",
    "秘儀「裏切りの後方射撃」",
    "秘儀「弾幕の玉繭」",
    "秘儀「穢那の火」",
    "秘儀「後戸の狂言」",
    "秘儀「マターラドゥッカ」",
    "秘儀「七星の剣」",
    "秘儀「無縁の芸能者」",
    "「背面の暗黒猿楽」",
    "「アナーキーバレットヘル」"
}
scJp["摩多罗隐岐奈"]["噩梦日记"] = {
    "秘儀「マターラスッカ」",
    "秘儀「背面の邪炎」",
    "後符「絶対秘神の後光」",
    "秘儀「秘神の暗躍弾幕」",
    "秘儀「神秘の玉繭」",
    "「秘神結界」",
    "「背後からの盗撮者調伏」",
    "「卑怯者マスタースパーク」"
}

scJp["绵月依姬"] = {}
scJp["绵月依姬"]["儚月抄"] = {
    "「火雷神」",
    "「金山彦命」",
    "「天津甕星」",
    "「石凝姥命」",
    "「天宇受売命」",
    "「天照大御神」",
    "「伊豆能売」"
}

return scJp