--符卡中文
local scZh = {}

scZh["博丽灵梦"] = {}
scZh["博丽灵梦"]["红魔乡"] = {
    "灵符「梦想封印」",
    "梦符「封魔阵」"
}
scZh["博丽灵梦"]["妖妖梦"] = {
    "灵符「梦想封印　散」",
    "灵符「梦想封印　集」",
    "梦符「封魔阵」",
    "梦符「二重结界」"
}
scZh["博丽灵梦"]["萃梦想"] = {
    "灵符「梦想妙珠」",
    "神灵「梦想封印」",
    "梦符「封魔阵」",
    "神技「八方鬼缚阵」",
    "宝符「阴阳宝玉」",
    "宝具「阴阳鬼神玉」",
    "符之一「梦想妙珠连」",
    "符之二「阴阳散华」",
    "符之三「魔净闪结」",
    "力符「阴阳玉将」",
    "梦战「幻想之月」",
    "无题「飞翔于天空的不可思议的巫女」"
}
scZh["博丽灵梦"]["永夜抄"] = {
    "灵符「梦想妙珠」",
    "神灵「梦想封印　瞬」",
    "梦符「二重结界」",
    "梦境「二重大结界」",
    "灵符「梦想封印　散」",
    "散灵「梦想封印　寂」",
    "梦符「封魔阵」",
    "神技「八方鬼缚阵」",
    "神技「八方龙杀阵」",
    "灵符「梦想封印　集」",
    "回灵「梦想封印　侘」",
    "境界「二重弹幕结界」",
    "大结界「博丽弹幕结界」",
    "神灵「梦想封印　瞬」",
    "「梦想天生」"
}
scZh["博丽灵梦"]["花映塚"] = {
    "灵符「阴阳印」",
    "灵符「梦想封印」",
    "灵符「博丽幻影」"
}
scZh["博丽灵梦"]["绯想天"] = {
    "祈愿「祛除厄运之祈愿」",
    "宝符「跳跃的阴阳玉」",
    "梦境「二重大结界」",
    "光灵「神灵宝珠」",
    "「潜伏在境界内侧的灵与不可思议的巫女」",
    "灵符「梦想妙珠」",
    "神灵「梦想封印」",
    "神技「八方鬼缚阵」",
    "珠符「明珠暗投」",
    "宝符「阴阳宝玉」",
    "宝具「阴阳鬼神玉」",
    "神技「天霸风神脚」",
    "「梦想天生」"
}
scZh["博丽灵梦"]["地灵殿"] = {
    "「违背常识的另一侧」",
    "「萃灵花」",
    "「乌鸦的暗影」"
}
scZh["博丽灵梦"]["星莲船"] = {
    "梦符「退魔符乱舞」",
    "灵符「梦想封印」"
}
scZh["博丽灵梦"]["非想天则"] = {
    "御守「妖怪拘禁符」",
    "灵符「梦想封印　圆」",
    "神灵「梦想封印　瞬」",
    "「最凶恶的吓人巫女玉」",
    "梦符「封魔阵」",
    "结界「扩散结界」"
}
scZh["博丽灵梦"]["文花帖DS"] = {
    "灵札「报刊推销团降服」",
    "结界「Paparazzi击退结界」（狗仔队击退结界）",
    "梦符「梦想亚空穴」"
}
scZh["博丽灵梦"]["神灵庙"] = {
    "灵符「梦想封印」"
}
scZh["博丽灵梦"]["心绮楼"] = {
    "御札「神社繁盛祈愿札」",
    "御札「梦幻的高速祈愿札」",
    "御札「对妖怪方位清除」",
    "「信仰心增加祈愿之仪」",
    "「二大宗教九字护身法」",
    "「面灵气大降服」",
    "「最后的Trinity Religion」（最后的三位一体宗教）",
    "灵符「梦想封印」",
    "宝具「阴阳飞鸟井」",
    "神技「八方龙杀阵」",
    "「梦想天生」"
}
scZh["博丽灵梦"]["辉针城"] = {
    "妖器「无情的驱魔棒」",
    "灵符「梦想封印」"
}
scZh["博丽灵梦"]["天邪鬼"] = {
    "神签「犯规结界」",
    "「Persuasion Needle」（信仰之针）"
}
scZh["博丽灵梦"]["天邪鬼GR"] = {
    "「犯规结界」",
    "「最接近天堂的赛钱」",
    "「弹幕富翁」"
}
scZh["博丽灵梦"]["深秘录"] = {
    "灵符「梦想封印」",
    "神技「八方龙杀阵」",
    "宝具「阴阳飞鸟井」",
    "＊在那缝隙里面居然有个巫女！＊",
    "结界「人至之处的青山」",
    "针符「封印月卿之针」",
    "结界「粗暴的世界裂隙」",
    "结界「幻想Boundary Crack」（幻想结界缝隙）"
}
scZh["博丽灵梦"]["绀珠传"] = {
    "灵符「梦想封印」"
}
scZh["博丽灵梦"]["凭依华"] = {
    "灵符「梦想封印」",
    "神技「八方龙杀阵」",
    "宝具「阴阳飞鸟井」",
    "＊在那缝隙里面居然有个巫女！＊",
    "灵鹰符「飞鹰的梦想封印狩猎」",
    "风灵符「磐舟土器封印」",
    "星灵符「Sprinkle Star封印」（洒星封印）",
    "雷灵符「务光的雷弹梦想封印」",
    "龙蹴符「巨龙飞鸟井之踢」",
    "针星符「封印月卿之针火花」",
    "「这不知是第几次的生命，梦想封印吧」",
    "灵符「梦想封印　梦限」",
    "「完全凭依与梦想封印」",
    "「凭坐主役与神灵下仆的境界」",
    "「最强最棒的异变解决巫女」"
}
scZh["博丽灵梦"]["天空璋"] = {
    "灵符「梦想樱花封印」"
}
scZh["博丽灵梦"]["儚月抄"] = {
    "「大祸津日」"
}
scZh["博丽灵梦"]["东方LWC"] = {
    "梦符「幻想一重」"
}

scZh["雾雨魔理沙"] = {}
scZh["雾雨魔理沙"]["红魔乡"] = {
    "魔符「Stardust Reverie」（星尘幻想）",
    "恋符「Master Spark」（极限火花）"
}
scZh["雾雨魔理沙"]["妖妖梦"] = {
    "魔符「Stardust Reverie」（星尘幻想）",
    "魔符「Milky Way」（银河）",
    "恋符「Non-Directional Laser」（非定向光线）",
    "恋符「Master Spark」（极限火花）"
}
scZh["雾雨魔理沙"]["萃梦想"] = {
    "恋符「Master Spark」（极限火花）",
    "魔炮「Final Spark」（究极火花）",
    "魔符「Stardust Reverie」（星尘幻想）",
    "彗星「Blazing Star」（彗星）",
    "仪符「Orrery's Sun」（太阳仪）",
    "天仪「Orrery's Solar System」（太阳系仪）",
    "符之一「Stardust Reverie」（星尘幻想）",
    "符之二「Asteroid Belt」（小行星带）",
    "符之三「Master Spark」（极限火花）",
    "星符「Dragon Meteor」（龙陨石）"
}
scZh["雾雨魔理沙"]["永夜抄"] = {
    "恋符「Master Spark」（极限火花）",
    "魔炮「Final Spark」（究极火花）",
    "魔符「Milky Way」（银河）",
    "魔空「Asteroid Belt」（小行星带）",
    "魔符「Stardust Reverie」（星尘幻想）",
    "黑魔「Event Horizon」（黑洞边缘）",
    "恋符「Non-Directional Laser」（非定向光线）",
    "恋风「Starlight Typhoon」（星光台风）",
    "恋符「Master Spark」（极限火花）",
    "恋心「Double Spark」（二重火花）",
    "光符「Earth Light Ray」（地球光）",
    "光击「Shoot the Moon」（射月）",
    "魔炮「Final Spark」（究极火花）",
    "魔炮「Final Master Spark」（超究极火花）",
    "「Blazing Star」（彗星）"
}
scZh["雾雨魔理沙"]["花映塚"] = {
    "魔符「Stardust」（星尘）",
    "魔符「Stardust Reverie」（星尘幻想）",
    "魔符「Illusion Star」（幻想之星）"
}
scZh["雾雨魔理沙"]["绯想天"] = {
    "星符「Polaris Unique」（唯一的北极星）",
    "天仪「Orrery's Universe」（银河系仪）",
    "邪恋「容易结果的Master Spark」（容易结果的极限火花）",
    "恋符「Master Spark」（极限火花）",
    "星符「Dragon Meteor」（龙星群）",
    "魔符「Stardust Reverie」（星尘幻想）",
    "魔炮「Final Spark」（究极火花）",
    "彗星「Blazing Star」（彗星）",
    "星符「Escape Velocity」（第二宇宙速度）",
    "星符「Meteonic Shower」（流星雨）",
    "光符「Luminous Strike」（声光冲击）",
    "仪符「Orrery's Sun」（太阳仪）",
    "邪恋「容易结果的Master Spark」（容易结果的极限火花）"
}
scZh["雾雨魔理沙"]["地灵殿"] = {
    "「Remote Sacrifice」（遥控的牺牲）",
    "「Five Season」（五个季节）",
    "「Optical Camouflage」（光学迷彩）"
}
scZh["雾雨魔理沙"]["星莲船"] = {
    "恋符「Master Spark」（极限火花）",
    "魔符「Ultimate Shortwave」（终极短波）"
}
scZh["雾雨魔理沙"]["非想天则"] = {
    "星符「Eccentric Asteroid」（离心的小行星）",
    "流光「Shooting Echo」（射击回声）",
    "魔符「Magical R360」（魔法全方位）",
    "星符「Gravity Beat」（重力之击）",
    "光符「Earth Light Ray」（地球光）",
    "恋符「Non-Directional Laser」（非定向光线）",
    "魔废「Deep Ecological Bomb」（深层生态炸弹）"
}
scZh["雾雨魔理沙"]["文花帖DS"] = {
    "星符「Oort Cloud」（奥尔特云）",
    "天仪「Orrery's Solar System」（太阳系仪）",
    "彗星「Blazing Star」（彗星）"
}
scZh["雾雨魔理沙"]["大战争"] = {
    "光符「Mysterious Beam」（神秘光束）",
    "光击「Shoot the Little Moon」（射向幼月）",
    "魔弹「Test Slave」（试验用使魔）",
    "闭符「Big Crunch」（大坍缩）",
    "恋符「Master Spark一般的手电筒」（极限火花一般的手电筒）",
    "魔开「Open Universe」（开放宇宙）",
    "魔十字「Grand Cross」（大十字）",
    "流星「Super Perseids」（超级英仙座）",
    "「Blazing Star一般的捉迷藏」（彗星一般的捉迷藏）",
    "「妖精尽灭光」"
}
scZh["雾雨魔理沙"]["神灵庙"] = {
    "恋符「Master Spark」（极限火花）"
}
scZh["雾雨魔理沙"]["心绮楼"] = {
    "恋符「Master Spark」（极限火花）",
    "彗星「Blazing Star」（彗星）",
    "星符「Satellite Illusion」（卫星幻觉）",
    "「Sungrazer」（掠日彗星）",
    "星符「Millisecond Pulsar」（毫秒脉冲星）",
    "魔符「Blaze Away」（连续射击）"
}
scZh["雾雨魔理沙"]["辉针城"] = {
    "妖器「Dark Spark」（黑暗火花）",
    "Magic Absorber（魔法吸收器）"
}
scZh["雾雨魔理沙"]["天邪鬼"] = {
    "恋符「Wide Master」（广域极限火花）",
    "恋符「Machine Gun Spark」（机枪火花）"
}
scZh["雾雨魔理沙"]["深秘录"] = {
    "恋符「Master Spark」（极限火花）",
    "彗星「Blazing Star」（彗星）",
    "星符「Satellite Illusion」（卫星幻觉）",
    "＊真棒！厕所里的花子小姐＊",
    "星符「Occultation」（掩星）",
    "＊被诅咒的历代校长的肖像＊",
    "＊夜间学校怪谈云游＊"
}
scZh["雾雨魔理沙"]["绀珠传"] = {
    "恋符「Master Spark」"
}
scZh["雾雨魔理沙"]["凭依华"] = {
    "恋符「Master Spark」（极限火花）",
    "彗星「Blazing Star」（彗星）",
    "星符「Satellite Illusion」（卫星幻觉）",
    "＊真棒！厕所里的花子小姐＊",
    "星恋符「Sprinkle Star & Heart」（星星心心洒）",
    "拳星符「入道丛云Slave Spark」（入道丛云下仆火花）",
    "星灵符「Sprinkle Star封印」（洒星封印）",
    "针星符「封印月卿之针火花」",
    "星符「Asteroid Belt Nightmare」（小行星带恶梦）"
}
scZh["雾雨魔理沙"]["天空璋"] = {
    "恋符「Master Spark Frozen」"
}
scZh["雾雨魔理沙"]["儚月抄"] = {
    "「Stardust Reverie」（星尘幻想）",
    "「Event Horizon」（黑洞边缘）",
    "「Final Spark」（究极火花）",
    "「Double Spark」（二重火花）"
}

scZh["露米娅"] = {}
scZh["露米娅"]["红魔乡"] = {
    "月符「Moonlight Ray」（月光）",
    "夜符「Night Bird」（夜雀）",
    "暗符「Demarcation」（境界线）"
}
scZh["露米娅"]["文花帖"] = {
    "暗符「Dark Side of the Moon」（月的阴暗面）",
    "夜符「Midnight Bird」（子夜之鸟）"
}

scZh["琪露诺"] = {}
scZh["琪露诺"]["红魔乡"] = {
    "冰符「Icicle Fall」（冰瀑）",
    "雹符「Hailstorm」（冰雹暴风）",
    "冻符「Perfect Freeze」（完美冻结）",
    "雪符「Diamond Blizzard」（钻石风暴）"
}
scZh["琪露诺"]["妖妖梦"] = {
    "冻符「Freeze Actress」‎",
    "霜符「Frost Columns」（冰袭方阵）"
}
scZh["琪露诺"]["花映塚"] = {
    "冻符「Perfect Freeze」（完美冻结）",
    "冻符「Cold Divinity」（冷冻之神）"
}
scZh["琪露诺"]["文花帖"] = {
    "雪符「Diamond Blizzard」（钻石风暴）",
    "冻符「Minus K」（负K）"
}
scZh["琪露诺"]["非想天则"] = {
    "冰符「Icicle Fall」（冰瀑）",
    "冻符「Minus K」（负K）",
    "冰符「Icicle Machine Gun」（冰柱机枪）",
    "冰符「Fairy Spin」（妖精旋转）",
    "冰块「Cold Sprinkler」（冷冻洒水器）",
    "冷体「Super Ice Kick」（超级回旋冰踢）",
    "冰符「Sword Freezer」（剑式制冰器）",
    "冻符「Freeze Atmosphere」（急冻大气）",
    "冷符「瞬间冷冻Beam」（瞬间冷冻光线）",
    "霜符「Frost Columns」（冰袭方阵）",
    "吹冰「Ice Tornado」（碎冰龙卷）",
    "冻符「Perfect Freeze」（完美冻结）",
    "冰块「Great Crusher」（巨冰破碎）"
}
scZh["琪露诺"]["大战争"] = {
    "Perfect Freeze（完美冻结）"
}
scZh["琪露诺"]["辉针城"] = {
    "冰符「Ultimate Blizzard」（终极暴风雪）"
}
scZh["琪露诺"]["天邪鬼"] = {
    "冰符「Perfect Glacialist」（完美冰川家）",
    "冰王「Frost King」（霜冻之王）"
}
scZh["琪露诺"]["天空璋"] = {
    "冰符「Cool Sunflower」（凉爽的向日葵）"
}

scZh["红美铃"] = {}
scZh["红美铃"]["红魔乡"] = {
    "华符「芳华绚烂」",
    "华符「Selaginella 9」（卷柏 9）",
    "虹符「彩虹的风铃」",
    "幻符「华想梦葛」",
    "彩符「彩雨」",
    "彩符「彩光乱舞」",
    "彩符「极彩台风」"
}
scZh["红美铃"]["萃梦想"] = {
    "彩符「彩光风铃」",
    "光符「华光玉」",
    "华符「破山炮」",
    "极彩「彩光乱舞」",
    "极光「华严明星」",
    "三华「崩山彩极炮」"
}
scZh["红美铃"]["文花帖"] = {
    "华符「彩光莲华掌」",
    "彩翔「飞花落叶」",
    "彩华「虹色太极拳」"
}
scZh["红美铃"]["非想天则"] = {
    "彩符「极彩沛雨」",
    "彩翔「飞花落叶」",
    "彩符「彩光风铃」",
    "虹符「烈虹真拳」",
    "气符「星脉弹」",
    "击符「大鹏拳」",
    "气符「地龙天龙脚」",
    "极彩「彩光乱舞」",
    "彩华「虹色太极拳」",
    "气符「猛虎内劲」",
    "星气「星脉地转弹」",
    "炽击「大鹏坠击拳」",
    "华符「彩光莲华掌」"
}

scZh["帕秋莉"] = {}
scZh["帕秋莉"]["萃梦想"] = {
    "火金符「St. Elmo Pillar」（圣爱尔摩火柱）",
    "土水符「Noachian Deluge」（诺亚的大洪水）",
    "金木符「Elemental Harvester」（元素收获者）",
    "日符「Royal Flare」（皇家圣焰）",
    "月符「Silent Selene」（沉静的月神）",
    "火水木金土符「贤者之石」",
    "符之一「St. Elmo Explosion」（圣爱尔摩爆炸）",
    "符之二「Deluge Forty Day」（大洪水四十日）",
    "金土符「Ginger Gust」（淡黄色的阵风）"
}
scZh["帕秋莉"]["文花帖"] = {
    "日&水符「Hydrogenous Prominence」（氢化日珥）",
    "水&火符「Phlogistic Rain」（燃素之雨）",
    "月&木符「Satellite Himawari」（卫星向日葵）",
    "日&月符「Royal Diamond Ring」（皇家钻戒）"
}
scZh["帕秋莉"]["绯想天"] = {
    "火金符「St. Elmo Pillar」（圣爱尔摩火柱）",
    "土水符「Noachian Deluge」（诺亚的大洪水）",
    "金木符「Elemental Harvester」（元素收获者）",
    "日符「Royal Flare」（皇家圣焰）",
    "月符「Silent Selene」（沉静的月神）",
    "火水木金土符「贤者之石」",
    "水符「Jellyfish Princess」（水母公主）",
    "月木符「Satellite Himawari」（卫星向日葵）",
    "日木符「Photosynthesis」（光合作用）",
    "火符「Akiba Summer」（秋叶之夏）",
    "水符「Jellyfish Princess」（水母公主）",
    "月金符「Sunshine Reflector」（日光反射器）"
}
scZh["帕秋莉"]["非想天则"] = {
    "火水符「Phlogistic Pillar」（燃素之柱）",
    "土金符「Emerald Megalopolis」（翡翠巨城）",
    "日月符「Royal Diamond Ring」（皇家钻戒）",
    "火符「Ring of Agni」（火天神印）",
    "水符「Princess Undine」（水精公主）"
}

scZh["十六夜咲夜"] = {}
scZh["十六夜咲夜"]["红魔乡"] = {
    "奇术「Misdirection」（误导）",
    "奇术「幻惑Misdirection」（幻惑误导）",
    "幻在「Clock Corpse」（钟表的残骸）",
    "幻幽「Jack the Ludo Bile」（迷幻的杰克）",
    "幻象「Luna Clock」（月神之钟）",
    "幻世「The World」（世界）",
    "Maid秘技「操弄Doll」（女仆秘技「操弄玩偶」）",
    "Maid秘技「杀人Doll」（女仆秘技「杀人玩偶」）",
    "奇术「Eternal Meek」（永恒的温柔）"
}
scZh["十六夜咲夜"]["妖妖梦"] = {
    "幻符「Indiscriminate」（无差别伤害）",
    "幻符「杀人Doll」（杀人玩偶）",
    "时符「Perfect Square」（完美空间）",
    "时符「Private Square」（个人空间）"
}
scZh["十六夜咲夜"]["萃梦想"] = {
    "幻符「杀人Doll」（杀人玩偶）",
    "幻葬「夜雾幻影杀人鬼」",
    "时符「Private Square」（个人空间）",
    "「咲夜的世界」",
    "伤符「Inscribe Red Soul」（铭刻于红魂）",
    "伤魂「Soul Sculpture」（灵魂雕塑）",
    "符之一「连续杀人Doll」（连续杀人玩偶）",
    "符之二「Check-Maid」（扫除）",
    "魔术「Close-up杀人鬼」（极近距离杀人鬼）"
}
scZh["十六夜咲夜"]["永夜抄"] = {
    "幻符「杀人Doll」（杀人玩偶）",
    "幻葬「夜雾幻影杀人鬼」",
    "「Deflation World」（收缩的世界）"
}
scZh["十六夜咲夜"]["花映塚"] = {
    "时符「Private Vision」（个人幻影）",
    "时符「Mysterious Jack」（神秘的杰克）"
}
scZh["十六夜咲夜"]["文花帖"] = {
    "时符「Tunnel Effect」（穿隧效应）",
    "空虚「Inflation Square」（膨胀空间）",
    "银符「Perfect Maid」（完美女仆）"
}
scZh["十六夜咲夜"]["绯想天"] = {
    "幻符「杀人Doll」（杀人玩偶）",
    "时符「Private Square」（个人空间）",
    "伤符「Inscribe Red Soul」（铭刻于红魂）",
    "幻葬「夜雾幻影杀人鬼」",
    "「咲夜的世界」",
    "伤魂「Soul Sculpture」（灵魂雕塑）",
    "银符「Silver Bound」（银之跳跃）",
    "奇术「Eternal Meek」（永恒的温柔）",
    "速符「Luminous Ricochet」（闪光弹跳）",
    "时符「咲夜特制Stopwatch」（咲夜特制秒表）",
    "银符「Silver Bound」（银之跳跃）",
    "时符「咲夜特制Stopwatch」（咲夜特制秒表）",
    "幻术「My Knife Recursion」（吾刃回归）",
    "时符「Silver Acute 360」（银之锐角360度）"
}
scZh["十六夜咲夜"]["非想天则"] = {
    "时符「Imaginary Vertical Time」（假想时轴）",
    "时计「Luna Dial」（月时计）",
    "光速「C. Ricochet」（光速跃迁）"
}
scZh["十六夜咲夜"]["辉针城"] = {
    "妖器「银色的Another Dimension」（银色异次元）",
    "时符「Dual Vanish」（双重消失）"
}
scZh["十六夜咲夜"]["天邪鬼"] = {
    "时符「时停者咲夜」",
    "时符「Changeling Magic」（调换魔法）"
}
scZh["十六夜咲夜"]["儚月抄"] = {
    "「Luminous Ricochet」（闪光弹跳）",
    "「我的世界」"
}

scZh["蕾米莉亚"] = {}
scZh["蕾米莉亚"]["红魔乡"] = {
    "天罚「Star of David」（大卫之星）",
    "神罚「年幼的Demon Lord」（年幼的恶魔之王）",
    "冥符「红色的冥界」",
    "狱符「千根针的针山」",
    "诅咒「Vlad Tepes的诅咒」（弗拉德·特佩斯的诅咒）",
    "神术「吸血鬼幻想」",
    "红符「Scarlet Shoot」（绯红之击）",
    "红符「Scarlet Meister」（绯红之主）",
    "「Red Magic」（红魔法）",
    "「红色的幻想乡」"
}
scZh["蕾米莉亚"]["萃梦想"] = {
    "红符「不夜城Red」（红色不夜城）",
    "红魔「Scarlet Devil」（绯红色的恶魔）",
    "必杀「Heart Break」（碎心）",
    "神枪「Spear the Gungnir」（冈格尼尔之枪）",
    "夜符「Demon King Cradle」（恶魔之王的摇篮）",
    "夜王「Dracula Cradle」（德古拉的摇篮）",
    "符之一「Bad Lady Scramble」（恶女置乱）",
    "符之二「My Heart Break」（我心破碎）",
    "符之三「Hell Catastrophe」（地狱的大灾难）",
    "夜符「Queen of Midnight」（子夜之女王）",
    "「Red Magic」（红魔法）"
}
scZh["蕾米莉亚"]["永夜抄"] = {
    "红符「不夜城Red」（红色不夜城）",
    "红魔「Scarlet Devil」（绯红色的恶魔）",
    "「Scarlet Destiny」（绯色命运）"
}
scZh["蕾米莉亚"]["文花帖"] = {
    "魔符「全世界Nightmare」（全世界梦魇）",
    "红符「Bloody Magic Square」（嗜血魔方阵）",
    "红蝙蝠「Vampirish Night」（吸血鬼之夜）",
    "神鬼「Remilia Stalker」（蕾米莉亚潜行者）"
}
scZh["蕾米莉亚"]["绯想天"] = {
    "红符「不夜城Red」（红色不夜城）",
    "必杀「Heart Break」（碎心）",
    "夜符「Demon King Cradle」（恶魔之王的摇篮）",
    "红魔「Scarlet Devil」（绯红色的恶魔）",
    "神枪「Spear the Gungnir」（冈格尼尔之枪）",
    "夜王「Dracula Cradle」（德古拉的摇篮）",
    "夜符「Bad Lady Scramble」（恶女置乱）",
    "命运「Miserable Fate」（悲惨的命运）",
    "命运「Miserable Fate」（悲惨的命运）",
    "夜符「Bombard Night」（轰炸之夜）",
    "蝙蝠「Vampire Sweep」（吸血鬼突袭）",
    "神鬼「Remilia Stalker」（蕾米莉亚潜行者）"
}
scZh["蕾米莉亚"]["非想天则"] = {
    "恶魔「Remilia Stretch」（蕾米莉亚伸展）",
    "「Millennium吸血鬼」（千年吸血鬼）"
}
scZh["蕾米莉亚"]["天邪鬼"] = {
    "「Fitful Nightmare」（断续的噩梦）",
    "「捉吸血鬼游戏」"
}
scZh["蕾米莉亚"]["儚月抄"] = {
    "「Queen of Midnight」（子夜之女王）"
}

scZh["芙兰朵露"] = {}
scZh["芙兰朵露"]["红魔乡"] = {
    "禁忌「Cranberry Trap」（红莓陷阱）",
    "禁忌「Laevatein」（莱瓦汀）",
    "禁忌「Four of a Kind」（四重存在）",
    "禁忌「Kagome Kagome」（笼中鸟）",
    "禁忌「恋之迷宫」",
    "禁弹「Starbow Break」（星弧破碎）",
    "禁弹「Catadioptric」（折反射）",
    "禁弹「刻着过去的钟表」",
    "秘弹「之后就一个人都没有了吗？」",
    "QED「495年的波纹」"
}
scZh["芙兰朵露"]["文花帖"] = {
    "禁忌「Forbidden Fruits」（禁果）",
    "禁忌「被禁止的游戏」"
}

scZh["蕾蒂"] = {}
scZh["蕾蒂"]["妖妖梦"] = {
    "寒符「Lingering Cold」（延长的冬日）",
    "冬符「Flower Wither Away」（花之凋零）",
    "白符「Undulation Ray」（波状光）",
    "怪符「Table Turning」（桌灵转）"
}
scZh["蕾蒂"]["文花帖"] = {
    "寒符「Cold Snap」（寒流）",
    "冬符「Northern Winner」（北极的胜利者）"
}

scZh["橙"] = {}
scZh["橙"]["妖妖梦"] = {
    "仙符「凤凰卵」",
    "仙符「凤凰展翅」",
    "式符「飞翔晴明」",
    "阴阳「道满晴明」",
    "阴阳「晴明大纹」",
    "天符「天仙鸣动」",
    "翔符「飞翔韦驮天」",
    "童符「护法天童乱舞」",
    "仙符「尸解永远」",
    "鬼符「鬼门金神」",
    "方符「奇门遁甲」",
    "鬼符「青鬼赤鬼」",
    "鬼神「飞翔毘沙门天」"
}
scZh["橙"]["文花帖"] = {
    "星符「交错的鳞片」",
    "鬼神「鸣动持国天」",
    "怪猫「橙」"
}

scZh["爱丽丝"] = {}
scZh["爱丽丝"]["妖妖梦"] = {
    "操符「少女文乐」",
    "苍符「博爱的法兰西人偶」",
    "苍符「博爱的Orléans人偶」（博爱的奥尔良人偶）",
    "红符「红发的荷兰人偶」",
    "白符「白垩的俄罗斯人偶」",
    "暗符「雾之伦敦人偶」",
    "回符「轮回的西藏人偶」",
    "雅符「春之京都人偶」",
    "诅咒「魔彩光的上海人偶」",
    "诅咒「上吊的蓬莱人偶」"
}
scZh["爱丽丝"]["萃梦想"] = {
    "魔符「Artful Sacrifice」（狡猾的献祭）",
    "魔操「Return Inanimateness」（回归虚无）",
    "战符「Little Legion」（小小军势）",
    "战操「Doll's War」（玩偶战争）",
    "咒符「上海人偶」",
    "诅咒「蓬莱人偶」",
    "符之一「Artful Chanter」（狡猾的吟颂者）",
    "符之二「Doll Crusader」（玩偶十字军）",
    "魔光「Devilry Light Ray」（惨虐之光）"
}
scZh["爱丽丝"]["永夜抄"] = {
    "魔符「Artful Sacrifice」（狡猾的献祭）",
    "魔操「Return Inanimateness」（回归虚无）",
    "「Grand-Guignol戏院的怪人」（猎奇剧团里的怪人）"
}
scZh["爱丽丝"]["文花帖"] = {
    "操符「Dolls in Sea」（海中的人偶）",
    "咒符「Straw Doll Kamikaze」（稻草人偶神风）",
    "赤符「Doll Mira Ceti」（人偶鲸鱼座）"
}
scZh["爱丽丝"]["绯想天"] = {
    "魔符「Artful Sacrifice」（狡猾的献祭）",
    "战符「Little Legion」（小小军势）",
    "咒符「上海人偶」",
    "魔操「Return Inanimateness」（回归虚无）",
    "战操「Doll's War」（玩偶战争）",
    "诅咒「蓬莱人偶」",
    "侦符「Seeker Dolls」（探索人偶）",
    "红符「荷兰人偶」",
    "人偶「未来文乐」",
    "聚焦「Trip Wire」（陷阱网）",
    "步兵「Suicide Squad」（敢死小分队）",
    "剑符「Soldier of Cross」（交错的士兵）",
    "人偶「没有灵魂的Folk dance」（没有灵魂的集体舞）"
}
scZh["爱丽丝"]["非想天则"] = {
    "枪符「Cutie大千枪」（萌萌大千枪）",
    "人偶「Lemmings' Parade」（旅鼠的盛装游行）",
    "人偶「Semi-Automaton」（半自主人偶）",
    "骑士「Doll of Round Table」（圆桌人偶）",
    "牺牲「Suicide Pact」（自杀协议）",
    "试验中「Level Titania」（提泰妮娅级）",
    "试验中「Goliath人偶」（歌利亚人偶）"
}

scZh["骚灵三姐妹"] = {}
scZh["骚灵三姐妹"]["妖妖梦"] = {
    "骚符「Phantom Dinning」（幽灵絮语）",
    "骚符「Live Poltergeist」（活着的骚灵）",
    "合葬「Prism Concerto」（棱镜协奏曲）",
    "骚葬「Stygian Riverside」（冥河边缘）",
    "大合葬「灵车Concerto Grosso」（灵车大协奏曲）",
    "大合葬「灵车Concerto Grosso改」（灵车大协奏曲改）",
    "大合葬「灵车Concerto Grosso怪」（灵车大协奏曲怪）"
}

scZh["露娜萨"] = {}
scZh["露娜萨"]["妖妖梦"] = {
    "弦奏「Guarneri del Gesù」（瓜尔内里·德尔·杰苏）",
    "神弦「Stradivarius」（斯特拉迪瓦里）",
    "伪弦「Pseudo Stradivarius」（伪斯特拉迪瓦里）"
}
scZh["露娜萨"]["花映塚"] = {
    "骚符「Noise Melancholy」（吵闹的忧郁）",
    "骚符「Lunasa Solo Live」（露娜萨独奏直播）"
}

scZh["梅露兰"]= {}
scZh["梅露兰"]["妖妖梦"] = {
    "管灵「Hino Phantasm」（日野幻想）",
    "冥管「Ghost Clifford」（灵之克里福德）",
    "管灵「Ghost Clifford」（灵之克里福德）"
}
scZh["梅露兰"]["花映塚"] = {
    "骚符「Soul-Go-Happy」（乐观的灵魂）",
    "骚符「Merlin Happy Live」（梅露兰快乐直播）"
}

scZh["莉莉卡"] = {}
scZh["莉莉卡"]["妖妖梦"] = {
    "冥键「Fazioli冥奏」（法吉奥里冥奏）",
    "键灵「Bösendorfer神奏」（蓓森朵芙神奏）"
}
scZh["莉莉卡"]["花映塚"] = {
    "骚符「Soul Noise Flow」（灵魂噪音流）",
    "骚符「Lyrica Solo Live」（莉莉卡独奏直播）"
}

scZh["魂魄妖梦"] = {}
scZh["魂魄妖梦"]["妖妖梦"] = {
    "幽鬼剑「妖童饿鬼之断食」",
    "饿鬼剑「饿鬼道草纸」",
    "饿王剑「饿鬼十王的报应」",
    "狱界剑「二百由旬之一闪」",
    "狱炎剑「业风闪影阵」",
    "狱神剑「业风神闪斩」",
    "畜趣剑「无为无策之冥罚」",
    "修罗剑「现世妄执」",
    "人界剑「悟入幻想」",
    "人世剑「大悟显晦」",
    "人神剑「俗谛常住」",
    "天上剑「天人之五衰」",
    "天界剑「七魄忌讳」",
    "天神剑「三魂七魄」",
    "六道剑「一念无量劫」"
}
scZh["魂魄妖梦"]["萃梦想"] = {
    "人符「现世斩」",
    "人鬼「未来永劫斩」",
    "断命剑「冥想斩」",
    "断迷剑「迷津慈航斩」",
    "魂符「幽明的苦轮」",
    "魂魄「幽明求闻持聪明之法」",
    "符之一「二重的苦轮」",
    "符之二「心眼迷想斩」",
    "符之三「业风神闪斩」",
    "奥义「西行春风斩」"
}
scZh["魂魄妖梦"]["永夜抄"] = {
    "人符「现世斩」",
    "人鬼「未来永劫斩」",
    "「待宵反射卫星斩」"
}
scZh["魂魄妖梦"]["花映塚"] = {
    "迷符「缠缚剑」",
    "迷符「半身大悟」"
}
scZh["魂魄妖梦"]["文花帖"] = {
    "人智剑「天女返」",
    "妄执剑「修罗之血」",
    "天星剑「仿若涅槃寂静」",
    "四生剑「众生无情之声」"
}
scZh["魂魄妖梦"]["绯想天"] = {
    "人智剑「天女返」",
    "樱花剑「闪闪散华」",
    "断想剑「草木成佛斩」",
    "瞑斩「楼观赋予我能斩断弹幕的心之眼」",
    "人符「现世斩」",
    "断命剑「冥想斩」",
    "魂符「幽明的苦轮」",
    "人鬼「未来永劫斩」",
    "断迷剑「迷津慈航斩」",
    "魂魄「幽明求闻持聪明之法」",
    "剑伎「樱花闪闪」",
    "断灵剑「成佛得脱斩」"
}
scZh["魂魄妖梦"]["非想天则"] = {
    "空观剑「六根清净斩」",
    "转生剑「圆心流转斩」"
}
scZh["魂魄妖梦"]["神灵庙"] = {
    "空观剑「六根清净斩」"
}
scZh["魂魄妖梦"]["弹幕天邪鬼"] = {
    "光符「冥府光芒一闪」",
    "彼岸剑「地狱极乐胡乱斩」"
}

scZh["西行寺幽幽子"] = {}
scZh["西行寺幽幽子"]["妖妖梦"] = {
    "亡乡「亡我乡 -彷徨的灵魂-」",
    "亡乡「亡我乡 -宿罪-」",
    "亡乡「亡我乡 -无道之路-」",
    "亡乡「亡我乡 -自尽-」",
    "亡舞「生者必灭之理 -眩惑-」",
    "亡舞「生者必灭之理 -死蝶-」",
    "亡舞「生者必灭之理 -毒蛾-」",
    "亡舞「生者必灭之理 -魔境-」",
    "华灵「Ghost Butterfly」（亡灵蝶）",
    "华灵「Swallowtail Butterfly」（扬羽蝶）",
    "华灵「Deep-Rooted Butterfly」（执念蝶）",
    "华灵「Butterfly Delusion」（蝶妄想）",
    "幽曲「Repository of Hirokawa -伪灵-」（埋骨于弘川 -伪灵-）",
    "幽曲「Repository of Hirokawa -亡灵-」（埋骨于弘川 -亡灵-）",
    "幽曲「Repository of Hirokawa -幻灵-」（埋骨于弘川 -幻灵-）",
    "幽曲「Repository of Hirokawa -神灵-」（埋骨于弘川 -神灵-）",
    "樱符「完全墨染的樱花 -封印-」",
    "樱符「完全墨染的樱花 -亡我-」",
    "樱符「完全墨染的樱花 -春眠-」",
    "樱符「完全墨染的樱花 -开花-」",
    "「反魂蝶 -一分咲-」",
    "「反魂蝶 -三分咲-」",
    "「反魂蝶 -五分咲-」",
    "「反魂蝶 -八分咲-」"
}
scZh["西行寺幽幽子"]["萃梦想"] = {
    "死符「Ghastly Dream」（惊梦）",
    "死蝶「华胥的永眠」",
    "冥符「黄泉平坂行路」",
    "再迷「幻想乡的黄泉归」",
    "灵符「无寿之梦」",
    "寿命「通向无寿国的期票」",
    "符之一「幽梦的蝴蝶」",
    "符之二「白玉楼的枝垂樱」",
    "符之三「遥远过去的死地」",
    "樱花「依恋未酌宴」",
    "「紫色彼岸樱推迟绽放」"
}
scZh["西行寺幽幽子"]["永夜抄"] = {
    "死符「Ghastly Dream」（惊梦）",
    "死蝶「华胥的永眠」",
    "「西行寺无余涅槃」"
}
scZh["西行寺幽幽子"]["文花帖"] = {
    "幽雅「通向黄泉的诱蛾灯」",
    "蝶符「凤蝶纹的死枪」",
    "死符「醉人之生，死的梦幻」",
    "「死蝶浮月」"
}
scZh["西行寺幽幽子"]["绯想天"] = {
    "死符「Ghastly Dream」（惊梦）",
    "冥符「黄泉平坂行路」",
    "灵符「无寿之梦」",
    "死蝶「华胥的永眠」",
    "再迷「幻想乡的黄泉归」",
    "寿命「通向无寿国的期票」",
    "灵蝶「蝶之羽风暂留此世」",
    "蝶符「凤蝶纹的死枪」",
    "幽雅「通向黄泉的诱蛾灯」",
    "幽符「冥界Mystery Spot」（冥界灵异点）",
    "灵蝶「蝶之羽风暂留此世」",
    "宴会「死后一切大团圆」"
}
scZh["西行寺幽幽子"]["非想天则"] = {
    "「反魂蝶」",
    "樱符「Sense of Cherry Blossom」（樱之意志）"
}
scZh["西行寺幽幽子"]["神灵庙"] = {
    "符牒「死蝶之舞」",
    "符牒「死蝶之舞　- 樱花 -」",
    "幽蝶「Ghost Spot」（幽魂聚地）",
    "幽蝶「Ghost Spot　- 樱花 -」（幽魂聚地　- 樱花 -）",
    "冥符「常夜樱」",
    "樱符「西行樱吹雪」",
    "樱符「樱吹雪地狱」"
}
scZh["西行寺幽幽子"]["弹幕天邪鬼"] = {
    "蝶符「花蝶风月」",
    "樱花「樱吹雪花小町」"
}

scZh["八云蓝"] = {}
scZh["八云蓝"]["妖妖梦"] = {
    "式神「仙狐思念」",
    "式神「十二神将之宴」",
    "式辉「狐狸妖怪laser」（狐狸妖怪激光）",
    "式辉「四面楚歌Charming」（迷人的四面楚歌）",
    "式辉「Princess天狐 -Illusion-」（天狐公主 -Illusion-）",
    "式弹「Ultimate Buddhist」（最后的佛徒）",
    "式弹「Unilateral Contact」（片面接触）",
    "式神「橙」",
    "「狐狗狸先生的契约」",
    "幻神「饭纲权现降临」",
    "式神「前鬼后鬼的守护」",
    "式神「凭依荼吉尼天」"
}
scZh["八云蓝"]["文花帖"] = {
    "密符「大师的密传」",
    "行符「八千万块护摩」",
    "超人「飞翔役小角」"
}

scZh["八云紫"] = {}
scZh["八云紫"]["妖妖梦"] = {
    "结界「梦境与现实的诅咒」",
    "结界「动与静的均衡」",
    "结界「光明与黑暗的网目」",
    "罔两「Straight与Curve的梦乡」（直球与曲球的梦乡）",
    "罔两「八云紫的神隐」",
    "罔两「栖息于禅寺的妖蝶」",
    "魍魉「二重黑死蝶」",
    "式神「八云蓝」",
    "「人类与妖怪的境界」",
    "结界「生与死的境界」",
    "紫奥义「弹幕结界」"
}
scZh["八云紫"]["萃梦想"] = {
    "境符「四重结界」",
    "结界「充满魅力的四重结界」",
    "式神「八云蓝」",
    "式神「八云蓝+」",
    "境符「二次元与三次元的境界」",
    "结界「客观结界」",
    "符之一「四重结界」",
    "符之二「八云卍伞」",
    "符之三「八云蓝」",
    "外力「无限的超高速飞行体」",
    "幻想「第一类永动机」"
}
scZh["八云紫"]["永夜抄"] = {
    "境符「四重结界」",
    "境界「永夜四重结界」",
    "「深弹幕结界 -梦幻泡影-」"
}
scZh["八云紫"]["文花帖"] = {
    "境符「色与空的境界」",
    "境符「波与粒的境界」"
}
scZh["八云紫"]["绯想天"] = {
    "境符「四重结界」",
    "式神「八云蓝」",
    "境符「二次元与三次元的境界」",
    "结界「充满魅力的四重结界」",
    "式神「橙」",
    "结界「客观结界」",
    "幻巢「飞光虫Nest」（飞光虫之巢）",
    "空饵「具有中毒性的Isca」（具有中毒性的诱饵）",
    "废线「废弃车站下车之旅」",
    "光弹「Doppler Effect」（多普勒效应）",
    "捌器「将一切分成两个的东西」",
    "幻巢「飞光虫Nest」（飞光虫之巢）",
    "空饵「狂躁高速飞行物体」",
    "「八云之巢」"
}
scZh["八云紫"]["非想天则"] = {
    "魔眼「Laplace之魔」（拉普拉斯之魔）"
}
scZh["八云紫"]["天邪鬼"] = {
    "「不可能弹幕结界」",
    "「运钝根的捕物帐」"
}
scZh["八云紫"]["凭依华"] = {
    "「无人废线车辆炸弹」",
    "式神「八云蓝&橙」",
    "境界「溢出的漂流物」",
    "＊把你美丽的脚拿来！＊",
    "「凭坐主役的忧郁」",
    "「完全凭依与梦想封印」",
    "「凭坐主役与神灵下仆的境界」",
    "贫符「Mischance Scatter」（厄运播撒）",
    "「最凶最恶的极贫不幸神」"
}

scZh["伊吹萃香"] = {}
scZh["伊吹萃香"]["萃梦想"] = {
    "萃符「户隐山之投」",
    "萃鬼「天手力男之投」",
    "醉神「鬼缚之术」",
    "醉梦「施饿鬼缚之术」",
    "鬼符「Missing Power」（遗失的力量）",
    "鬼神「Missing Purple Power」（遗失的高贵之力）",
    "符之一「投掷的天岩户」",
    "符之二「坤轴的大鬼」",
    "符之三「追傩返Black hole」（追傩返黑洞）",
    "鬼火「超高密度磷祸术」",
    "疎符「六里雾中」",
    "「百万鬼夜行」"
}
scZh["伊吹萃香"]["文花帖"] = {
    "鬼气「蒙蒙迷雾」",
    "「百万鬼夜行」"
}
scZh["伊吹萃香"]["绯想天"] = {
    "萃符「户隐山之投」",
    "醉神「鬼缚之术」",
    "鬼符「Missing Power」（遗失的力量）",
    "萃鬼「天手力男之投」",
    "醉梦「施饿鬼缚之术」",
    "鬼神「Missing Purple Power」（遗失的高贵之力）",
    "雾符「云集雾散」",
    "鬼火「超高密度磷祸术」",
    "鬼符「大江山悉皆杀」",
    "吐息「小鬼的深呼吸」",
    "火弹「地灵活性弹」",
    "鬼神「Missing Purple Power」（遗失的高贵之力）",
    "鬼气「蒙蒙迷雾」",
    "「百万同一鬼」"
}
scZh["伊吹萃香"]["非想天则"] = {
    "四天王奥义「三步坏废」"
}
scZh["伊吹萃香"]["文花帖DS"] = {
    "鬼符「豆粒大的针地狱」",
    "地狱「炼狱气息」",
    "鬼符「Missing Power」（遗失的力量）"
}
scZh["伊吹萃香"]["天邪鬼"] = {
    "鬼群「Imp swarm」（小鬼成群）",
    "鬼群「百鬼秃童」"
}

scZh["莉格露"] = {}
scZh["莉格露"]["永夜抄"] = {
    "萤符「地上的流星」",
    "萤符「地上的彗星」",
    "灯符「Firefly Phenomemon」（萤光现象）",
    "蠢符「Little Bug」（小虫）",
    "蠢符「Little Bug Storm」（小虫风暴）",
    "蠢符「Night Bug Storm」（夜虫风暴）",
    "蠢符「Night Bug Tornado」（夜虫龙卷）",
    "隐虫「永夜蛰居」",
    "「季节外的Butterfly Storm」（不合时令的蝶雨）"
}
scZh["莉格露"]["文花帖"] = {
    "萤符「地上的恒星」",
    "蝶符「Butterfly Storm」（蝴蝶风暴）"
}

scZh["米斯蒂娅"] = {}
scZh["米斯蒂娅"]["永夜抄"] = {
    "声符「枭的夜鸣声」",
    "声符「木菟的咆哮」",
    "蛾符「天蛾的蛊道」",
    "毒符「毒蛾的鳞粉」",
    "猛毒「毒蛾的黑暗演舞」",
    "鹰符「Ill-Starred Dive」（祸延疾冲）",
    "夜盲「夜雀之歌」",
    "夜雀「午夜中的Chorus master」（午夜中的合唱指挥）",
    "「Blind Night-Bird」（失明的夜雀）"
}
scZh["米斯蒂娅"]["花映塚"] = {
    "鸟符「Human Cage」（人类的牢笼）",
    "鸟符「Human Cage Double」（人类的双重牢笼）",
    "鸟符「Mysterious Song」（神秘歌音）"
}

scZh["上白泽慧音"] = {}
scZh["上白泽慧音"]["永夜抄"] = {
    "产灵「First Pyramid」（最初的金字塔）",
    "始符「Ephemerality 137」（短命的137）",
    "野符「武烈Crisis」（武烈的危机）",
    "野符「将门Crisis」（将门的危机）",
    "野符「义满Crisis」（义满的危机）",
    "野符「GHQ Crisis」（GHQ的危机）",
    "国符「三种神器　剑」",
    "国符「三种神器　玉」",
    "国符「三种神器　镜」",
    "国体「三种神器　乡」",
    "终符「幻想天皇」",
    "虚史「幻想乡传说」",
    "未来「高天原」",
    "「日出国之天子」",
    "旧史「旧秘境史 -Old History-」（旧秘境史 -古代史-）",
    "转世「一条归桥」",
    "新史「新幻想史 -Next History-」（新幻想史 -现代史-）",
    "「无何有的浄化」"
}
scZh["上白泽慧音"]["文花帖"] = {
    "光符「天照」",
    "包符「昭和之雨」",
    "葵符「水户的光圀」",
    "倭符「邪马台国」"
}
scZh["上白泽慧音"]["天邪鬼"] = {
    "「20XX年 死后之旅」",
    "大火「江户之花」"
}

scZh["因幡帝"] = {}
scZh["因幡帝"]["永夜抄"] = {
    "「Ancient Duper」（远古的骗术）"
}
scZh["因幡帝"]["花映塚"] = {
    "兔符「开运大纹」",
    "兔符「因幡的白兔」"
}
scZh["因幡帝"]["文花帖"] = {
    "脱兔「Fluster Escape」（狼狈逃脱）",
    "借符「大穴牟迟大人的药」"
}

scZh["铃仙"] = {}
scZh["铃仙"]["永夜抄"] = {
    "波符「赤眼催眠(Mind Shaker)」（心灵颤动）",
    "幻波「赤眼催眠(Mind Blowing)」（心灵风暴）",
    "狂符「幻视调律(Visionary Tuning)」（幻视调律）",
    "狂视「狂视调律(Illusion Seeker)」（幻象追迹者）",
    "懒符「生神停止(Idling Wave)」（惰性之波）",
    "懒惰「生神停止(Mind Stopper)」（心灵制止）",
    "散符「真实之月(Invisible Full Moon)」（隐形满月）",
    "月眼「月兔远隔催眠术(Tele-Mesmerism)」（远隔催眠）",
    "「幻胧月睨（Lunatic Red Eyes）」（疯狂红眼）"
}
scZh["铃仙"]["花映塚"] = {
    "波符「月面波纹(Luna Wave)」（月面波纹）",
    "散符「荣华之梦(Luna Megalopolis)」（月面都市）"
}
scZh["铃仙"]["文花帖"] = {
    "散符「胧月花栞（Rocket in Mist）」（雾中的火箭）",
    "波符「幻之月（Invisible Half Moon）」（不可视的半月）",
    "狂梦「疯狂的梦（Dream World）」（梦世界）"
}
scZh["铃仙"]["绯想天"] = {
    "迫符「胁迫幻觉（Obsessioner）」（着魔之人）",
    "幻弹「幻想视差（Bluff Barrage）」（恐吓弹幕）",
    "幻兔「平行交差（Parallel Cross）」（平行相交）",
    "惑视「离圆花冠（Corolla Vision）」（花冠幻象）",
    "幻爆「近眼花火（Mind Star Mine）」（心灵烟花）",
    "幻惑「花冠视线（Crown Vision）」（花环幻象）",
    "「幻胧月睨（Lunatic Red Eyes）」（疯狂红眼）",
    "弱心「丧心丧意（Demotivation）」（丧失动力）",
    "丧心「丧心疮痍（Discarder）」（弃卡者）",
    "毒烟幕「瓦斯织物之玉」",
    "生药「国士无双之药」"
}
scZh["铃仙"]["非想天则"] = {
    "长视「赤月下（Infrared Moon）」（红外线之月）",
    "短视「超短脑波（X Wave）」（X射线）",
    "赤眼「望见圆月（Lunatic Blast）」（狂月爆破）"
}
scZh["铃仙"]["深秘录"] = {
    "「月面弹跳(Lunatic Double)」（双重疯狂）",
    "「幻胧月睨(Lunatic Red Eyes)」（疯狂红眼）",
    "「地上弹跳(Lunatic Echo)」（疯狂回声）",
    "＊你已经疯了！＊"
}
scZh["铃仙"]["绀珠传"] = {
    "「障壁波动（Evil Undulation）」"
}
scZh["铃仙"]["凭依华"] = {
    "「月面跳弹（Lunatic Double）」（双重疯狂）",
    "「幻胧月睨（Lunatic Red Eyes）」（疯狂红眼）",
    "「地上跳弹（Lunatic Echo）」（疯狂回声）",
    "＊你已经疯了！＊",
    "狂槌符「狂视幻象（Disorder Eye）也变大吧」（混乱之眼）",
    "火狂符「人体燃烧秘匿弹幕（Burning Hidden Bullet）」（燃烧的秘匿弹幕）"
}

scZh["八意永琳"] = {}
scZh["八意永琳"]["永夜抄"] = {
    "天丸「壶中的天地」",
    "觉神「神代的记忆」",
    "神符「天人的族谱」",
    "苏活「生命游戏 -Life Game-」",
    "苏生「Rising Game」（复活游戏）",
    "操神「Omoikane Device」（思兼装置）",
    "神脑「Omoikane Brain」（思兼的头脑）",
    "天咒「Apollo 13」（阿波罗13）",
    "秘术「天文密葬法」",
    "禁药「蓬莱之药」",
    "药符「壶中的大银河」",
    "「天网蛛网捕蝶之法」"
}
scZh["八意永琳"]["文花帖"] = {
    "药符「蝴蝶梦丸Nightmare」（蝴蝶梦丸噩梦）",
    "炼丹「水银之海」",
    "秘药「仙香玉兔」"
}

scZh["蓬莱山辉夜"] = {}
scZh["蓬莱山辉夜"]["永夜抄"] = {
    "难题「龙颈之玉　-五色的弹丸-」",
    "神宝「Brilliant Dragon Bullet」（耀眼的龙玉）",
    "难题「佛御石之钵　-不碎的意志-」",
    "神宝「Buddhist Diamond」（佛体的金刚石）",
    "难题「火鼠的皮衣　-不焦躁的内心-」",
    "神宝「Salamander Shield」（火蜥蜴之盾）",
    "难题「燕的子安贝　-永命线-」",
    "神宝「Life Spring Infinity」（无限的生命之泉）",
    "难题「蓬莱的弹枝　-七色的弹幕-」",
    "神宝「蓬莱的玉枝　-梦色之乡-」",
    "「永夜归返　-初月-」",
    "「永夜归返　-新月-」",
    "「永夜归返　-上弦月-」",
    "「永夜归返　-待宵-」",
    "「永夜归返　-子之刻-」",
    "「永夜归返　-子时二刻-」",
    "「永夜归返　-子时三刻-」",
    "「永夜归返　-子时四刻-」",
    "「永夜归返　-丑之刻-」",
    "「永夜归返　-丑时二刻-」",
    "「永夜归返　-丑时三刻-」",
    "「永夜归返　-丑时四刻-」",
    "「永夜归返　-寅之刻-」",
    "「永夜归返　-寅时二刻-」",
    "「永夜归返　-寅时三刻-」",
    "「永夜归返　-寅时四刻-」",
    "「永夜归返　-朝霭-」",
    "「永夜归返　-拂晓-」",
    "「永夜归返　-破晓明星-」",
    "「永夜归返　-世间开明-」",
    "「蓬莱的树海」"
}
scZh["蓬莱山辉夜"]["文花帖"] = {
    "新难题「月的Ilmenite」（月的钛铁矿）",
    "新难题「艾哲红石」",
    "新难题「金阁寺的一块天花板」",
    "新难题「Mysterium」（神秘物质）"
}

scZh["藤原妹红"] = {}
scZh["藤原妹红"]["永夜抄"] = {
    "时效「月岩笠的诅咒」",
    "不死「火鸟　-凤翼天翔-」",
    "藤原「灭罪寺院伤」",
    "不死「徐福时空」",
    "灭罪「正直者之死」",
    "虚人「无」",
    "不灭「Phoneix之尾」（不死鸟之尾）",
    "蓬莱「凯风快晴　-Fujiyama Volcano-」（凯风快晴　-不死的火山-）",
    "「Possessed by Phoenix」（不死鸟附体）",
    "「蓬莱人形」",
    "「Imperishable Shooting」（不朽的弹幕）",
    "「Phoneix重生」（不死鸟重生）"
}
scZh["藤原妹红"]["文花帖"] = {
    "贵人「Saint Germain的忠告」（圣日耳曼的忠告）",
    "蓬莱「瑞江浦岛子与五色的瑞龟」"
}
scZh["藤原妹红"]["天邪鬼"] = {
    "惜命「不死之身的舍身击」",
    "「火鸟　‐不死传说‐」"
}
scZh["藤原妹红"]["深秘录"] = {
    "焰符「自灭火焰大旋风」",
    "不死「凯风快晴飞翔蹴」",
    "咒符「无差别放火之符」",
    "＊这种世道赶紧烧个精光吧！＊",
    "炎符「不死鸟的超高温羽毛」",
    "＊凯风晴天快晴脚＊",
    "炎符「不死鸟之羽」",
    "爪符「Desperate Claw」（绝望之爪）",
    "惜命「不死之身的舍身击」",
    "「这不知是第几次的生命，燃烧殆尽吧」"
}
scZh["藤原妹红"]["凭依华"] = {
    "焰符「自灭火焰大旋风」",
    "不死「凯风快晴飞翔蹴」",
    "咒符「无差别放火之符」",
    "＊这种世道赶紧烧个精光吧！＊",
    "化火符「妖怪弹幕变化 叶叶烨烨」",
    "火狂符「人体燃烧秘匿弹幕（Burning Hidden Bullet）」（燃烧的秘匿弹幕）",
    "「这不知是第几次的生命，梦想封印吧」"
}

scZh["射命丸文"] = {}
scZh["射命丸文"]["花映塚"] = {
    "风符「风神一扇」",
    "疾风「风神少女」"
}
scZh["射命丸文"]["风神录"] = {
    "岐符「天之八衢」",
    "岐符「猿田Cross」（猿田彦神之岔路）",
    "风神「风神木叶隐身术」",
    "风神「天狗颪」",
    "风神「二百十日」",
    "「幻想风靡」",
    "「无双风神」",
    "塞符「山神渡御」",
    "塞符「天孙降临」",
    "塞符「天上天下的照国」"
}
scZh["射命丸文"]["绯想天"] = {
    "旋符「红叶扇风」",
    "龙卷「天孙降临的道标」",
    "逆风「人间禁制之道」",
    "突符「天狗的Macro burst」（天狗巨暴流）",
    "风符「天狗道的开风」",
    "「幻想风靡」",
    "魔兽「镰鼬Veiling」（镰鼬面纱）",
    "突风「猿田彦的先导」",
    "突风「猿田彦的先导」",
    "旋符「飘妖扇」",
    "旋风「鸟居旋风」",
    "「幻想风靡」"
}
scZh["射命丸文"]["非想天则"] = {
    "风符「天狗报当日截稿」",
    "鸦符「暗夜的Day Mare」（暗夜昼魇）"
}
scZh["射命丸文"]["文花帖DS"] = {
    "取材「射命丸文的暴力取材」",
    "望远「Candid Shot」（秘密拍摄）",
    "抓拍「Fast Shot」（快速摄像）",
    "「幻想风靡」"
}
scZh["射命丸文"]["天邪鬼"] = {
    "写真「激摄天狗独家新闻」",
    "「瞬摄新闻工作者」"
}
scZh["射命丸文"]["天空璋"] = {
    "风符「天狗暴风雨」"
}

scZh["梅蒂欣"] = {}
scZh["梅蒂欣"]["花映塚"] = {
    "毒符「神经之毒」",
    "毒符「忧郁之毒」"
}
scZh["梅蒂欣"]["文花帖"] = {
    "雾符「Gassing Garden」（毒气花园）",
    "毒符「Poison Breath」（猛毒气息）",
    "谵妄「Into Delirium」（进入疯狂）"
}

scZh["风见幽香"] = {}
scZh["风见幽香"]["花映塚"] = {
    "花符「幻想乡的开花」",
    "幻想「花鸟风月，啸风弄月」"
}

scZh["小野塚小町"] = {}
scZh["小野塚小町"]["花映塚"] = {
    "投钱「隔夜钱」",
    "死神「Higan Retour」（彼岸归航）"
}
scZh["小野塚小町"]["文花帖"] = {
    "死歌「八重雾中渡」",
    "古雨「黄泉中有旅途之雨」",
    "死价「Price of Life」（生命的价值）"
}
scZh["小野塚小町"]["绯想天"] = {
    "舟符「宛若河流般」",
    "薄命「余命无几许」",
    "灵符「到处都是的浮游灵」",
    "死歌「八重雾中渡」",
    "换命「不惜身命，可惜身命」",
    "恨符「充满留恋的紧缚灵」",
    "死符「区别死者的镰刀」",
    "地狱「无间之狭间」",
    "灵符「古老的地缚灵之复苏」",
    "死符「区别死者的镰刀」",
    "魂符「魂之游戏」"
}
scZh["小野塚小町"]["非想天则"] = {
    "魂符「生魂流离的镰刀」"
}

scZh["四季映姬"] = {}
scZh["四季映姬"]["花映塚"] = {
    "罪符「彷徨的大罪」",
    "审判「Last Judgement」（最终审判）"
}
scZh["四季映姬"]["文花帖"] = {
    "谎言「Tongue of Wolf」（狼之舌）",
    "审判「十王审判」",
    "审判「Guilty or Not Guilty」（有罪或无罪）",
    "审判「净颇梨审判 -射命丸文-」"
}

scZh["秋静叶"] = {}
scZh["秋静叶"]["风神录"] = {
    "叶符「纷乱的落叶」"
}
scZh["秋静叶"]["文花帖DS"] = {
    "秋符「Fall in Blast」（落入疾风）",
    "枯道「Lost Windrow」（遗失的叶堆）"
}

scZh["秋穰子"] = {}
scZh["秋穰子"]["风神录"] = {
    "秋符「Autumn Sky」（秋季的天空）",
    "秋符「无常秋日与少女的心」",
    "丰符「Otoshi Harvester」（大年收获者）",
    "丰收「谷物神的允诺」"
}
scZh["秋穰子"]["文花帖DS"] = {
    "实符「Warm Color Harvest」（暖色的收获）",
    "烧芋「Sweet Potato Room」（甜美的番薯房）"
}

scZh["键山雏"] = {}
scZh["键山雏"]["风神录"] = {
    "厄符「Bad Fortune」（厄运）",
    "厄符「厄神大人的Biorhythm」（厄神大人的生理节律）",
    "疵符「Broken Amulet」（破裂的护符）",
    "疵痕「损坏的护符」",
    "恶灵「Misfortune's Wheel」（厄运之轮）",
    "悲运「大钟婆之火」",
    "创符「Pain Flow」（痛苦之流）",
    "创符「流放人偶」"
}
scZh["键山雏"]["文花帖DS"] = {
    "厄野「禊川的沉积」",
    "灾祸「诅咒的雏人偶」"
}

scZh["河城荷取"] = {}
scZh["河城荷取"]["风神录"] = {
    "光学「Optical Camouflage」（光学迷彩）",
    "光学「Hydro-Camouflage」（水迷彩）",
    "洪水「Ooze Flooding」（泥浆泛滥）",
    "洪水「Diluvial Mare」（冲积梦魇）",
    "漂溺「粼粼水底的Trauma」（粼粼水底之心伤）",
    "水符「河童的Pororoca」（河童之河口浪潮）",
    "水符「河童的Flash flood」（河童之山洪暴发）",
    "水符「河童之幻想大瀑布」",
    "河童「妖怪Cucumber」（妖怪黄瓜）",
    "河童「延展Arm」（延展手臂）",
    "河童「Spin the Cephalic Plate」（回转顶板）"
}
scZh["河城荷取"]["文花帖DS"] = {
    "水符「Water Carpet」（水色绒毯）",
    "河符「Dividing Edge」（离断的棱边）",
    "河童「干燥尻子玉」"
}
scZh["河城荷取"]["心绮楼"] = {
    "豪雨「河底大战争」",
    "泡符「射击吧！Bubble Dragon」（射击吧！泡泡龙）",
    "战机「飞翔吧！三平Fight」（飞翔吧！三平加油）",
    "「Super Scope 3D」",
    "水符「夏天的Plastic Bottle Rocket」（夏天的塑料瓶火箭）",
    "妖怪战舰「三平Fighter」（三平战机）"
}
scZh["河城荷取"]["天邪鬼"] = {
    "瀑符「Shiraito Fall」（白丝瀑布）",
    "瀑符「Kegon Gun」（华严枪）"
}
scZh["河城荷取"]["深秘录"] = {
    "豪雨「河底大战争」",
    "泡符「射击吧！泡泡龙」",
    "战机「飞翔吧！三平加油」",
    "＊尼斯湖现在就在这里！＊",
    "＊尼西的完全养殖技术＊"
}
scZh["河城荷取"]["凭依华"] = {
    "豪雨「河底大战争」",
    "泡符「射击吧！泡泡龙」",
    "战机「飞翔吧！三平加油」",
    "＊尼斯湖现在就在这里！＊",
    "水面符「水泡弹假面舞会」",
    "拳水符「入道丛云水泡弹拳」"
}

scZh["犬走椛"] = {}
scZh["犬走椛"]["文花帖DS"] = {
    "狗符「Rabies Bite」（狂犬断噬）",
    "山窝「Expellees' Canaan」（遭放逐者的约定之地）"
}
scZh["犬走椛"]["天邪鬼"] = {
    "牙符「咀嚼玩味」"
}

scZh["东风谷早苗"] = {}
scZh["东风谷早苗"]["风神录"] = {
    "秘术「Gray Thaumaturgy」（灰色奇术）",
    "秘术「遗忘之祭仪」",
    "秘术「单脉相传之弹幕」",
    "奇迹「白昼的客星」",
    "奇迹「客星璀璨之夜」",
    "奇迹「客星辉煌之夜」",
    "开海「海水分开之日」",
    "开海「Moses之奇迹」（摩西之奇迹）",
    "准备「呼唤神风的星之仪式」",
    "准备「Summon建御名方神」（召请建御名方神）",
    "奇迹「神之风」",
    "大奇迹「八坂之神风」"
}
scZh["东风谷早苗"]["地灵殿"] = {
    "秘法「九字切」",
    "奇迹「Miracle Fruit」（神秘果）",
    "神德「五谷丰穰Rice Shower」（五谷丰穰米之浴）"
}
scZh["东风谷早苗"]["星莲船"] = {
    "蛇符「神代大蛇」",
    "蛙符「操纵蛤蟆」"
}
scZh["东风谷早苗"]["非想天则"] = {
    "祈愿「守护商业繁荣」",
    "秘术「Gray Thaumaturgy」（灰色奇术）",
    "神签「暴乱神签连掷」",
    "开海「海水分开之日」",
    "奇迹「白昼的客星」",
    "秘术「遗忘之祭仪」",
    "奇迹「客星辉煌之夜」",
    "开海「Moses之奇迹」（摩西之奇迹）",
    "秘法「九字切」",
    "蛇符「云泳大蛇」",
    "奇迹「falls-from-the-skies的奇迹」（空中落物的奇迹）"
}
scZh["东风谷早苗"]["文花帖DS"] = {
    "奇迹「弘安的神风」",
    "蛙符「操纵蛤蟆」",
    "妖怪退治「妖力Spoiler」（妖力掠夺者）"
}
scZh["东风谷早苗"]["神灵庙"] = {
    "秘术「Gray Thaumaturgy」（灰色奇术）"
}
scZh["东风谷早苗"]["天邪鬼"] = {
    "蛇符「Bind Snake Come On」（缠蛇上吧）",
    "蛇符「Green Snake Come On」（绿蛇上吧）"
}
scZh["东风谷早苗"]["绀珠传"] = {
    "蛙符「操纵蛤蟆」"
}

scZh["八坂神奈子"] = {}
scZh["八坂神奈子"]["风神录"] = {
    "神祭「Expanded Onbashira」（扩展御柱）",
    "奇祭「目处梃子乱舞」",
    "筒粥「神之粥」",
    "忘谷「Unremembered Crop」（遗忘之谷）",
    "神谷「Divining Crop」（神灵之谷）",
    "贽符「御射山御狩神事」",
    "神秘「葛井之清水」",
    "神秘「Yamato Torus」（大和环面）",
    "天流「天水奇迹」",
    "天龙「雨之源泉」",
    "「Mountain of Faith」（信仰之山）",
    "「风神之神德」",
    "神符「如水眼之美丽源泉」",
    "神符「结于杉木之古缘」",
    "神符「神所踏足之御神渡」"
}
scZh["八坂神奈子"]["文花帖DS"] = {
    "蛇符「Ground Serpent」（伏地的巨蛇星）",
    "御柱「Meteoric Onbashira」（流星般的御柱）",
    "儚道「御神渡Cross」（御神渡路口）"
}
scZh["八坂神奈子"]["天邪鬼"] = {
    "御柱「Rising Onbashira」（上升御柱）",
    "「神明的威光」"
}

scZh["洩矢诹访子"] = {}
scZh["洩矢诹访子"]["风神录"] = {
    "开宴「二拜二拍一拜」",
    "土著神「手长足长大人」",
    "神具「洩矢的铁轮」",
    "源符「厌川的翡翠」",
    "蛙狩「蛙以口鸣，方致蛇祸」",
    "土著神「七石七木」",
    "土著神「小小青蛙不输风雨」",
    "土著神「宝永四年的赤蛙」",
    "「诹访大战 ～ 土著神话 vs 中央神话」",
    "祟符「洩矢大人」"
}
scZh["洩矢诹访子"]["非想天则"] = {
    "源符「诹访清水」",
    "神具「洩矢的铁轮」",
    "土著神「洩矢神」",
    "开宴「二拜二拍一拜」",
    "土著神「小小青蛙不输风雨」",
    "源符「厌川的翡翠」",
    "蛙狩「蛙以口鸣，方致蛇祸」",
    "土著神「手长足长大人」",
    "土著神「宝永四年的赤蛙」",
    "蛙休「Always能冬眠」（总是能够冬眠）",
    "祟神「赤口大人」",
    "合掌「大太法师的参拜」",
    "神具「洩矢的铁轮」",
    "「炽如地狱的间歇泉」",
    "「Magma的两栖类」（岩浆的两栖类）",
    "「幻想乡空中神战」"
}
scZh["洩矢诹访子"]["文花帖DS"] = {
    "神樱「湛樱花吹雪」",
    "姬川「Princess Jade Green」（姬川的翡翠）",
    "铁轮「Mythical Ring」（神谕之环）",
    "土地神「御射军神大人」"
}
scZh["洩矢诹访子"]["天邪鬼"] = {
    "绿石「Jade Break」（翡翠破碎）",
    "蛙符「涂有鲜血的赤蛙塚」"
}

scZh["永江衣玖"] = {}
scZh["永江衣玖"]["绯想天"] = {
    "电符「雷鼓弹」",
    "鱼符「龙鱼Drill」（龙鱼电钻）",
    "雷符「electricity的龙宫」（电气的龙宫）",
    "光星「光龙之叹息」",
    "雷鱼「雷云鱼游泳弹」",
    "羽衣「羽衣若空」",
    "棘符「雷云棘鱼」",
    "龙鱼「龙宫使的游泳弹」",
    "光玉「闪光之龙眼」",
    "雷符「神鸣者的住处」",
    "棘符「雷云棘鱼」",
    "云界「玄云海的雷庭」"
}
scZh["永江衣玖"]["非想天则"] = {
    "羽衣「羽衣若时」",
    "珠符「五爪龙之珠」"
}
scZh["永江衣玖"]["文花帖DS"] = {
    "雷符「Lightning Fish」（鱼泳雷鸣）",
    "珠符「五爪龙之珠」",
    "龙宫「鲷和比目鱼的dance」（鲷和比目鱼的舞蹈）",
    "龙鱼「龙宫使的游泳弹」"
}

scZh["比那名居天子"] = {}
scZh["比那名居天子"]["绯想天"] = {
    "地符「不让土壤之剑」",
    "非想「非想非非想之剑」",
    "天符「天道是非之剑」",
    "地震「先忧后乐之剑」",
    "气符「天启气象之剑」",
    "要石「天地开辟Press」（天地开辟之挤压）",
    "气符「无念无想的境界」",
    "「全人类的绯想天」",
    "要石「天空之灵石」",
    "乾坤「粗暴而又像母亲般的大地啊」",
    "灵想「镇守大地之石」",
    "天地「俯瞰世界的遥远的大地啊」",
    "「全人类的绯想天」"
}
scZh["比那名居天子"]["非想天则"] = {
    "剑技「气焰万丈之剑」",
    "天气「绯想天促」"
}
scZh["比那名居天子"]["文花帖DS"] = {
    "气性「勇气凛凛之剑」",
    "地震「避难险路」",
    "要石「要石浮游炮」",
    "「全人类的绯想天」"
}
scZh["比那名居天子"]["天邪鬼"] = {
    "「全妖怪的绯想天」",
    "「鹿岛镇护」"
}
scZh["比那名居天子"]["凭依华"] = {
    "要石「要石浮游炮」",
    "地符「一击震乾坤」",
    "桃符「固若金汤的仙桃」",
    "＊大气圈尽在吾之手中＊",
    "升槌符「载着我们的梦变大吧」",
    "坠槌符「梦坠入大气圈变大吧」",
    "「全小人族的绯想天」",
    "梦要符「羊毛色的乾坤一掷」",
    "升符「飞向遥远的宇宙吧！ 载着我们的梦想」",
    "坠符「落入大气圈，梦想倾泻地表」",
    "「把大地重塑成，有梦的世界吧！」",
    "「巨型战舰 无双大鲶鱼参见」",
    "「全宇宙人的绯想天」"
}

scZh["琪斯美"] = {}
scZh["琪斯美"]["地灵殿"] = {
    "怪奇「钓瓶落之怪」"
}
scZh["琪斯美"]["文花帖DS"] = {
    "钓瓶「飞入井中」",
    "钓瓶「Well Destructor」（井下的毁灭者）"
}

scZh["黑谷山女"] = {}
scZh["黑谷山女"]["地灵殿"] = {
    "罠符「Capture Web」（捕捉之网）",
    "蜘蛛「石窟的蜘蛛巢」",
    "瘴符「Field Miasma」（瘴气场）",
    "瘴气「原因不明的热病」"
}
scZh["黑谷山女"]["文花帖DS"] = {
    "细网「犍陀多Rope」（犍陀多绳索）",
    "毒符「桦黄小町」"
}

scZh["水桥"] = {}
scZh["水桥"]["地灵殿"] = {
    "妒符「Green-Eyed Monster」（绿眼怪兽）",
    "嫉妒「看不见的绿眼怪兽」",
    "开花爷爷「对华丽的仁者之嫉妒」",
    "开花爷爷「小白的灰烬」",
    "剪舌麻雀「对谦虚的富者之记恨」",
    "剪舌麻雀「大葛笼与小葛笼」",
    "恨符「丑时参拜」",
    "恨符「丑时参拜第七日」"
}
scZh["水桥"]["文花帖DS"] = {
    "嫉妒「Jealousy Bomber」（嫉妒爆发）",
    "怨恨念法「积怨返」"
}

scZh["星熊勇仪"] = {}
scZh["星熊勇仪"]["地灵殿"] = {
    "鬼符「怪力乱神」",
    "怪轮「地狱之苦轮」",
    "枷符「罪人不释之枷」",
    "力业「大江山岚」",
    "力业「大江山颪」",
    "四天王奥义「三步必杀」"
}
scZh["星熊勇仪"]["文花帖DS"] = {
    "光鬼「金刚螺旋」",
    "鬼符「鬼气狂澜」",
    "鬼声「毁灭之咆哮」"
}

scZh["古明地觉"] = {}
scZh["古明地觉"]["地灵殿"] = {
    "回忆「Terrible Souvenir」（恐怖的回忆）",
    "回忆「恐怖催眠术」",
    "回忆「二重黑死蝶」",
    "回忆「飞行虫Nest」（飞行虫之巢）",
    "回忆「波与粒的境界」",
    "回忆「户隐山之投」",
    "回忆「百万鬼夜行」",
    "回忆「蒙蒙迷雾」",
    "回忆「风神木叶隐身术」",
    "想起「天狗的Macro burst」（天狗巨暴流）",
    "回忆「鸟居旋风」",
    "回忆「春之京都人偶」",
    "回忆「Straw Doll Kamikaze」（稻草人偶敢死队）",
    "回忆「Return Inanimateness」（回归虚无）",
    "回忆「Mercury Poison」（水银之毒）",
    "回忆「Princess Undine」（水精公主）",
    "回忆「贤者之石」",
    "回忆「延展Arm」（延展手臂）",
    "回忆「河童的Pororoca」（河童之河口浪潮）",
    "回忆「粼粼水底的Trauma」（粼粼水底之心伤）"
}
scZh["古明地觉"]["文花帖DS"] = {
    "脑符「Brain Fingerprint」（脑指纹测谎法）",
    "心花「Camera-Shy Rose」（厌于留影的羞涩蔷薇）",
    "回忆「朦胧记忆中的金阁寺」"
}

scZh["火焰猫燐"] = {}
scZh["火焰猫燐"]["地灵殿"] = {
    "猫符「Cat's Walk」（猫的步伐）",
    "猫符「怨灵猫乱步」",
    "咒精「Zombie Fairy」（僵尸妖精）",
    "咒精「怨灵凭依妖精」",
    "恨灵「Spleen Eater」（脾脏蛀食者）",
    "尸灵「食人怨灵」",
    "赎罪「旧地狱的针山」",
    "赎罪「古时之针与痛楚的怨灵」",
    "「死灰复燃」",
    "「小恶灵复活」",
    "妖怪「火焰的车轮」"
}
scZh["火焰猫燐"]["文花帖DS"] = {
    "死符「Ghost Town」（怨灵城）",
    "「尸体繁华街」",
    "醉步「Cat Random Walk」（猫的乱步）"
}

scZh["灵乌路空"] = {}
scZh["灵乌路空"]["地灵殿"] = {
    "核热「Nuclear Fusion」（核聚变）",
    "核热「Nuclear Excursion」（核功率骤增）",
    "核热「核反应失控」",
    "爆符「Petit Flare」（小型耀斑）",
    "爆符「Mega-Flare」（百万耀斑）",
    "爆符「Giga-Flare」（十亿耀斑）",
    "爆符「Peta-Flare」（千兆耀斑）",
    "焰星「Fixed Star」（恒星）",
    "焰星「Planetary Revolution」（行星公转）",
    "焰星「十凶星」",
    "「地狱极乐Melt Down」（地狱极乐熔毁）",
    "「Hell's Tokamak」（地狱的托卡马克装置）",
    "「地狱的人造太阳」",
    "「Subterranean Sun」（地底的太阳）"
}
scZh["灵乌路空"]["非想天则"] = {
    "「地狱的人造太阳」",
    "控制「Self Tokamak」（自动托卡马克装置）",
    "遮光「核热Visor」（核热护罩）",
    "爆符「Mega-Flare」（百万耀斑）",
    "焰星「Fixed Star」（恒星）",
    "核符「Creeping Sun」（缓行的太阳）",
    "光热「High Tension Blade」（高压光刃）",
    "焰星「十凶星」",
    "地热「核Blaze Geyser」（核焰喷涌）",
    "鸦符「八咫乌Dive」（八咫乌俯冲）",
    "核热「核反应失控Dive」（核反应失控疾冲）",
    "「Subterranean Sun」（地底的太阳）",
    "爆符「Giga-Flare」（十亿耀斑）",
    "「Abyss Nova」（深渊新星）",
    "热符「Break Prominence」（破碎日珥）",
    "核热「核反应失控Dive」（核反应失控疾冲）",
    "「Hot Jupiter降落Model」（热木星降落模型）",
    "核热「人工太阳的黑子」"
}
scZh["灵乌路空"]["文花帖DS"] = {
    "熔解「Melting White」（消熔的纯白）",
    "巨星「Red Giant」（红巨星）",
    "星符「巨星陨落」",
    "七星「Septentrion」（北斗星辰）"
}

scZh["古明地恋"] = {}
scZh["古明地恋"]["地灵殿"] = {
    "表象「祖先托梦」",
    "表象「弹幕Paranoia」（弹幕偏执症）",
    "本能「ID的解放」（本我的解放）",
    "抑制「Super Ego」（超我）",
    "反应「妖怪Polygraph」（妖怪测谎机）",
    "潜意识「弹幕的Rorschach」（弹幕的墨迹测验）",
    "复燃「恋爱的埋火」",
    "深层「潜意识的基因」",
    "「被厌恶者的Philosophy」（被厌恶者的哲学）",
    "「Subterranean Rose」（地底的蔷薇）"
}
scZh["古明地恋"]["文花帖DS"] = {
    "心符「没我之爱」",
    "记忆「DNA的瑕疵」",
    "「胎儿之梦」",
    "「Rose地狱」（蔷薇地狱）"
}
scZh["古明地恋"]["心绮楼"] = {
    "抑制「Super Ego」（超我）",
    "本能「ID的解放」（本我的解放）",
    "梦符「先祖大人在看着你」",
    "「Brambly Rose Garden」（带刺的蔷薇园）",
    "本能「Freudian」（弗洛伊德学说）",
    "茨符「Confined Innocent」（狭隘的天真）"
}
scZh["古明地恋"]["深秘录"] = {
    "抑制「Super Ego」（超我）",
    "本能「本我的解放」",
    "梦符「先祖大人在看着你」",
    "＊现在就给你打电话别忘了接哦＊",
    "＊被诅咒的响一声电话＊"
}
scZh["古明地恋"]["秦心"] = {
    "怒面「愤怒的忌狼之面」",
    "凭依「喜怒哀乐附体」",
    "忧面「杞人忧地」",
    "＊就算这样我也漂亮吧？＊",
    "＊裂口的感情＊"
}
scZh["古明地恋"]["凭依华"] = {
    "抑制「Super Ego」（超我）",
    "本能「本我的解放」",
    "梦符「先祖大人在看着你」",
    "＊现在就给你打电话别忘了接哦＊",
    "星恋符「Sprinkle Star & Heart」（星星心心洒）",
    "恋拳符「玫瑰狂想曲怪云拳」",
    "槌恋符「大判小判叮叮当心」"
}

scZh["娜兹玲"] = {}
scZh["娜兹玲"]["星莲船"] = {
    "棒符「Busy Rod」（忙碌探知棒）",
    "搜符「Rare Metal Detector」（稀有金属探测器）",
    "搜符「Gold Detector」（黄金探测器）",
    "视符「Nazrin Pendulum」（娜兹玲灵摆）",
    "视符「高感度Nazrin Pendulum」（高感度娜兹玲灵摆）",
    "守符「Pendulum Guard」（灵摆防御）",
    "宝塔「Greatest Treasure」（最优良的宝物）"
}
scZh["娜兹玲"]["文花帖DS"] = {
    "棒符「Nazrin Rod」（娜兹玲探宝棒）",
    "财宝「Gold Rush」（淘金潮）"
}

scZh["多多良小伞"] = {}
scZh["多多良小伞"]["星莲船"] = {
    "大轮「唐伞光晕」",
    "大轮「Hello,Forgotten World」（你好，被遗忘的世界）",
    "伞符「Parasol Star Symphony」（雨伞的星之交响）",
    "伞符「Parasol Star Memories」（雨伞的星之追忆）",
    "雨符「雨夜怪谈」",
    "雨伞「超防水干爽伞妖」",
    "化符「遗忘之伞的夜行列车」",
    "化铁「备用伞特急Night Carnival」（备用伞特急夜晚狂欢号）",
    "伞符「大颗的泪雨」",
    "惊雨「台风骤雨」",
    "光晕「唐伞惊吓Flash」（唐伞惊吓闪光）"
}
scZh["多多良小伞"]["文花帖DS"] = {
    "伞符「单脚Pitcher返」（单脚投手返）",
    "虹符「Over the Rainbow」（飞跃彩虹）",
    "伞符「细雪的过客」"
}
scZh["多多良小伞"]["神灵庙"] = {
    "虹符「Umbrella Cyclone」（雨伞风暴）"
}

scZh["云居一轮"] = {}
scZh["云居一轮"]["星莲船"] = {
    "铁拳「问答无用妖怪拳」",
    "神拳「凌云地狱冲」",
    "神拳「天海地狱冲」",
    "拳符「天网Sandbag」（天网沙袋）",
    "连打「云界Kraken来袭」（云界海妖来袭）",
    "连打「King Kraken来袭」（帝王海妖来袭）",
    "拳打「重拳Smash」（重拳碎击）",
    "溃灭「天上天下连续Hook」（天上天下连续勾拳）",
    "大喝「守旧尊老之怒眼」",
    "忿怒「天变巨眼焚身」",
    "忿怒「空前绝后巨眼焚身」"
}
scZh["云居一轮"]["文花帖DS"] = {
    "拳骨「天空铁锤落」",
    "稻妻「带电入道」",
    "铁拳「入道唰」"
}
scZh["云居一轮"]["心绮楼"] = {
    "岚符「佛罚的秋台风」",
    "积乱「见越入道云」",
    "拳固「忏悔的杀风」",
    "「华丽的老爹时代」",
    "拳符「愤怒的大云块」",
    "入道「夏之幻想太郎」"
}
scZh["云居一轮"]["深秘录"] = {
    "岚符「佛罚的秋台风」",
    "积乱「见越入道云」",
    "拳固「忏悔的杀风」",
    "＊265厘米的魔人现身！＊",
    "恶符「八丈高的灵异柱」",
    "＊被谜之女子囚禁的仲夏之夜＊"
}
scZh["云居一轮"]["凭依华"] = {
    "岚符「佛罚的秋台风」",
    "积乱「见越入道云」",
    "拳固「忏悔的杀风」",
    "＊265厘米的魔人现身！＊",
    "拳风符「入道丛云风水拳」",
    "拳星符「入道丛云Slave Spark」（入道丛云下仆火花）",
    "击拳符「韦驮天的怪云拳」",
    "恋拳符「玫瑰狂想曲怪云拳」",
    "光拳符「因陀罗的金刚杵怪云拳」",
    "拳水符「入道丛云水泡弹拳」"
}

scZh["村纱水蜜"] = {}
scZh["村纱水蜜"]["星莲船"] = {
    "倾覆「同路人Anchor」（同路人之锚）",
    "倾覆「沉没Anchor」（沉没之锚）",
    "倾覆「击沉Anchor」（击沉之锚）",
    "溺符「Deep Vortex」（深海漩涡）",
    "溺符「Sinkable Vortex」（沉底漩涡）",
    "港符「Phantom Ship Harbor」（幽灵船之泊）",
    "港符「幽灵船之港」",
    "港符「幽灵船永久停泊」",
    "幽灵「Sinker Ghost」（使船沉没的幽灵）",
    "幽灵「悄然袭来的长勺」"
}
scZh["村纱水蜜"]["文花帖DS"] = {
    "锚符「幽灵船长期停泊」",
    "浸水「船底的Venus」（船底的维纳斯）",
    "「Deep Sinker」（深深沉没）"
}

scZh["寅丸星"] = {}
scZh["寅丸星"]["星莲船"] = {
    "宝塔「Radiant Treasure」（光辉之宝）",
    "宝塔「Radiant Treasure Gun」（光辉宝枪）",
    "光符「Absolute Justice」（绝对正义）",
    "光符「正义之威光」",
    "法力「至宝之独钴杵」",
    "法灯「无瑕佛法之独钴杵」",
    "光符「净化之魔」",
    "「Complete Clarification」（完全净化）"
}
scZh["寅丸星"]["文花帖DS"] = {
    "寅符「Hungry Tiger」（饿虎）",
    "天符「焦土曼荼罗」",
    "宝符「黄金的震眩」"
}

scZh["圣白莲"] = {}
scZh["圣白莲"]["星莲船"] = {
    "魔法「紫云的Omen」（紫云之兆）",
    "吉兆「紫色云路」",
    "吉兆「极乐的紫色云路」",
    "魔法「魔界蝶之妖香」",
    "魔法「Magic Butterfly」（魔法之蝶）",
    "光魔「Star Maelstrom」（星辰之涡）",
    "光魔「魔法银河系」",
    "大魔法「魔神复诵」",
    "「圣尼公的Air卷轴」（圣尼公之大空卷轴）",
    "超人「圣白莲」",
    "飞钵「Flying Fantastica」（幻想的飞行）",
    "飞钵「传说的飞空圆盘」"
}
scZh["圣白莲"]["文花帖DS"] = {
    "「游行圣」",
    "习合「垂迹大日如来」",
    "「Star Sword护法」（星之剑护法）"
}
scZh["圣白莲"]["心绮楼"] = {
    "天符「三千大千世界之主」",
    "天符「大日如来的光辉」",
    "天符「释迦牟尼的五行山」",
    "「Angirasa Veda」（阿诣罗吠陀）",
    "杵符「金刚手菩萨的咒文」",
    "超人「迦楼罗之翼」"
}
scZh["圣白莲"]["天邪鬼"] = {
    "「黑天的束缚」",
    "「梵天之瞳」"
}
scZh["圣白莲"]["深秘录"] = {
    "天符「三千大千世界之主」",
    "天符「大日如来的光辉」",
    "天符「释迦牟尼的五行山」",
    "＊以100迈驰骋天际！＊",
    "超音速「老妇人的冲刺」",
    "＊高速路涡轮空中转向＊",
    "＊涡轮老太婆走死走爱＊",
    "光符「因陀罗的金刚杵」",
    "超人「圣白莲」",
    "超人「大追踪！Buddhist Rider」（僧侣骑士）"
}
scZh["圣白莲"]["凭依华"] = {
    "天符「三千大千世界之主」",
    "天符「大日如来的光辉」",
    "天符「释迦牟尼的五行山」",
    "＊以100迈驰骋天际！＊",
    "光击符「引导着你的王道的金刚杵射击」",
    "击拳符「韦驮天的怪云拳」",
    "击光符「韦驮天的王道威光」",
    "蹴斩符「迦楼罗的圣德斩」",
    "光仙符「日出之国的僧侣和道士」",
    "光拳符「因陀罗的金刚杵怪云拳」",
    "击符「被韦驮天追逐的正梦」"
}

scZh["封兽鵺"] = {}
scZh["封兽鵺"]["星莲船"] = {
    "妖云「平安时代的Dark Cloud」（平安时代的黑云）",
    "真相不明「愤怒的Red UFO袭来」（愤怒的红色UFO袭来）",
    "鵺符「鵺的Snake Show」（鵺的蛇行表演）",
    "真相不明「哀愁的Blue UFO袭来」（哀愁的蓝色UFO袭来）",
    "鵺符「弹幕Chimera」（弹幕奇美拉）",
    "真相不明「忠义的Green UFO袭来」（忠义的绿色UFO袭来）",
    "鵺符「Undefined Darkness」（真相不明的黑暗）",
    "真相不明「恐怖的虹色UFO袭来」",
    "「平安京的恶梦」",
    "恨弓「源三位赖政之弓」"
}
scZh["封兽鵺"]["文花帖DS"] = {
    "真相不明「紫镜」",
    "真相不明「红mantle蓝mantle」（红披风蓝披风）",
    "真相不明「厕所里的花子」",
    "「自行星而来的弹幕X」"
}
scZh["封兽鵺"]["神灵庙"] = {
    "Unknown（未知）「轨道不明的鬼火」",
    "Unknown（未知）「姿态不明的空鱼」",
    "Unknown（未知）「原理不明的妖怪玉」"
}

scZh["大鲶鱼"] = {}
scZh["大鲶鱼"]["非想天则"] = {
    "鲶鱼「看哪，世界在震动哦？」",
    "鲶鱼「土壤液化现象让大地也像泥一样了！」",
    "鲶鱼「即使是发电也会努力哦？」",
    "鲶鱼「All电气化更Ecology！」（全电气化更加环保！）",
    "大鲶鱼「这一招出来，连尘世都要完结了！！」"
}

scZh["姬海棠果"] = {}
scZh["姬海棠果"]["文花帖DS"] = {
    "采访「姬海棠果的采访练习」",
    "连拍「Rapid Shot」（连续摄像）",
    "远视「天狗Psychography」（天狗念写法）"
}
scZh["姬海棠果"]["天邪鬼"] = {
    "写真「Full Panorama Shot」（全景拍摄）",
    "写真「足不出户的狗仔队」"
}

scZh["光之三妖精"] = {}
scZh["光之三妖精"]["大战争"] = {
    "光符「Rutile Flection」（金红石折射）",
    "空符「Elfin Canopy」（苍穹中的精灵）",
    "光符「Triple Meteor」（三重陨石）",
    "光星「Orion Belt」（猎户座腰带）",
    "光符「Bright Night」（白夜）",
    "空符「Break Canopy」（天穹破裂）",
    "光符「Extensive Meteor」（广域流星）",
    "光星「Great Triangle」（大三角）",
    "光符「Full Moon Night」（满月之夜）",
    "降光「Triple Light」（三重光芒）",
    "光符「Hyper Inflection」（激光折射）",
    "激光「Sun Burst」（太阳爆发）",
    "星热「Ice Dissolver」（寒冰熔解器）",
    "月热「Ice Dissolver」（寒冰熔解器）",
    "日热「Ice Dissolver」（寒冰熔解器）",
    "协力技「Fairy Overdrive」（妖精大暴走）",
    "「Three Fairies」（三月精）"
}

scZh["桑尼"] = {}
scZh["桑尼"]["大战争"] = {
    "阳光「Sunshine Blast」（阳光冲击波）",
    "虹光「Prism Flash」（棱镜闪光）",
    "光精「Diamond Ring」（钻石之环）",
    "光符「Blue Deflection」（蓝色偏移）",
    "日符「Aggressive Light」（咄咄逼人的光亮）",
    "日符「Direct Sunlight」（阳光直射）",
    "瞬光「Fatal Flash」（致命闪光）",
    "光精「Cross Diffusion」（交叉反射）",
    "光符「Yellow Deflection」（黄色偏移）",
    "阳光「Sunshine Needle」（日光芒针）"
}

scZh["露娜"] = {}
scZh["露娜"]["大战争"] = {
    "月符「Lunatic Rain」（狂雨）",
    "月符「Luna Cyclone」（月面气旋）",
    "月光「Slient Storm」（寂静风暴）",
    "月光「Dark Stillness」（黑暗寂静）",
    "障光「Moonlight Wall」（月光墙）",
    "夜符「Night Fairies」（夜晚的妖精）",
    "月光「Slient Flower」（花开无声）",
    "月光「Moon Stillness」（寂静之月）",
    "光壁「Wall Break」（凿壁偷光）",
    "月光「Silent Cyclone」（静默旋风）"
}

scZh["斯塔"] = {}
scZh["斯塔"]["大战争"] = {
    "流星「Petit Comet」（小型彗星）",
    "星粒「Sprinkle Piece」（星星点点）",
    "星符「Twinkle Sapphire」（闪耀蓝宝石）",
    "星光「Star Laser」（星辰镭射）",
    "流星「Comet Stream」（彗星激流）",
    "星粒「Star Piece Shower」（星尘阵雨）",
    "星符「Shooting Sapphire」（蓝宝石喷射）",
    "星光「Star Storm」（星尘飓风）",
    "星符「Starlight Rain」（星光雨）",
    "星符「Red Star」（红星）"
}

scZh["幽谷响子"] = {}
scZh["幽谷响子"]["神灵庙"] = {
    "响符「Mountain Echo」（山谷回声）",
    "响符「Mountain Echo Scramble」（混乱的山谷回声）",
    "响符「Power Resonance」（强力共振）",
    "山彦「Long-Range Echo」（远距离回声）",
    "山彦「Amplify Echo」（扩大回声）",
    "大声「Charged Cry」（激动的呼喊）",
    "大声「Charged Yahoo」（激动Yahoo）",
    "山彦「山彦的本领发挥Echo」（山彦的本领发挥回音）"
}
scZh["幽谷响子"]["天邪鬼"] = {
    "叫唤「Primal Scream」（原始呐喊）",
    "劈音「Piercing Circle」（尖刺之圆）",
    "经文「无限念佛」"
}

scZh["宫古芳香"] = {}
scZh["宫古芳香"]["神灵庙"] = {
    "回复「Heal by Desire」（借由欲望的恢复）",
    "毒爪「Poison Raze」（剧毒抹消）",
    "毒爪「Poison Murder」（剧毒杀害）",
    "欲符「赚钱欲灵招来」",
    "欲灵「Score Desire Eater」（贪分欲吞噬者）",
    "毒爪「不死杀人鬼」"
}
scZh["宫古芳香"]["天邪鬼"] = {
    "毒爪「Zombie Claw」（僵尸之爪）"
}

scZh["霍青娥"] = {}
scZh["霍青娥"]["神灵庙"] = {
    "邪符「养小鬼」",
    "邪符「孤魂野鬼」",
    "入魔「走火入魔」",
    "降灵「死人童乩」",
    "通灵「通灵芳香」",
    "道符「道胎动」",
    "道符「TAO胎动　～道～」"
}
scZh["霍青娥"]["天邪鬼"] = {
    "入魔「过剩走火入魔」",
    "仙术「Wall Runner」（墙壁移动者）",
    "仙术「穿墙虫洞」"
}

scZh["苏我屠自古"] = {}
scZh["苏我屠自古"]["神灵庙"] = {
    "雷矢「Gagouji Cyclone」（元兴寺的旋风）",
    "雷矢「Gagouji Tornado」（元兴寺的龙卷）",
    "怨灵「入鹿之雷」"
}

scZh["物部布都"] = {}
scZh["物部布都"]["神灵庙"] = {
    "天符「雨之磐舟」",
    "天符「天之磐舟哟，向天飞升吧」",
    "投皿「物部氏的八十平瓮」",
    "炎符「废佛之炎风」",
    "炎符「火烧樱井寺」",
    "圣童女「大物忌正餐」",
    "圣童女「太阳神的贡品」"
}
scZh["物部布都"]["心绮楼"] = {
    "风符「三轮的皿风暴」",
    "炎符「太乙真火」",
    "运气「破局的开门」",
    "「大火改新」",
    "皿投「土器回转投」",
    "弓符「星龙弓」"
}
scZh["物部布都"]["天邪鬼"] = {
    "古舟「Ancient Ship」（古老之船）",
    "热龙「火焰龙脉」"
}
scZh["物部布都"]["深秘录"] = {
    "风符「三轮的皿风暴」",
    "炎符「太乙真火」",
    "运气「破局的开门」",
    "＊到死还是少一盘！＊",
    "皿符「自暴自弃的阿菊」",
    "＊从晦暗的古井底＊"
}
scZh["物部布都"]["凭依华"] = {
    "风符「三轮的皿风暴」",
    "炎符「太乙真火」",
    "运气「破局的开门」",
    "＊到死还是少一盘！＊",
    "拳风符「入道丛云风水拳」",
    "风灵符「磐舟土器封印」",
    "面风符「喜怒哀乐风水术」",
    "光风符「光辉风水披风」"
}

scZh["丰聪耳神子"] = {}
scZh["丰聪耳神子"]["神灵庙"] = {
    "名誉「十二阶之色彩」",
    "名誉「十二阶之冠位」",
    "仙符「日出之处的道士」",
    "仙符「日出之处的天子」",
    "召唤「豪族乱舞」",
    "秘宝「斑鸠寺的天球仪」",
    "秘宝「圣德太子的OOPARTS」（圣德太子的欧帕兹）",
    "光符「救世观音的佛光」",
    "光符「Guse Flash」（救世之光）",
    "眼光「十七条的Laser」（十七条的光芒）",
    "神光「无忤为宗」",
    "「星辰降落的神灵庙」",
    "「新生的神灵」",
    "「神灵大宇宙」"
}
scZh["丰聪耳神子"]["心绮楼"] = {
    "仙符「日出之处的道士」",
    "道符「掌上的天道」",
    "人符「劝善惩恶古之良典」",
    "「承诏必慎」",
    "德符「圣德的Prestige」（圣德的威望）",
    "光符「无限条Laser」（无限条光芒）"
}
scZh["丰聪耳神子"]["天邪鬼"] = {
    "「吾乃天道也」",
    "「十七条宪法炸弹」"
}
scZh["丰聪耳神子"]["深秘录"] = {
    "仙符「日出之处的道士」",
    "道符「掌上的天道」",
    "人符「劝善惩恶古之良典」",
    "＊特别让你两边都选！＊",
    "怪人「Hermetic Manteau」",
    "＊大怪人的动脉与静脉＊",
    "＊世纪的怪人红披风蓝披风＊",
    "怪人「Bloody Manto」（血色披风）",
    "怪人「被诅咒的红蓝披风」",
    "「死生有命　～按自己的意愿做出最渴望的选择吧」"
}
scZh["丰聪耳神子"]["凭依华"] = {
    "仙符「日出之处的道士」",
    "道符「掌上的天道」",
    "人符「劝善惩恶古之良典」",
    "＊特别让你两边都选！＊",
    "光击符「引导着你的王道的金刚杵射击」",
    "击光符「韦驮天的王道威光」",
    "蹴斩符「迦楼罗的圣德斩」",
    "光仙符「日出之国的僧侣和道士」",
    "光风符「光辉风水披风」",
    "光符「引导着你的梦王道的威光」"
}

scZh["二岩猯藏"] = {}
scZh["二岩猯藏"]["神灵庙"] = {
    "一回胜负「灵长类弹幕变化」",
    "二回胜负「肉食类弹幕变化」",
    "三回胜负「羽鸟类弹幕变化」",
    "四回胜负「两栖类弹幕变化」",
    "五回胜负「鸟兽戏画」",
    "六回胜负「狸猫的变身学校」",
    "七回胜负「野生的离岛」",
    "变化「魔奴化巫女的伪退治」",
    "「猯藏化弹幕十变化」",
    "貉符「满月下的腹鼓舞」",
    "「Wild Carpet」（野生地毯）"
}
scZh["二岩猯藏"]["心绮楼"] = {
    "变化「分福热水浴」",
    "变化「百鬼妖界之门」",
    "变化「二岩家的制裁」",
    "「八百八狸囃子」",
    "变化「满月的花鸟园」",
    "变化「鸟兽戏画」",
    "变化「百鬼妖界之门」",
    "「游戏到此为止了」",
    "「弁天的琵琶法师」",
    "「神社的佛祖大人」"
}
scZh["二岩猯藏"]["天邪鬼"] = {
    "「杜鹃不啼则待之泣」",
    "「人类真好啊」"
}
scZh["二岩猯藏"]["深秘录"] = {
    "变化「分福热水浴」",
    "变化「百鬼妖界之门」",
    "变化「二岩家的制裁」",
    "＊宇宙机密泄露！即刻处置＊",
    "未确认「幽浮戏画」",
    "＊满员的外星人球＊",
    "＊差不多该回家了外星人们啊＊"
}
scZh["二岩猯藏"]["凭依华"] = {
    "变化「分福热水浴」",
    "变化「百鬼妖界之门」",
    "变化「二岩家的制裁」",
    "＊宇宙机密泄露！即刻处置＊",
    "化火符「妖怪弹幕变化 叶叶烨烨」",
    "槌化符「大判小判弹幕变化」",
    "雷化符「务光与叶叶的弹幕变化」",
    "龙化符「Dragon's Alien Capsule」（巨龙外星人胶囊）",
    "化符「妖怪弹幕变化 梦见心地」"
}

scZh["秦心"] = {}
scZh["秦心"]["心绮楼"] = {
    "怒面「愤怒的忌狼之面」",
    "凭依「喜怒哀乐Possession」（喜怒哀乐附体）",
    "忧面「杞人忧地」",
    "「假面丧心舞 暗黑能乐」",
    "忧符「忧世之苦不绝如轮」",
    "喜符「昂扬的神乐狮子」",
    "怒符「愤怒的忌狼之面」",
    "「Monkey Possession」（猿猴凭依）"
}
scZh["秦心"]["深秘录"] = {
    "怒面「愤怒的忌狼之面」",
    "凭依「喜怒哀乐附体」",
    "忧面「杞人忧地」",
    "＊就算这样我也漂亮吧？＊",
    "＊裂口的感情＊"
}
scZh["秦心"]["凭依华"] = {
    "怒面「愤怒的忌狼之面」",
    "凭依「喜怒哀乐附体」",
    "忧面「杞人忧地」",
    "＊就算这样我也漂亮吧？＊",
    "水面符「水泡弹假面舞会」",
    "面风符「喜怒哀乐风水术」",
    "面符「喜怒哀乐发狂假面舞会」"
}

scZh["若鹭姬"] = {}
scZh["若鹭姬"]["辉针城"] = {
    "水符「Tail Fin Slap」（尾鳍拍击）",
    "鳞符「Scale Wave」（鳞之波）",
    "鳞符「逆鳞的惊涛」",
    "鳞符「逆鳞的大惊涛」"
}
scZh["若鹭姬"]["天邪鬼"] = {
    "水符「Lunatic Red Slap」（红月拍击）",
    "潮符「湖中的潮汐波」",
    "鱼符「School of Fish」（鱼群）"
}

scZh["赤蛮奇"] = {}
scZh["赤蛮奇"]["辉针城"] = {
    "飞符「Flying Head」（飞行之头）",
    "首符「Close-Eye Shot」（闭目射击）",
    "首符「辘轳首飞来」",
    "飞头「Multiplicative Head」（倍增之头）",
    "飞头「Seventh Head」（第七个头）",
    "飞头「Ninth Head」（第九个头）",
    "飞头「Dullahan Night」（杜拉罕之夜）"
}
scZh["赤蛮奇"]["天邪鬼"] = {
    "飞首「Extreme Long Neck」（极长的脖子）",
    "眼光「Hell's Ray」（地狱之光）",
    "飞首「Twin Rokuro Head」（二重轱辘首）"
}

scZh["今泉影狼"] = {}
scZh["今泉影狼"]["辉针城"] = {
    "牙符「月下的犬齿」",
    "变身「Triangle Fang」（三角齿）",
    "变身「Star Fang」（星形齿）",
    "咆哮「Strange Roar」（陌生的咆哮）",
    "咆哮「満月的远吠」",
    "狼符「Star Ring Pounce」（星环猛扑）",
    "天狼「High-Speed Pounce」（高速猛扑）"
}
scZh["今泉影狼"]["天邪鬼"] = {
    "满月「Full Moon Roar」（满月咆哮）",
    "狼牙「渴望鲜血的狼牙」"
}

scZh["九十九姐妹"] = {}
scZh["九十九姐妹"]["辉针城"] = {
    "弦乐「风暴的Ensemble」（风暴的合奏）",
    "弦乐「净琉璃世界」"
}

scZh["九十九弁弁"] = {}
scZh["九十九弁弁"]["辉针城"] = {
    "平曲「祗园精舍的钟声」",
    "怨灵「无耳芳一」",
    "怨灵「平家的大怨灵」",
    "乐符「邪恶的五线谱」",
    "乐符「凶恶的五线谱」",
    "乐符「Double Score」（双重乐谱）"
}
scZh["九十九弁弁"]["天邪鬼"] = {
    "音符「大热唱琵琶」",
    "乐谱「Score Web」（乐谱之网）",
    "两吟「星辰降落之歌」"
}

scZh["九十九八桥"] = {}
scZh["九十九八桥"]["辉针城"] = {
    "琴符「诸行无常的琴声」",
    "响符「平安的残响」",
    "响符「Echo Chamber」（回音之庭）",
    "筝曲「下克上送筝曲」",
    "筝曲「下克上Requiem」（下克上安魂曲）"
}
scZh["九十九八桥"]["天邪鬼"] = {
    "琴符「天之诏琴」",
    "哀歌「人琴俱亡」",
    "两吟「星辰降落之歌」"
}

scZh["鬼人正邪"] = {}
scZh["鬼人正邪"]["辉针城"] = {
    "欺符「逆针击」",
    "逆符「镜之国的弹幕」",
    "逆符「Evil in the Mirror」（镜中的邪恶）",
    "逆符「天地有用」",
    "逆符「天下翻覆」",
    "逆弓「天壤梦弓」",
    "逆弓「天壤梦弓的诏敕」",
    "逆转「Reverse Hierarchy」（阶级反转）",
    "逆转「Change Air Brave」（变革空勇士）"
}

scZh["少名针妙丸"] = {}
scZh["少名针妙丸"]["辉针城"] = {
    "小弹「小人的道路」",
    "小弹「小人的荆棘路」",
    "小槌「变大吧」",
    "小槌「变得更大吧」",
    "妖剑「辉针剑」",
    "小槌「你给我变大吧」",
    "「进击的小人」",
    "「Wall of Issun」（一寸之壁）",
    "「Hop-o'-My-Thumb Seven」（七个小人）",
    "「七个一寸法师」"
}
scZh["少名针妙丸"]["天邪鬼"] = {
    "「小人的地狱」",
    "辉针「杀鬼刺双目之针」"
}
scZh["少名针妙丸"]["深秘录"] = {
    "小槌「传说中的大宴席」",
    "小人「一寸法师亦有五分之魂」",
    "钓符「可爱的太公望」",
    "＊绿巨人啊，变大吧！＊",
    "大渔「空中大回转钓鱼法」",
    "＊幻之国不来夫斯库＊"
}
scZh["少名针妙丸"]["凭依华"] = {
    "小槌「传说中的大宴席」",
    "小人「一寸法师亦有五分之魂」",
    "钓符「可爱的太公望」",
    "＊绿巨人啊，变大吧！＊",
    "槌化符「大判小判弹幕变化」",
    "升槌符「载着我们的梦变大吧」",
    "坠槌符「梦坠入大气圈变大吧」",
    "「全小人族的绯想天」",
    "狂槌符「狂视幻象（Disorder Eye）也变大吧」（混乱之眼）",
    "槌恋符「大判小判叮叮当心」",
    "槌砾符「大判小判叮叮当念力」"
}

scZh["堀川雷鼓"] = {}
scZh["堀川雷鼓"]["辉针城"] = {
    "一鼓「暴乱宫太鼓」",
    "二鼓「怨灵绫鼓」",
    "三鼓「午夜零时的Three strikes」（午夜零时的三振）",
    "死鼓「Land Percuss」（轻敲大地）",
    "五鼓「雷电拨浪鼓」",
    "六鼓「Alternate Sticking」（交替打击法）",
    "七鼓「高速和太鼓Rocket」（高速和太鼓火箭）",
    "八鼓「雷神之怒」",
    "「Blue Lady Show」（蓝色佳人的演出）",
    "「Pristine beat」（原初的节拍）"
}
scZh["堀川雷鼓"]["天邪鬼"] = {
    "雷符「愤怒的雷电拨浪鼓」",
    "太鼓「Fantastic Woofer」（梦幻低音炮）"
}

scZh["茨木华扇"] = {}
scZh["茨木华扇"]["深秘录"] = {
    "包符「假肢变形」",
    "龙符「Dragon's Growl」（龙啸）",
    "鹰符「Hawk Beacon」（雄鹰信标）",
    "＊猿之手啊！捏碎敌人！＊",
    "雷符「低速的务光」",
    "虎符「两门的彭祖」",
    "＊到死都会实现愿望的猴爪＊",
    "＊猿之手会做一个神秘的梦＊"
}
scZh["茨木华扇"]["凭依华"] = {
    "包符「假肢变形」",
    "龙符「Dragon's Growl」（龙啸）",
    "鹰符「Hawk Beacon」（雄鹰信标）",
    "＊猿之手啊！捏碎敌人！＊",
    "灵鹰符「飞鹰的梦想封印狩猎」",
    "雷灵符「务光的雷弹梦想封印」",
    "龙蹴符「巨龙飞鸟井之踢」",
    "雷化符「务光与叶叶的弹幕变化」",
    "龙化符「Dragon's Alien Capsule」（巨龙外星人胶囊）",
    "雷符「务光的雷霆闪光梦幻弹」",
    "龙符「Dragon's Optical Dream」（巨龙光学迷梦）"
}

scZh["宇佐见堇子"] = {}
scZh["宇佐见堇子"]["深秘录"] = {
    "枪符「3D Printer Gun」（3D打印枪）",
    "念力「Psychokinesis APP」",
    "念力「Telekinesis 电波塔」",
    "＊幻视吧！目睹异世界的狂气＊",
    "念力「Psycho Plosion」（精神爆发）",
    "念力「Telekinesis 非法投掷物」",
    "＊现世的神秘主义者＊",
    "＊深秘的七大不可思议＊"
}
scZh["宇佐见堇子"]["凭依华"] = {
    "枪符「3D Printer Gun」（3D打印枪）",
    "念力「Psychokinesis APP」",
    "念力「Telekinesis 电波塔」",
    "＊幻视吧！目睹异世界的狂气＊",
    "超能力「Psychokinesis Endless」（念力无限）",
    "梦砾符「羊毛色的念力」",
    "W超能力「Phychokinesis Teleportation」（念力传动）",
    "W超能力「绝体绝命都市人」",
    "「世纪的二重超人 宇佐见堇子」",
    "槌砾符「大判小判叮叮当念力」"
}

scZh["清兰"] = {}
scZh["清兰"]["绀珠传"] = {
    "凶弹「Speed Strike」（高速撞击）",
    "弹符「Eagle Shooting」（射鹰）",
    "弹符「鹰已击中」",
    "铳符「Lunatic Gun」（月狂之枪）"
}

scZh["铃瑚"] = {}
scZh["铃瑚"]["绀珠传"] = {
    "兔符「Strawberry Dango」（草莓团子）",
    "兔符「Berry Berry Dango」（浆果浆果团子）",
    "兔符「Dango Influence」（团子影响力）",
    "月见「September Fullmoon」（九月的满月）",
    "月见酒「Lunatic September」（月狂的九月）"
}

scZh["哆来咪"] = {}
scZh["哆来咪"]["绀珠传"] = {
    "梦符「绯红色的噩梦」",
    "梦符「绯红色的压迫噩梦」",
    "梦符「蔚蓝色的愁梦」",
    "梦符「蔚蓝色的愁三重梦」",
    "梦符「愁永远之梦」",
    "梦符「刈安色的迷梦」",
    "梦符「刈安色的错综迷梦」",
    "梦符「Dream Catcher」（捕梦网）",
    "梦符「苍蓝色的Dream Catcher」（苍蓝色的捕梦网）",
    "梦符「梦我梦中」",
    "月符「绀色的狂梦」",
    "蝴蝶「Butterfly Supplantation」（取而代之的蝴蝶）",
    "超特急「Dream Express」（梦幻快车）",
    "爬梦「Creeping Bullet」（爬行的子弹）"
}
scZh["哆来咪"]["凭依华"] = {
    "梦符「留绀色的逃走梦」",
    "梦符「漆黑的宇宙梦」",
    "羊符「Nightmare of Chimera」（奇美拉的恶梦）",
    "＊不再醒来比较好哦＊",
    "超能力「Psychokinesis Endless」（念力无限）",
    "梦砾符「羊毛色的念力」",
    "灵符「梦想封印 梦限」",
    "星符「Asteroid Belt Nightmare」（小行星带恶梦）",
    "梦要符「羊毛色的乾坤一掷」",
    "面符「喜怒哀乐发狂假面舞会」",
    "化符「妖怪弹幕变化 梦见心地」",
    "光符「引导着你的梦王道的威光」",
    "击符「被韦驮天追逐的正梦」",
    "雷符「务光的雷霆闪光梦幻弹」",
    "龙符「Dragon's Optical Dream」（巨龙光学迷梦）",
    "升符「飞向遥远的宇宙吧！ 载着我们的梦想」",
    "坠符「落入大气圈，梦想倾泻地表」",
    "「把大地重塑成，有梦的世界吧！」"
}

scZh["稀神探女"] = {}
scZh["稀神探女"]["绀珠传"] = {
    "玉符「乌合之咒」",
    "玉符「乌合的逆咒」",
    "玉符「乌合的二重咒」",
    "玉符「秽身探知型水雷」",
    "玉符「秽身探知型水雷　改」",
    "玉符「众神的弹冠」",
    "玉符「众神的光辉弹冠」",
    "「孤翼的白鹭」"
}

scZh["克劳恩皮丝"] = {}
scZh["克劳恩皮丝"]["绀珠传"] = {
    "狱符「Hell Eclipse」（地狱月食）",
    "狱符「地狱之蚀」",
    "狱符「Flash and Stripe」（闪光与条纹）",
    "狱符「Star and Stripe」（星与条纹）",
    "狱炎「Graze Inferno」（擦弹地狱火）",
    "狱炎「擦弹的狱意」",
    "地狱「Striped Abyss」（条纹状的深渊）",
    "「Fake Apollo」（伪阿波罗）",
    "「Apollo捏造说」（阿波罗捏造说）"
}

scZh["纯狐"] = {}
scZh["纯狐"]["绀珠传"] = {
    "「掌上的纯光」",
    "「杀意的百合」",
    "「原始的神灵界」",
    "「现代的神灵界」",
    "「战栗的寒冷之星」",
    "「纯粹的狂气」",
    "「溢出的瑕秽」",
    "「地上秽的纯化」",
    "纯符「Purely Bullet Hell」（单纯的子弹地狱）",
    "纯符「纯粹的弹幕地狱」",
    "「用于逼死瓮中鼠的单纯弹幕」",
    "「用于杀人的纯粹弹幕」",
    "「最初与最后的无名弹幕」"
}

scZh["赫卡提亚"] = {}
scZh["赫卡提亚"]["绀珠传"] = {
    "异界「逢魔之刻」",
    "地球「邪秽在身」",
    "月「Apollo反射镜」（阿波罗反射镜）",
    "异界「地狱的Non-ideal弹幕」（地狱的非理想弹幕）",
    "地球「落向地狱的雨」",
    "月「Lunatic Impact」（月狂冲击）",
    "「Trinitarian Rhapsody」（三位一体论狂想曲）",
    "「最初与最后的无名弹幕」"
}

scZh["依神女苑"] = {}
scZh["依神女苑"]["凭依华"] = {
    "凭依剥夺「Slave Robber」（下仆掠夺者）",
    "贫符「超贫穷玉」",
    "「Queen of Bubble」（泡沫女王）",
    "「80年代的勒索者」",
    "不幸「欢迎来到极端贫困的世界」",
    "财祸「Pluck Pigeon」（雁过拔毛）",
    "凭依交换「Absolute Loser」（绝对输家）",
    "「最强最棒的异变解决巫女」"
}

scZh["依神紫苑"] = {}
scZh["依神紫苑"]["凭依华"] = {
    "不幸「欢迎来到极端贫困的世界」",
    "财祸「Pluck Pigeon」（雁过拔毛）",
    "凭依交换「Absolute Loser」（绝对输家）",
    "贫符「Mischance Scatter」（厄运播撒）",
    "「最凶最恶的极贫不幸神」"
}

scZh["爱塔"] = {}
scZh["爱塔"]["天空璋"] = {
    "蝶符「Minute Scales」（细碎鳞粉）",
    "蝶符「凤蝶的鳞粉」",
    "蝶符「Fluttering Summer」（扑翅之夏）",
    "蝶符「盛夏振翅」"
}

scZh["坂田合欢乃"] = {}
scZh["坂田合欢乃"]["天空璋"] = {
    "雨符「被囚禁的秋雨」",
    "雨符「被诅咒的暴雨」",
    "刃符「山姥的菜刀研磨」",
    "刃符「山姥的鬼菜刀研磨」",
    "尽符「Mountain Murder」（深山谋杀）",
    "尽符「Bloody Mountain Murder」（血腥的深山谋杀）"
}

scZh["莉莉"] = {}
scZh["莉莉"]["天空璋"] = {
    "春符「Surprise Spring」（惊喜之春）"
}

scZh["高丽野阿吽"] = {}
scZh["高丽野阿吽"]["天空璋"] = {
    "犬符「野犬的散步」",
    "狗符「山狗的散步」",
    "独乐「狛犬旋转」",
    "独乐「Curl Up and Die」（蜷缩而死）",
    "狛符「单人式阿吽的呼吸」"
}

scZh["矢田寺成美"] = {}
scZh["矢田寺成美"]["天空璋"] = {
    "魔符「Instant Bodhi」（顷刻菩提）",
    "魔符「即席菩提」",
    "魔符「Bullet Golem」（弹丸魔像）",
    "魔符「作宠物的巨大弹生命体」",
    "地藏「Criminal Salvation」（罪业救赎）",
    "地藏「业火救济」"
}

scZh["尔子田里乃"] = {}
scZh["尔子田里乃"]["天空璋"] = {
    "茗荷「Forget Your Name」（忘却你的名字）",
    "冥加「Behind You」（在你背后）",
    "舞符「Behind Festival」（背后之祭）",
    "狂舞「天狗怖吓」",
    "狂舞「狂乱天狗怖吓」",
    "鼓舞「Powerful Cheers」（强力助威）",
    "狂舞「Crazy Back Dance」（疯狂的背景舞）",
    "弹舞「双目台风」"
}

scZh["丁礼田舞"] = {}
scZh["丁礼田舞"]["天空璋"] = {
    "竹符「Bamboo Spear Dance」（竹矛之舞）",
    "竹符「Bamboo Crazy Dance」（竹之狂舞）	竹符「バンブークレイジーダンス」",
    "笹符「Tanabata Star Festival」（七夕星祭）",
    "舞符「Behind Festival」（背后之祭）",
    "狂舞「天狗怖吓」",
    "狂舞「狂乱天狗怖吓」",
    "鼓舞「Powerful Cheers」（强力助威）",
    "狂舞「Crazy Back Dance」（疯狂的背景舞）",
    "弹舞「双目台风」"
}

scZh["摩多罗隐岐奈"] = {}
scZh["摩多罗隐岐奈"]["天空璋"] = {
    "后符「秘神的后光」",
    "后符「绝对秘神的后光」",
    "里夏「Scorch by Hot Summer」（暑夏炙烤）",
    "里夏「异常酷暑之焦土」",
    "里秋「Die of Famine」（死于饥荒）",
    "里秋「异常枯死之饿鬼」",
    "里冬「Black Snowman」（黑色雪人）",
    "里冬「异常降雪之雪人」",
    "里春「April Wizard」（四月巫师）",
    "里春「异常落花之魔术使」",
    "「里·Breezy Cherry Blossom」（里·吹拂樱花）",
    "「里·Perfect Summer Ice」（里·完美夏冰）",
    "「里·Crazy Fall Wind」（里·疯狂秋风）",
    "「里·Extreme Winter」（里·极端寒冬）",
    "秘仪「Reverse Invoker」（逆向呼神者）",
    "秘仪「背叛的后方射击」",
    "秘仪「弹幕的玉茧」",
    "秘仪「秽那之火」",
    "秘仪「后户的狂言」",
    "秘仪「Matarah Dukkha」（摩多罗苦谛）",
    "秘仪「七星之剑」",
    "秘仪「无纽带的艺人」",
    "「背面的暗黑猿乐」",
    "「Anarchy Bullet Hell」（无秩序弹幕地狱）"
}

scZh["绵月依姬"] = {}
scZh["绵月依姬"]["儚月抄"] = {
    "「火雷神」",
    "「金山彦命」",
    "「天津瓮星」",
    "「石凝姥命」",
    "「天宇受卖命」",
    "「天照大御神」",
    "「伊豆能卖」"
}

return scZh