--符卡中文
local scZh = {}

scZh["博丽灵梦"] = {}
scZh["博丽灵梦"]["红魔乡"] = {
    [1] = "灵符「梦想封印」",
    [2] = "梦符「封魔阵」",
    ["n"] = 2
}
scZh["博丽灵梦"]["妖妖梦"] = {
    [1] = "灵符「梦想封印　散」",
    [2] = "灵符「梦想封印　集」",
    [3] = "梦符「封魔阵」",
    [4] = "梦符「二重结界」",
    ["n"] = 4
}
scZh["博丽灵梦"]["萃梦想"] = {
    [1] = "灵符「梦想妙珠」",
    [2] = "神灵「梦想封印」",
    [3] = "梦符「封魔阵」",
    [4] = "神技「八方鬼缚阵」",
    [5] = "宝符「阴阳宝玉」",
    [6] = "宝具「阴阳鬼神玉」",
    [7] = "符之一「梦想妙珠连」",
    [8] = "符之二「阴阳散华」",
    [9] = "符之三「魔净闪结」",
    [10] = "力符「阴阳玉将」",
    [11] = "梦战「幻想之月」",
    [12] = "无题「飞翔于天空的不可思议的巫女」",
    ["n"] = 12
}
scZh["博丽灵梦"]["永夜抄"] = {
    [1] = "灵符「梦想妙珠」",
    [2] = "神灵「梦想封印　瞬」",
    [3] = "梦符「二重结界」",
    [4] = "梦境「二重大结界」",
    [5] = "灵符「梦想封印　散」",
    [6] = "散灵「梦想封印　寂」",
    [7] = "梦符「封魔阵」",
    [8] = "神技「八方鬼缚阵」",
    [9] = "神技「八方龙杀阵」",
    [10] = "灵符「梦想封印　集」",
    [11] = "回灵「梦想封印　侘」",
    [12] = "境界「二重弹幕结界」",
    [13] = "大结界「博丽弹幕结界」",
    [14] = "神灵「梦想封印　瞬」",
    [15] = "「梦想天生」",
    ["n"] = 15
}
scZh["博丽灵梦"]["花映塚"] = {
    [1] = "灵符「阴阳印」",
    [2] = "灵符「梦想封印」",
    [3] = "灵符「博丽幻影」",
    ["n"] = 3
}
scZh["博丽灵梦"]["绯想天"] = {
    [1] = "祈愿「祛除厄运之祈愿」",
    [2] = "宝符「跳跃的阴阳玉」",
    [3] = "梦境「二重大结界」",
    [4] = "光灵「神灵宝珠」",
    [5] = "「潜伏在境界内侧的灵与不可思议的巫女」",
    [6] = "灵符「梦想妙珠」",
    [7] = "神灵「梦想封印」",
    [8] = "神技「八方鬼缚阵」",
    [9] = "珠符「明珠暗投」",
    [10] = "宝符「阴阳宝玉」",
    [11] = "宝具「阴阳鬼神玉」",
    [12] = "神技「天霸风神脚」",
    [13] = "「梦想天生」",
    ["n"] = 13
}
scZh["博丽灵梦"]["地灵殿"] = {
    [1] = "「违背常识的另一侧」",
    [2] = "「萃灵花」",
    [3] = "「乌鸦的暗影」",
    ["n"] = 3
}
scZh["博丽灵梦"]["星莲船"] = {
    [1] = "梦符「退魔符乱舞」",
    [2] = "灵符「梦想封印」",
    ["n"] = 2
}
scZh["博丽灵梦"]["非想天则"] = {
    [1] = "御守「妖怪拘禁符」",
    [2] = "灵符「梦想封印　圆」",
    [3] = "神灵「梦想封印　瞬」",
    [4] = "「最凶恶的吓人巫女玉」",
    [5] = "梦符「封魔阵」",
    [6] = "结界「扩散结界」",
    ["n"] = 6
}
scZh["博丽灵梦"]["文花帖DS"] = {
    [1] = "灵札「报刊推销团降服」",
    [2] = "结界「Paparazzi击退结界」（狗仔队击退结界）",
    [3] = "梦符「梦想亚空穴」",
    ["n"] = 3
}
scZh["博丽灵梦"]["神灵庙"] = {
    [1] = "灵符「梦想封印」",
    ["n"] = 1
}
scZh["博丽灵梦"]["心绮楼"] = {
    [1] = "御札「神社繁盛祈愿札」",
    [2] = "御札「梦幻的高速祈愿札」",
    [3] = "御札「对妖怪方位清除」",
    [4] = "「信仰心增加祈愿之仪」",
    [5] = "「二大宗教九字护身法」",
    [6] = "「面灵气大降服」",
    [7] = "「最后的Trinity Religion」（最后的三位一体宗教）",
    [8] = "灵符「梦想封印」",
    [9] = "宝具「阴阳飞鸟井」",
    [10] = "神技「八方龙杀阵」",
    [11] = "「梦想天生」",
    ["n"] = 11
}
scZh["博丽灵梦"]["辉针城"] = {
    [1] = "妖器「无情的驱魔棒」",
    [2] = "灵符「梦想封印」",
    ["n"] = 2
}
scZh["博丽灵梦"]["天邪鬼"] = {
    [1] = "神签「犯规结界」",
    [2] = "「Persuasion Needle」（信仰之针）",
    ["n"] = 2
}
scZh["博丽灵梦"]["天邪鬼GR"] = {
    [1] = "「犯规结界」",
    [2] = "「最接近天堂的赛钱」",
    [3] = "「弹幕富翁」",
    ["n"] = 3
}
scZh["博丽灵梦"]["深秘录"] = {
    [1] = "灵符「梦想封印」",
    [2] = "神技「八方龙杀阵」",
    [3] = "宝具「阴阳飞鸟井」",
    [4] = "＊在那缝隙里面居然有个巫女！＊",
    [5] = "结界「人至之处的青山」",
    [6] = "针符「封印月卿之针」",
    [7] = "结界「粗暴的世界裂隙」",
    [8] = "结界「幻想Boundary Crack」（幻想结界缝隙）",
    ["n"] = 8
}
scZh["博丽灵梦"]["绀珠传"] = {
    [1] = "灵符「梦想封印」",
    ["n"] = 1
}
scZh["博丽灵梦"]["凭依华"] = {
    [1] = "灵符「梦想封印」",
    [2] = "神技「八方龙杀阵」",
    [3] = "宝具「阴阳飞鸟井」",
    [4] = "＊在那缝隙里面居然有个巫女！＊",
    [5] = "灵鹰符「飞鹰的梦想封印狩猎」",
    [6] = "风灵符「磐舟土器封印」",
    [7] = "星灵符「Sprinkle Star封印」（洒星封印）",
    [8] = "雷灵符「务光的雷弹梦想封印」",
    [9] = "龙蹴符「巨龙飞鸟井之踢」",
    [10] = "针星符「封印月卿之针火花」",
    [11] = "「这不知是第几次的生命，梦想封印吧」",
    [12] = "灵符「梦想封印　梦限」",
    [13] = "「完全凭依与梦想封印」",
    [14] = "「凭坐主役与神灵下仆的境界」",
    [15] = "「最强最棒的异变解决巫女」",
    ["n"] = 15
}
scZh["博丽灵梦"]["天空璋"] = {
    [1] = "灵符「梦想樱花封印」",
    ["n"] = 1
}
scZh["博丽灵梦"]["噩梦日记"] = {
    [1] = "「偷拍者降服极限火花」",
    [2] = "「来自背后的偷拍者降服」",
    [3] = "「未经许可的弹幕禁止摄影」",
    ["n"] = 3
}
scZh["博丽灵梦"]["儚月抄"] = {
    [1] = "「大祸津日」",
    ["n"] = 1
}
scZh["博丽灵梦"]["东方LWC"] = {
    [1] = "梦符「幻想一重」",
    ["n"] = 1
}

scZh["雾雨魔理沙"] = {}
scZh["雾雨魔理沙"]["红魔乡"] = {
    [1] = "魔符「Stardust Reverie」（星尘幻想）",
    [2] = "恋符「Master Spark」（极限火花）",
    ["n"] = 2
}
scZh["雾雨魔理沙"]["妖妖梦"] = {
    [1] = "魔符「Stardust Reverie」（星尘幻想）",
    [2] = "魔符「Milky Way」（银河）",
    [3] = "恋符「Non-Directional Laser」（非定向光线）",
    [4] = "恋符「Master Spark」（极限火花）",
    ["n"] = 4
}
scZh["雾雨魔理沙"]["萃梦想"] = {
    [1] = "恋符「Master Spark」（极限火花）",
    [2] = "魔炮「Final Spark」（究极火花）",
    [3] = "魔符「Stardust Reverie」（星尘幻想）",
    [4] = "彗星「Blazing Star」（彗星）",
    [5] = "仪符「Orrery's Sun」（太阳仪）",
    [6] = "天仪「Orrery's Solar System」（太阳系仪）",
    [7] = "符之一「Stardust Reverie」（星尘幻想）",
    [8] = "符之二「Asteroid Belt」（小行星带）",
    [9] = "符之三「Master Spark」（极限火花）",
    [10] = "星符「Dragon Meteor」（龙陨石）",
    ["n"] = 10
}
scZh["雾雨魔理沙"]["永夜抄"] = {
    [1] = "恋符「Master Spark」（极限火花）",
    [2] = "魔炮「Final Spark」（究极火花）",
    [3] = "魔符「Milky Way」（银河）",
    [4] = "魔空「Asteroid Belt」（小行星带）",
    [5] = "魔符「Stardust Reverie」（星尘幻想）",
    [6] = "黑魔「Event Horizon」（黑洞边缘）",
    [7] = "恋符「Non-Directional Laser」（非定向光线）",
    [8] = "恋风「Starlight Typhoon」（星光台风）",
    [9] = "恋符「Master Spark」（极限火花）",
    [10] = "恋心「Double Spark」（二重火花）",
    [11] = "光符「Earth Light Ray」（地球光）",
    [12] = "光击「Shoot the Moon」（射月）",
    [13] = "魔炮「Final Spark」（究极火花）",
    [14] = "魔炮「Final Master Spark」（超究极火花）",
    [15] = "「Blazing Star」（彗星）",
    ["n"] = 15
}
scZh["雾雨魔理沙"]["花映塚"] = {
    [1] = "魔符「Stardust」（星尘）",
    [2] = "魔符「Stardust Reverie」（星尘幻想）",
    [3] = "魔符「Illusion Star」（幻想之星）",
    ["n"] = 3
}
scZh["雾雨魔理沙"]["绯想天"] = {
    [1] = "星符「Polaris Unique」（唯一的北极星）",
    [2] = "天仪「Orrery's Universe」（银河系仪）",
    [3] = "邪恋「容易结果的Master Spark」（容易结果的极限火花）",
    [4] = "恋符「Master Spark」（极限火花）",
    [5] = "星符「Dragon Meteor」（龙星群）",
    [6] = "魔符「Stardust Reverie」（星尘幻想）",
    [7] = "魔炮「Final Spark」（究极火花）",
    [8] = "彗星「Blazing Star」（彗星）",
    [9] = "星符「Escape Velocity」（第二宇宙速度）",
    [10] = "星符「Meteonic Shower」（流星雨）",
    [11] = "光符「Luminous Strike」（声光冲击）",
    [12] = "仪符「Orrery's Sun」（太阳仪）",
    [13] = "邪恋「容易结果的Master Spark」（容易结果的极限火花）",
    ["n"] = 13
}
scZh["雾雨魔理沙"]["地灵殿"] = {
    [1] = "「Remote Sacrifice」（遥控的牺牲）",
    [2] = "「Five Season」（五个季节）",
    [3] = "「Optical Camouflage」（光学迷彩）",
    ["n"] = 3
}
scZh["雾雨魔理沙"]["星莲船"] = {
    [1] = "恋符「Master Spark」（极限火花）",
    [2] = "魔符「Ultimate Shortwave」（终极短波）",
    ["n"] = 2
}
scZh["雾雨魔理沙"]["非想天则"] = {
    [1] = "星符「Eccentric Asteroid」（离心的小行星）",
    [2] = "流光「Shooting Echo」（射击回声）",
    [3] = "魔符「Magical R360」（魔法全方位）",
    [4] = "星符「Gravity Beat」（重力之击）",
    [5] = "光符「Earth Light Ray」（地球光）",
    [6] = "恋符「Non-Directional Laser」（非定向光线）",
    [7] = "魔废「Deep Ecological Bomb」（深层生态炸弹）",
    ["n"] = 7
}
scZh["雾雨魔理沙"]["文花帖DS"] = {
    [1] = "星符「Oort Cloud」（奥尔特云）",
    [2] = "天仪「Orrery's Solar System」（太阳系仪）",
    [3] = "彗星「Blazing Star」（彗星）",
    ["n"] = 3
}
scZh["雾雨魔理沙"]["大战争"] = {
    [1] = "光符「Mysterious Beam」（神秘光束）",
    [2] = "光击「Shoot the Little Moon」（射向幼月）",
    [3] = "魔弹「Test Slave」（试验用使魔）",
    [4] = "闭符「Big Crunch」（大坍缩）",
    [5] = "恋符「Master Spark一般的手电筒」（极限火花一般的手电筒）",
    [6] = "魔开「Open Universe」（开放宇宙）",
    [7] = "魔十字「Grand Cross」（大十字）",
    [8] = "流星「Super Perseids」（超级英仙座）",
    [9] = "「Blazing Star一般的捉迷藏」（彗星一般的捉迷藏）",
    [10] = "「妖精尽灭光」",
    ["n"] = 10
}
scZh["雾雨魔理沙"]["神灵庙"] = {
    [1] = "恋符「Master Spark」（极限火花）",
    ["n"] = 1
}
scZh["雾雨魔理沙"]["心绮楼"] = {
    [1] = "恋符「Master Spark」（极限火花）",
    [2] = "彗星「Blazing Star」（彗星）",
    [3] = "星符「Satellite Illusion」（卫星幻觉）",
    [4] = "「Sungrazer」（掠日彗星）",
    [5] = "星符「Millisecond Pulsar」（毫秒脉冲星）",
    [6] = "魔符「Blaze Away」（连续射击）",
    ["n"] = 6
}
scZh["雾雨魔理沙"]["辉针城"] = {
    [1] = "妖器「Dark Spark」（黑暗火花）",
    [2] = "Magic Absorber（魔法吸收器）",
    ["n"] = 2
}
scZh["雾雨魔理沙"]["天邪鬼"] = {
    [1] = "恋符「Wide Master」（广域极限火花）",
    [2] = "恋符「Machine Gun Spark」（机枪火花）",
    ["n"] = 2
}
scZh["雾雨魔理沙"]["深秘录"] = {
    [1] = "恋符「Master Spark」（极限火花）",
    [2] = "彗星「Blazing Star」（彗星）",
    [3] = "星符「Satellite Illusion」（卫星幻觉）",
    [4] = "＊真棒！厕所里的花子小姐＊",
    [5] = "星符「Occultation」（掩星）",
    [6] = "＊被诅咒的历代校长的肖像＊",
    [7] = "＊夜间学校怪谈云游＊",
    ["n"] = 7
}
scZh["雾雨魔理沙"]["绀珠传"] = {
    [1] = "恋符「Master Spark」",
    ["n"] = 1
}
scZh["雾雨魔理沙"]["凭依华"] = {
    [1] = "恋符「Master Spark」（极限火花）",
    [2] = "彗星「Blazing Star」（彗星）",
    [3] = "星符「Satellite Illusion」（卫星幻觉）",
    [4] = "＊真棒！厕所里的花子小姐＊",
    [5] = "星恋符「Sprinkle Star & Heart」（星星心心洒）",
    [6] = "拳星符「入道丛云Slave Spark」（入道丛云下仆火花）",
    [7] = "星灵符「Sprinkle Star封印」（洒星封印）",
    [8] = "针星符「封印月卿之针火花」",
    [9] = "星符「Asteroid Belt Nightmare」（小行星带恶梦）",
    ["n"] = 9
}
scZh["雾雨魔理沙"]["天空璋"] = {
    [1] = "恋符「Master Spark Frozen」",
    ["n"] = 1
}
scZh["雾雨魔理沙"]["噩梦日记"] = {
    [1] = "「偷拍者降服极限火花」",
    [2] = "「击穿弹幕结界吧！」",
    [3] = "「卑鄙者极限火花」",
    ["n"] = 3
}
scZh["雾雨魔理沙"]["儚月抄"] = {
    [1] = "「Stardust Reverie」（星尘幻想）",
    [2] = "「Event Horizon」（黑洞边缘）",
    [3] = "「Final Spark」（究极火花）",
    [4] = "「Double Spark」（二重火花）",
    ["n"] = 4
}

scZh["露米娅"] = {}
scZh["露米娅"]["红魔乡"] = {
    [1] = "月符「Moonlight Ray」（月光）",
    [2] = "夜符「Night Bird」（夜雀）",
    [3] = "暗符「Demarcation」（境界线）",
    ["n"] = 3
}
scZh["露米娅"]["文花帖"] = {
    [1] = "暗符「Dark Side of the Moon」（月的阴暗面）",
    [2] = "夜符「Midnight Bird」（子夜之鸟）",
    ["n"] = 2
}

scZh["琪露诺"] = {}
scZh["琪露诺"]["红魔乡"] = {
    [1] = "冰符「Icicle Fall」（冰瀑）",
    [2] = "雹符「Hailstorm」（冰雹暴风）",
    [3] = "冻符「Perfect Freeze」（完美冻结）",
    [4] = "雪符「Diamond Blizzard」（钻石风暴）",
    ["n"] = 4
}
scZh["琪露诺"]["妖妖梦"] = {
    [1] = "冻符「Freeze Actress」‎",
    [2] = "霜符「Frost Columns」（冰袭方阵）",
    ["n"] = 2
}
scZh["琪露诺"]["花映塚"] = {
    [1] = "冻符「Perfect Freeze」（完美冻结）",
    [2] = "冻符「Cold Divinity」（冷冻之神）",
    ["n"] = 2
}
scZh["琪露诺"]["文花帖"] = {
    [1] = "雪符「Diamond Blizzard」（钻石风暴）",
    [2] = "冻符「Minus K」（负K）",
    ["n"] = 2
}
scZh["琪露诺"]["非想天则"] = {
    [1] = "冰符「Icicle Fall」（冰瀑）",
    [2] = "冻符「Minus K」（负K）",
    [3] = "冰符「Icicle Machine Gun」（冰柱机枪）",
    [4] = "冰符「Fairy Spin」（妖精旋转）",
    [5] = "冰块「Cold Sprinkler」（冷冻洒水器）",
    [6] = "冷体「Super Ice Kick」（超级回旋冰踢）",
    [7] = "冰符「Sword Freezer」（剑式制冰器）",
    [8] = "冻符「Freeze Atmosphere」（急冻大气）",
    [9] = "冷符「瞬间冷冻Beam」（瞬间冷冻光线）",
    [10] = "霜符「Frost Columns」（冰袭方阵）",
    [11] = "吹冰「Ice Tornado」（碎冰龙卷）",
    [12] = "冻符「Perfect Freeze」（完美冻结）",
    [13] = "冰块「Great Crusher」（巨冰破碎）",
    ["n"] = 13
}
scZh["琪露诺"]["大战争"] = {
    [1] = "Perfect Freeze（完美冻结）",
    ["n"] = 1
}
scZh["琪露诺"]["辉针城"] = {
    [1] = "冰符「Ultimate Blizzard」（终极暴风雪）",
    ["n"] = 1
}
scZh["琪露诺"]["天邪鬼"] = {
    [1] = "冰符「Perfect Glacialist」（完美冰川家）",
    [2] = "冰王「Frost King」（霜冻之王）",
    ["n"] = 2
}
scZh["琪露诺"]["天空璋"] = {
    [1] = "冰符「Cool Sunflower」（凉爽的向日葵）",
    ["n"] = 1
}

scZh["红美铃"] = {}
scZh["红美铃"]["红魔乡"] = {
    [1] = "华符「芳华绚烂」",
    [2] = "华符「Selaginella 9」（卷柏 9）",
    [3] = "虹符「彩虹的风铃」",
    [4] = "幻符「华想梦葛」",
    [5] = "彩符「彩雨」",
    [6] = "彩符「彩光乱舞」",
    [7] = "彩符「极彩台风」",
    ["n"] = 7
}
scZh["红美铃"]["萃梦想"] = {
    [1] = "彩符「彩光风铃」",
    [2] = "光符「华光玉」",
    [3] = "华符「破山炮」",
    [4] = "极彩「彩光乱舞」",
    [5] = "极光「华严明星」",
    [6] = "三华「崩山彩极炮」",
    ["n"] = 6
}
scZh["红美铃"]["文花帖"] = {
    [1] = "华符「彩光莲华掌」",
    [2] = "彩翔「飞花落叶」",
    [3] = "彩华「虹色太极拳」",
    ["n"] = 3
}
scZh["红美铃"]["非想天则"] = {
    [1] = "彩符「极彩沛雨」",
    [2] = "彩翔「飞花落叶」",
    [3] = "彩符「彩光风铃」",
    [4] = "虹符「烈虹真拳」",
    [5] = "气符「星脉弹」",
    [6] = "击符「大鹏拳」",
    [7] = "气符「地龙天龙脚」",
    [8] = "极彩「彩光乱舞」",
    [9] = "彩华「虹色太极拳」",
    [10] = "气符「猛虎内劲」",
    [11] = "星气「星脉地转弹」",
    [12] = "炽击「大鹏坠击拳」",
    [13] = "华符「彩光莲华掌」",
    ["n"] = 13
}

scZh["帕秋莉"] = {}
scZh["帕秋莉"]["红魔乡"] = {
    [1] = "火符「Agni Shine」（火神之光） ",
    [2] = "水符「Princess Undine」（水精公主） ",
    [3] = "木符「Sylphy Horn」（风灵的角笛） ",
    [4] = "土符「Lazy Trilithon」（慵懒三石塔） ",
    [5] = "金符「Metal Fatigue」（金属疲劳） ",
    [6] = "火符「Agni Shine上级」（火神之光 上级） ",
    [7] = "木符「Sylphy Horn上级」（风灵的角笛 上级） ",
    [8] = "土符「Lazy Trilithon上级」（慵懒三石塔 上级） ",
    [9] = "火符「Agni Radiance」（火神的光辉） ",
    [10] = "水符「Bury in Lake」（湖葬） ",
    [11] = "木符「Green Storm」（翠绿风暴） ",
    [12] = "土符「Trilithon Shake」（三石塔的震动） ",
    [13] = "金符「Silver Dragon」（银龙） ",
    [14] = "火&土符「Lava Cromlech」（环状熔岩带） ",
    [15] = "木&火符「Forest Blaze」（森林大火） ",
    [16] = "水&木符「Water Elf」（水精灵） ",
    [17] = "金&水符「Mercury Poison」（水银之毒） ",
    [18] = "土&金符「Emerald Megalith」（翡翠巨石） ",
    [19] = "月符「Silent Selene」（沉静的月神） ",
    [20] = "日符「Royal Flare」（皇家圣焰） ",
    [21] = "火水木金土符「贤者之石」 ",
    ["n"] = 21
}
scZh["帕秋莉"]["萃梦想"] = {
    [1] = "火金符「St. Elmo Pillar」（圣爱尔摩火柱）",
    [2] = "土水符「Noachian Deluge」（诺亚的大洪水）",
    [3] = "金木符「Elemental Harvester」（元素收获者）",
    [4] = "日符「Royal Flare」（皇家圣焰）",
    [5] = "月符「Silent Selene」（沉静的月神）",
    [6] = "火水木金土符「贤者之石」",
    [7] = "符之一「St. Elmo Explosion」（圣爱尔摩爆炸）",
    [8] = "符之二「Deluge Forty Day」（大洪水四十日）",
    [9] = "金土符「Ginger Gust」（淡黄色的阵风）",
    ["n"] = 9
}
scZh["帕秋莉"]["文花帖"] = {
    [1] = "日&水符「Hydrogenous Prominence」（氢化日珥）",
    [2] = "水&火符「Phlogistic Rain」（燃素之雨）",
    [3] = "月&木符「Satellite Himawari」（卫星向日葵）",
    [4] = "日&月符「Royal Diamond Ring」（皇家钻戒）",
    ["n"] = 4
}
scZh["帕秋莉"]["绯想天"] = {
    [1] = "火金符「St. Elmo Pillar」（圣爱尔摩火柱）",
    [2] = "土水符「Noachian Deluge」（诺亚的大洪水）",
    [3] = "金木符「Elemental Harvester」（元素收获者）",
    [4] = "日符「Royal Flare」（皇家圣焰）",
    [5] = "月符「Silent Selene」（沉静的月神）",
    [6] = "火水木金土符「贤者之石」",
    [7] = "水符「Jellyfish Princess」（水母公主）",
    [8] = "月木符「Satellite Himawari」（卫星向日葵）",
    [9] = "日木符「Photosynthesis」（光合作用）",
    [10] = "火符「Akiba Summer」（秋叶之夏）",
    [11] = "水符「Jellyfish Princess」（水母公主）",
    [12] = "月金符「Sunshine Reflector」（日光反射器）",
    ["n"] = 12
}
scZh["帕秋莉"]["非想天则"] = {
    [1] = "火水符「Phlogistic Pillar」（燃素之柱）",
    [2] = "土金符「Emerald Megalopolis」（翡翠巨城）",
    [3] = "日月符「Royal Diamond Ring」（皇家钻戒）",
    [4] = "火符「Ring of Agni」（火天神印）",
    [5] = "水符「Princess Undine」（水精公主）",
    ["n"] = 5
}

scZh["十六夜咲夜"] = {}
scZh["十六夜咲夜"]["红魔乡"] = {
    [1] = "奇术「Misdirection」（误导）",
    [2] = "奇术「幻惑Misdirection」（幻惑误导）",
    [3] = "幻在「Clock Corpse」（钟表的残骸）",
    [4] = "幻幽「Jack the Ludo Bile」（迷幻的杰克）",
    [5] = "幻象「Luna Clock」（月神之钟）",
    [6] = "幻世「The World」（世界）",
    [7] = "Maid秘技「操弄Doll」（女仆秘技「操弄玩偶」）",
    [8] = "Maid秘技「杀人Doll」（女仆秘技「杀人玩偶」）",
    [9] = "奇术「Eternal Meek」（永恒的温柔）",
    ["n"] = 9
}
scZh["十六夜咲夜"]["妖妖梦"] = {
    [1] = "幻符「Indiscriminate」（无差别伤害）",
    [2] = "幻符「杀人Doll」（杀人玩偶）",
    [3] = "时符「Perfect Square」（完美空间）",
    [4] = "时符「Private Square」（个人空间）",
    ["n"] = 4
}
scZh["十六夜咲夜"]["萃梦想"] = {
    [1] = "幻符「杀人Doll」（杀人玩偶）",
    [2] = "幻葬「夜雾幻影杀人鬼」",
    [3] = "时符「Private Square」（个人空间）",
    [4] = "「咲夜的世界」",
    [5] = "伤符「Inscribe Red Soul」（铭刻于红魂）",
    [6] = "伤魂「Soul Sculpture」（灵魂雕塑）",
    [7] = "符之一「连续杀人Doll」（连续杀人玩偶）",
    [8] = "符之二「Check-Maid」（扫除）",
    [9] = "魔术「Close-up杀人鬼」（极近距离杀人鬼）",
    ["n"] = 9
}
scZh["十六夜咲夜"]["永夜抄"] = {
    [1] = "幻符「杀人Doll」（杀人玩偶）",
    [2] = "幻葬「夜雾幻影杀人鬼」",
    [3] = "「Deflation World」（收缩的世界）",
    ["n"] = 3
}
scZh["十六夜咲夜"]["花映塚"] = {
    [1] = "时符「Private Vision」（个人幻影）",
    [2] = "时符「Mysterious Jack」（神秘的杰克）",
    ["n"] = 2
}
scZh["十六夜咲夜"]["文花帖"] = {
    [1] = "时符「Tunnel Effect」（穿隧效应）",
    [2] = "空虚「Inflation Square」（膨胀空间）",
    [3] = "银符「Perfect Maid」（完美女仆）",
    ["n"] = 3
}
scZh["十六夜咲夜"]["绯想天"] = {
    [1] = "幻符「杀人Doll」（杀人玩偶）",
    [2] = "时符「Private Square」（个人空间）",
    [3] = "伤符「Inscribe Red Soul」（铭刻于红魂）",
    [4] = "幻葬「夜雾幻影杀人鬼」",
    [5] = "「咲夜的世界」",
    [6] = "伤魂「Soul Sculpture」（灵魂雕塑）",
    [7] = "银符「Silver Bound」（银之跳跃）",
    [8] = "奇术「Eternal Meek」（永恒的温柔）",
    [9] = "速符「Luminous Ricochet」（闪光弹跳）",
    [10] = "时符「咲夜特制Stopwatch」（咲夜特制秒表）",
    [11] = "银符「Silver Bound」（银之跳跃）",
    [12] = "时符「咲夜特制Stopwatch」（咲夜特制秒表）",
    [13] = "幻术「My Knife Recursion」（吾刃回归）",
    [14] = "时符「Silver Acute 360」（银之锐角360度）",
    ["n"] = 14
}
scZh["十六夜咲夜"]["非想天则"] = {
    [1] = "时符「Imaginary Vertical Time」（假想时轴）",
    [2] = "时计「Luna Dial」（月时计）",
    [3] = "光速「C. Ricochet」（光速跃迁）",
    ["n"] = 3
}
scZh["十六夜咲夜"]["辉针城"] = {
    [1] = "妖器「银色的Another Dimension」（银色异次元）",
    [2] = "时符「Dual Vanish」（双重消失）",
    ["n"] = 2
}
scZh["十六夜咲夜"]["天邪鬼"] = {
    [1] = "时符「时停者咲夜」",
    [2] = "时符「Changeling Magic」（调换魔法）",
    ["n"] = 2
}
scZh["十六夜咲夜"]["儚月抄"] = {
    [1] = "「Luminous Ricochet」（闪光弹跳）",
    [2] = "「我的世界」",
    ["n"] = 2
}

scZh["蕾米莉亚"] = {}
scZh["蕾米莉亚"]["红魔乡"] = {
    [1] = "天罚「Star of David」（大卫之星）",
    [2] = "神罚「年幼的Demon Lord」（年幼的恶魔之王）",
    [3] = "冥符「红色的冥界」",
    [4] = "狱符「千根针的针山」",
    [5] = "诅咒「Vlad Tepes的诅咒」（弗拉德·特佩斯的诅咒）",
    [6] = "神术「吸血鬼幻想」",
    [7] = "红符「Scarlet Shoot」（绯红之击）",
    [8] = "红符「Scarlet Meister」（绯红之主）",
    [9] = "「Red Magic」（红魔法）",
    [10] = "「红色的幻想乡」",
    ["n"] = 10
}
scZh["蕾米莉亚"]["萃梦想"] = {
    [1] = "红符「不夜城Red」（红色不夜城）",
    [2] = "红魔「Scarlet Devil」（绯红色的恶魔）",
    [3] = "必杀「Heart Break」（碎心）",
    [4] = "神枪「Spear the Gungnir」（冈格尼尔之枪）",
    [5] = "夜符「Demon King Cradle」（恶魔之王的摇篮）",
    [6] = "夜王「Dracula Cradle」（德古拉的摇篮）",
    [7] = "符之一「Bad Lady Scramble」（恶女置乱）",
    [8] = "符之二「My Heart Break」（我心破碎）",
    [9] = "符之三「Hell Catastrophe」（地狱的大灾难）",
    [10] = "夜符「Queen of Midnight」（子夜之女王）",
    [11] = "「Red Magic」（红魔法）",
    ["n"] = 11
}
scZh["蕾米莉亚"]["永夜抄"] = {
    [1] = "红符「不夜城Red」（红色不夜城）",
    [2] = "红魔「Scarlet Devil」（绯红色的恶魔）",
    [3] = "「Scarlet Destiny」（绯色命运）",
    ["n"] = 3
}
scZh["蕾米莉亚"]["文花帖"] = {
    [1] = "魔符「全世界Nightmare」（全世界梦魇）",
    [2] = "红符「Bloody Magic Square」（嗜血魔方阵）",
    [3] = "红蝙蝠「Vampirish Night」（吸血鬼之夜）",
    [4] = "神鬼「Remilia Stalker」（蕾米莉亚潜行者）",
    ["n"] = 4
}
scZh["蕾米莉亚"]["绯想天"] = {
    [1] = "红符「不夜城Red」（红色不夜城）",
    [2] = "必杀「Heart Break」（碎心）",
    [3] = "夜符「Demon King Cradle」（恶魔之王的摇篮）",
    [4] = "红魔「Scarlet Devil」（绯红色的恶魔）",
    [5] = "神枪「Spear the Gungnir」（冈格尼尔之枪）",
    [6] = "夜王「Dracula Cradle」（德古拉的摇篮）",
    [7] = "夜符「Bad Lady Scramble」（恶女置乱）",
    [8] = "命运「Miserable Fate」（悲惨的命运）",
    [9] = "命运「Miserable Fate」（悲惨的命运）",
    [10] = "夜符「Bombard Night」（轰炸之夜）",
    [11] = "蝙蝠「Vampire Sweep」（吸血鬼突袭）",
    [12] = "神鬼「Remilia Stalker」（蕾米莉亚潜行者）",
    ["n"] = 12
}
scZh["蕾米莉亚"]["非想天则"] = {
    [1] = "恶魔「Remilia Stretch」（蕾米莉亚伸展）",
    [2] = "「Millennium吸血鬼」（千年吸血鬼）",
    ["n"] = 2
}
scZh["蕾米莉亚"]["天邪鬼"] = {
    [1] = "「Fitful Nightmare」（断续的噩梦）",
    [2] = "「捉吸血鬼游戏」",
    ["n"] = 2
}
scZh["蕾米莉亚"]["噩梦日记"] = {
    [1] = "红魔符「Bloody Catastrophe」",
    [2] = "红星符「超人血刀」",
    [3] = "神红符「血腥十七条的光芒」",
    ["n"] = 3
}
scZh["蕾米莉亚"]["儚月抄"] = {
    [1] = "「Queen of Midnight」（子夜之女王）",
    ["n"] = 1
}

scZh["芙兰朵露"] = {}
scZh["芙兰朵露"]["红魔乡"] = {
    [1] = "禁忌「Cranberry Trap」（红莓陷阱）",
    [2] = "禁忌「Laevatein」（莱瓦汀）",
    [3] = "禁忌「Four of a Kind」（四重存在）",
    [4] = "禁忌「Kagome Kagome」（笼中鸟）",
    [5] = "禁忌「恋之迷宫」",
    [6] = "禁弹「Starbow Break」（星弧破碎）",
    [7] = "禁弹「Catadioptric」（折反射）",
    [8] = "禁弹「刻着过去的钟表」",
    [9] = "秘弹「之后就一个人都没有了吗？」",
    [10] = "QED「495年的波纹」",
    ["n"] = 10
}
scZh["芙兰朵露"]["文花帖"] = {
    [1] = "禁忌「Forbidden Fruits」（禁果）",
    [2] = "禁忌「被禁止的游戏」",
    ["n"] = 2
}
scZh["芙兰朵露"]["噩梦日记"] = {
    [1] = "红魔符「Bloody Catastrophe」",
    [2] = "红神符「十七条大灾变」",
    [3] = "红星符「超人大灾变行脚」",
    ["n"] = 3
}

scZh["蕾蒂"] = {}
scZh["蕾蒂"]["妖妖梦"] = {
    [1] = "寒符「Lingering Cold」（延长的冬日）",
    [2] = "冬符「Flower Wither Away」（花之凋零）",
    [3] = "白符「Undulation Ray」（波状光）",
    [4] = "怪符「Table Turning」（桌灵转）",
    ["n"] = 4
}
scZh["蕾蒂"]["文花帖"] = {
    [1] = "寒符「Cold Snap」（寒流）",
    [2] = "冬符「Northern Winner」（北极的胜利者）",
    ["n"] = 2
}

scZh["橙"] = {}
scZh["橙"]["妖妖梦"] = {
    [1] = "仙符「凤凰卵」",
    [2] = "仙符「凤凰展翅」",
    [3] = "式符「飞翔晴明」",
    [4] = "阴阳「道满晴明」",
    [5] = "阴阳「晴明大纹」",
    [6] = "天符「天仙鸣动」",
    [7] = "翔符「飞翔韦驮天」",
    [8] = "童符「护法天童乱舞」",
    [9] = "仙符「尸解永远」",
    [10] = "鬼符「鬼门金神」",
    [11] = "方符「奇门遁甲」",
    [12] = "鬼符「青鬼赤鬼」",
    [13] = "鬼神「飞翔毘沙门天」",
    ["n"] = 13
}
scZh["橙"]["文花帖"] = {
    [1] = "星符「交错的鳞片」",
    [2] = "鬼神「鸣动持国天」",
    [3] = "怪猫「橙」",
    ["n"] = 3
}

scZh["爱丽丝"] = {}
scZh["爱丽丝"]["妖妖梦"] = {
    [1] = "操符「少女文乐」",
    [2] = "苍符「博爱的法兰西人偶」",
    [3] = "苍符「博爱的Orléans人偶」（博爱的奥尔良人偶）",
    [4] = "红符「红发的荷兰人偶」",
    [5] = "白符「白垩的俄罗斯人偶」",
    [6] = "暗符「雾之伦敦人偶」",
    [7] = "回符「轮回的西藏人偶」",
    [8] = "雅符「春之京都人偶」",
    [9] = "诅咒「魔彩光的上海人偶」",
    [10] = "诅咒「上吊的蓬莱人偶」",
    ["n"] = 10
}
scZh["爱丽丝"]["萃梦想"] = {
    [1] = "魔符「Artful Sacrifice」（狡猾的献祭）",
    [2] = "魔操「Return Inanimateness」（回归虚无）",
    [3] = "战符「Little Legion」（小小军势）",
    [4] = "战操「Doll's War」（玩偶战争）",
    [5] = "咒符「上海人偶」",
    [6] = "诅咒「蓬莱人偶」",
    [7] = "符之一「Artful Chanter」（狡猾的吟颂者）",
    [8] = "符之二「Doll Crusader」（玩偶十字军）",
    [9] = "魔光「Devilry Light Ray」（惨虐之光）",
    ["n"] = 9
}
scZh["爱丽丝"]["永夜抄"] = {
    [1] = "魔符「Artful Sacrifice」（狡猾的献祭）",
    [2] = "魔操「Return Inanimateness」（回归虚无）",
    [3] = "「Grand-Guignol戏院的怪人」（猎奇剧团里的怪人）",
    ["n"] = 3
}
scZh["爱丽丝"]["文花帖"] = {
    [1] = "操符「Dolls in Sea」（海中的人偶）",
    [2] = "咒符「Straw Doll Kamikaze」（稻草人偶神风）",
    [3] = "赤符「Doll Mira Ceti」（人偶鲸鱼座）",
    ["n"] = 3
}
scZh["爱丽丝"]["绯想天"] = {
    [1] = "魔符「Artful Sacrifice」（狡猾的献祭）",
    [2] = "战符「Little Legion」（小小军势）",
    [3] = "咒符「上海人偶」",
    [4] = "魔操「Return Inanimateness」（回归虚无）",
    [5] = "战操「Doll's War」（玩偶战争）",
    [6] = "诅咒「蓬莱人偶」",
    [7] = "侦符「Seeker Dolls」（探索人偶）",
    [8] = "红符「荷兰人偶」",
    [9] = "人偶「未来文乐」",
    [10] = "聚焦「Trip Wire」（陷阱网）",
    [11] = "步兵「Suicide Squad」（敢死小分队）",
    [12] = "剑符「Soldier of Cross」（交错的士兵）",
    [13] = "人偶「没有灵魂的Folk dance」（没有灵魂的集体舞）",
    ["n"] = 13
}
scZh["爱丽丝"]["非想天则"] = {
    [1] = "枪符「Cutie大千枪」（萌萌大千枪）",
    [2] = "人偶「Lemmings' Parade」（旅鼠的盛装游行）",
    [3] = "人偶「Semi-Automaton」（半自主人偶）",
    [4] = "骑士「Doll of Round Table」（圆桌人偶）",
    [5] = "牺牲「Suicide Pact」（自杀协议）",
    [6] = "试验中「Level Titania」（提泰妮娅级）",
    [7] = "试验中「Goliath人偶」（歌利亚人偶）",
    ["n"] = 7
}

scZh["莉莉"] = {}
scZh["莉莉"]["天空璋"] = {
    [1] = "春符「Surprise Spring」（惊喜之春）",
    ["n"] = 1
}

scZh["骚灵三姐妹"] = {}
scZh["骚灵三姐妹"]["妖妖梦"] = {
    [1] = "骚符「Phantom Dinning」（幽灵絮语）",
    [2] = "骚符「Live Poltergeist」（活着的骚灵）",
    [3] = "合葬「Prism Concerto」（棱镜协奏曲）",
    [4] = "骚葬「Stygian Riverside」（冥河边缘）",
    [5] = "大合葬「灵车Concerto Grosso」（灵车大协奏曲）",
    [6] = "大合葬「灵车Concerto Grosso改」（灵车大协奏曲改）",
    [7] = "大合葬「灵车Concerto Grosso怪」（灵车大协奏曲怪）",
    ["n"] = 7
}

scZh["露娜萨"] = {}
scZh["露娜萨"]["妖妖梦"] = {
    [1] = "弦奏「Guarneri del Gesù」（瓜尔内里·德尔·杰苏）",
    [2] = "神弦「Stradivarius」（斯特拉迪瓦里）",
    [3] = "伪弦「Pseudo Stradivarius」（伪斯特拉迪瓦里）",
    ["n"] = 3
}
scZh["露娜萨"]["花映塚"] = {
    [1] = "骚符「Noise Melancholy」（吵闹的忧郁）",
    [2] = "骚符「Lunasa Solo Live」（露娜萨独奏直播）",
    ["n"] = 2
}

scZh["梅露兰"]= {}
scZh["梅露兰"]["妖妖梦"] = {
    [1] = "管灵「Hino Phantasm」（日野幻想）",
    [2] = "冥管「Ghost Clifford」（灵之克里福德）",
    [3] = "管灵「Ghost Clifford」（灵之克里福德）",
    ["n"] = 3
}
scZh["梅露兰"]["花映塚"] = {
    [1] = "骚符「Soul-Go-Happy」（乐观的灵魂）",
    [2] = "骚符「Merlin Happy Live」（梅露兰快乐直播）",
    ["n"] = 2
}

scZh["莉莉卡"] = {}
scZh["莉莉卡"]["妖妖梦"] = {
    [1] = "冥键「Fazioli冥奏」（法吉奥里冥奏）",
    [2] = "键灵「Bösendorfer神奏」（蓓森朵芙神奏）",
    ["n"] = 2
}
scZh["莉莉卡"]["花映塚"] = {
    [1] = "骚符「Soul Noise Flow」（灵魂噪音流）",
    [2] = "骚符「Lyrica Solo Live」（莉莉卡独奏直播）",
    ["n"] = 2
}

scZh["魂魄妖梦"] = {}
scZh["魂魄妖梦"]["妖妖梦"] = {
    [1] = "幽鬼剑「妖童饿鬼之断食」",
    [2] = "饿鬼剑「饿鬼道草纸」",
    [3] = "饿王剑「饿鬼十王的报应」",
    [4] = "狱界剑「二百由旬之一闪」",
    [5] = "狱炎剑「业风闪影阵」",
    [6] = "狱神剑「业风神闪斩」",
    [7] = "畜趣剑「无为无策之冥罚」",
    [8] = "修罗剑「现世妄执」",
    [9] = "人界剑「悟入幻想」",
    [10] = "人世剑「大悟显晦」",
    [11] = "人神剑「俗谛常住」",
    [12] = "天上剑「天人之五衰」",
    [13] = "天界剑「七魄忌讳」",
    [14] = "天神剑「三魂七魄」",
    [15] = "六道剑「一念无量劫」",
    ["n"] = 15
}
scZh["魂魄妖梦"]["萃梦想"] = {
    [1] = "人符「现世斩」",
    [2] = "人鬼「未来永劫斩」",
    [3] = "断命剑「冥想斩」",
    [4] = "断迷剑「迷津慈航斩」",
    [5] = "魂符「幽明的苦轮」",
    [6] = "魂魄「幽明求闻持聪明之法」",
    [7] = "符之一「二重的苦轮」",
    [8] = "符之二「心眼迷想斩」",
    [9] = "符之三「业风神闪斩」",
    [10] = "奥义「西行春风斩」",
    ["n"] = 10
}
scZh["魂魄妖梦"]["永夜抄"] = {
    [1] = "人符「现世斩」",
    [2] = "人鬼「未来永劫斩」",
    [3] = "「待宵反射卫星斩」",
    ["n"] = 3
}
scZh["魂魄妖梦"]["花映塚"] = {
    [1] = "迷符「缠缚剑」",
    [2] = "迷符「半身大悟」",
    ["n"] = 2
}
scZh["魂魄妖梦"]["文花帖"] = {
    [1] = "人智剑「天女返」",
    [2] = "妄执剑「修罗之血」",
    [3] = "天星剑「仿若涅槃寂静」",
    [4] = "四生剑「众生无情之声」",
    ["n"] = 4
}
scZh["魂魄妖梦"]["绯想天"] = {
    [1] = "人智剑「天女返」",
    [2] = "樱花剑「闪闪散华」",
    [3] = "断想剑「草木成佛斩」",
    [4] = "瞑斩「楼观赋予我能斩断弹幕的心之眼」",
    [5] = "人符「现世斩」",
    [6] = "断命剑「冥想斩」",
    [7] = "魂符「幽明的苦轮」",
    [8] = "人鬼「未来永劫斩」",
    [9] = "断迷剑「迷津慈航斩」",
    [10] = "魂魄「幽明求闻持聪明之法」",
    [11] = "剑伎「樱花闪闪」",
    [12] = "断灵剑「成佛得脱斩」",
    ["n"] = 12
}
scZh["魂魄妖梦"]["非想天则"] = {
    [1] = "空观剑「六根清净斩」",
    [2] = "转生剑「圆心流转斩」",
    ["n"] = 2
}
scZh["魂魄妖梦"]["神灵庙"] = {
    [1] = "空观剑「六根清净斩」",
    ["n"] = 1
}
scZh["魂魄妖梦"]["弹幕天邪鬼"] = {
    [1] = "光符「冥府光芒一闪」",
    [2] = "彼岸剑「地狱极乐胡乱斩」",
    ["n"] = 2
}

scZh["西行寺幽幽子"] = {}
scZh["西行寺幽幽子"]["妖妖梦"] = {
    [1] = "亡乡「亡我乡 -彷徨的灵魂-」",
    [2] = "亡乡「亡我乡 -宿罪-」",
    [3] = "亡乡「亡我乡 -无道之路-」",
    [4] = "亡乡「亡我乡 -自尽-」",
    [5] = "亡舞「生者必灭之理 -眩惑-」",
    [6] = "亡舞「生者必灭之理 -死蝶-」",
    [7] = "亡舞「生者必灭之理 -毒蛾-」",
    [8] = "亡舞「生者必灭之理 -魔境-」",
    [9] = "华灵「Ghost Butterfly」（亡灵蝶）",
    [10] = "华灵「Swallowtail Butterfly」（扬羽蝶）",
    [11] = "华灵「Deep-Rooted Butterfly」（执念蝶）",
    [12] = "华灵「Butterfly Delusion」（蝶妄想）",
    [13] = "幽曲「Repository of Hirokawa -伪灵-」（埋骨于弘川 -伪灵-）",
    [14] = "幽曲「Repository of Hirokawa -亡灵-」（埋骨于弘川 -亡灵-）",
    [15] = "幽曲「Repository of Hirokawa -幻灵-」（埋骨于弘川 -幻灵-）",
    [16] = "幽曲「Repository of Hirokawa -神灵-」（埋骨于弘川 -神灵-）",
    [17] = "樱符「完全墨染的樱花 -封印-」",
    [18] = "樱符「完全墨染的樱花 -亡我-」",
    [19] = "樱符「完全墨染的樱花 -春眠-」",
    [20] = "樱符「完全墨染的樱花 -开花-」",
    [21] = "「反魂蝶 -一分咲-」",
    [22] = "「反魂蝶 -三分咲-」",
    [23] = "「反魂蝶 -五分咲-」",
    [24] = "「反魂蝶 -八分咲-」",
    ["n"] = 24
}
scZh["西行寺幽幽子"]["萃梦想"] = {
    [1] = "死符「Ghastly Dream」（惊梦）",
    [2] = "死蝶「华胥的永眠」",
    [3] = "冥符「黄泉平坂行路」",
    [4] = "再迷「幻想乡的黄泉归」",
    [5] = "灵符「无寿之梦」",
    [6] = "寿命「通向无寿国的期票」",
    [7] = "符之一「幽梦的蝴蝶」",
    [8] = "符之二「白玉楼的枝垂樱」",
    [9] = "符之三「遥远过去的死地」",
    [10] = "樱花「依恋未酌宴」",
    [11] = "「紫色彼岸樱推迟绽放」",
    ["n"] = 11
}
scZh["西行寺幽幽子"]["永夜抄"] = {
    [1] = "死符「Ghastly Dream」（惊梦）",
    [2] = "死蝶「华胥的永眠」",
    [3] = "「西行寺无余涅槃」",
    ["n"] = 3
}
scZh["西行寺幽幽子"]["文花帖"] = {
    [1] = "幽雅「通向黄泉的诱蛾灯」",
    [2] = "蝶符「凤蝶纹的死枪」",
    [3] = "死符「醉人之生，死的梦幻」",
    [4] = "「死蝶浮月」",
    ["n"] = 4
}
scZh["西行寺幽幽子"]["绯想天"] = {
    [1] = "死符「Ghastly Dream」（惊梦）",
    [2] = "冥符「黄泉平坂行路」",
    [3] = "灵符「无寿之梦」",
    [4] = "死蝶「华胥的永眠」",
    [5] = "再迷「幻想乡的黄泉归」",
    [6] = "寿命「通向无寿国的期票」",
    [7] = "灵蝶「蝶之羽风暂留此世」",
    [8] = "蝶符「凤蝶纹的死枪」",
    [9] = "幽雅「通向黄泉的诱蛾灯」",
    [10] = "幽符「冥界Mystery Spot」（冥界灵异点）",
    [11] = "灵蝶「蝶之羽风暂留此世」",
    [12] = "宴会「死后一切大团圆」",
    ["n"] = 12
}
scZh["西行寺幽幽子"]["非想天则"] = {
    [1] = "「反魂蝶」",
    [2] = "樱符「Sense of Cherry Blossom」（樱之意志）",
    ["n"] = 2
}
scZh["西行寺幽幽子"]["神灵庙"] = {
    [1] = "符牒「死蝶之舞」",
    [2] = "符牒「死蝶之舞　- 樱花 -」",
    [3] = "幽蝶「Ghost Spot」（幽魂聚地）",
    [4] = "幽蝶「Ghost Spot　- 樱花 -」（幽魂聚地　- 樱花 -）",
    [5] = "冥符「常夜樱」",
    [6] = "樱符「西行樱吹雪」",
    [7] = "樱符「樱吹雪地狱」",
    ["n"] = 7
}
scZh["西行寺幽幽子"]["弹幕天邪鬼"] = {
    [1] = "蝶符「花蝶风月」",
    [2] = "樱花「樱吹雪花小町」",
    ["n"] = 2
}
scZh["西行寺幽幽子"]["噩梦日记"] = {
    [1] = "妖花符「蝴蝶风暴阎魔笏」",
    [2] = "风妖符「死蝶御柱」",
    [3] = "妖风符「土著蝶风暴」",
    ["n"] = 3
}

scZh["八云蓝"] = {}
scZh["八云蓝"]["妖妖梦"] = {
    [1] = "式神「仙狐思念」",
    [2] = "式神「十二神将之宴」",
    [3] = "式辉「狐狸妖怪laser」（狐狸妖怪激光）",
    [4] = "式辉「四面楚歌Charming」（迷人的四面楚歌）",
    [5] = "式辉「Princess天狐 -Illusion-」（天狐公主 -Illusion-）",
    [6] = "式弹「Ultimate Buddhist」（最后的佛徒）",
    [7] = "式弹「Unilateral Contact」（片面接触）",
    [8] = "式神「橙」",
    [9] = "「狐狗狸先生的契约」",
    [10] = "幻神「饭纲权现降临」",
    [11] = "式神「前鬼后鬼的守护」",
    [12] = "式神「凭依荼吉尼天」",
    ["n"] = 12
}
scZh["八云蓝"]["文花帖"] = {
    [1] = "密符「大师的密传」",
    [2] = "行符「八千万块护摩」",
    [3] = "超人「飞翔役小角」",
    ["n"] = 3
}
scZh["八云蓝"]["噩梦日记"] = {
    [1] = "地妖符「本我的式神」",
    [2] = "地妖符「式神大星」",
    [3] = "地妖符「自我的式神」",
    ["n"] = 3
}

scZh["八云紫"] = {}
scZh["八云紫"]["妖妖梦"] = {
    [1] = "结界「梦境与现实的诅咒」",
    [2] = "结界「动与静的均衡」",
    [3] = "结界「光明与黑暗的网目」",
    [4] = "罔两「Straight与Curve的梦乡」（直球与曲球的梦乡）",
    [5] = "罔两「八云紫的神隐」",
    [6] = "罔两「栖息于禅寺的妖蝶」",
    [7] = "魍魉「二重黑死蝶」",
    [8] = "式神「八云蓝」",
    [9] = "「人类与妖怪的境界」",
    [10] = "结界「生与死的境界」",
    [11] = "紫奥义「弹幕结界」",
    ["n"] = 11
}
scZh["八云紫"]["萃梦想"] = {
    [1] = "境符「四重结界」",
    [2] = "结界「充满魅力的四重结界」",
    [3] = "式神「八云蓝」",
    [4] = "式神「八云蓝+」",
    [5] = "境符「二次元与三次元的境界」",
    [6] = "结界「客观结界」",
    [7] = "符之一「四重结界」",
    [8] = "符之二「八云卍伞」",
    [9] = "符之三「八云蓝」",
    [10] = "外力「无限的超高速飞行体」",
    [11] = "幻想「第一类永动机」",
    ["n"] = 11
}
scZh["八云紫"]["永夜抄"] = {
    [1] = "境符「四重结界」",
    [2] = "境界「永夜四重结界」",
    [3] = "「深弹幕结界 -梦幻泡影-」",
    ["n"] = 3
}
scZh["八云紫"]["文花帖"] = {
    [1] = "境符「色与空的境界」",
    [2] = "境符「波与粒的境界」",
    ["n"] = 2
}
scZh["八云紫"]["绯想天"] = {
    [1] = "境符「四重结界」",
    [2] = "式神「八云蓝」",
    [3] = "境符「二次元与三次元的境界」",
    [4] = "结界「充满魅力的四重结界」",
    [5] = "式神「橙」",
    [6] = "结界「客观结界」",
    [7] = "幻巢「飞光虫Nest」（飞光虫之巢）",
    [8] = "空饵「具有中毒性的Isca」（具有中毒性的诱饵）",
    [9] = "废线「废弃车站下车之旅」",
    [10] = "光弹「Doppler Effect」（多普勒效应）",
    [11] = "捌器「将一切分成两个的东西」",
    [12] = "幻巢「飞光虫Nest」（飞光虫之巢）",
    [13] = "空饵「狂躁高速飞行物体」",
    [14] = "「八云之巢」",
    ["n"] = 14
}
scZh["八云紫"]["非想天则"] = {
    [1] = "魔眼「Laplace之魔」（拉普拉斯之魔）",
    ["n"] = 1
}
scZh["八云紫"]["天邪鬼"] = {
    [1] = "「不可能弹幕结界」",
    [2] = "「运钝根的捕物帐」",
    ["n"] = 2
}
scZh["八云紫"]["凭依华"] = {
    [1] = "「无人废线车辆炸弹」",
    [2] = "式神「八云蓝&橙」",
    [3] = "境界「溢出的漂流物」",
    [4] = "＊把你美丽的脚拿来！＊",
    [5] = "「<ruby>凭坐<rt>主役</rt></ruby>的忧郁」",
    [6] = "「完全凭依与梦想封印」",
    [7] = "「<ruby>凭坐<rt>主役</rt></ruby>与<ruby>神灵<rt>下仆</rt></ruby>的境界」",
    [8] = "贫符「Mischance Scatter」（厄运播撒）",
    [9] = "「最凶最恶的极贫不幸神」",
    ["n"] = 9
}
scZh["八云紫"]["噩梦日记"] = {
    [1] = "「秘神结界」",
    [2] = "「击穿弹幕结界吧！」",
    [3] = "「未经许可的弹幕禁止摄影」",
    [4] = "纸符「结界中的ESP卡手里剑」",
    ["n"] = 4
}

scZh["伊吹萃香"] = {}
scZh["伊吹萃香"]["萃梦想"] = {
    [1] = "萃符「户隐山之投」",
    [2] = "萃鬼「天手力男之投」",
    [3] = "醉神「鬼缚之术」",
    [4] = "醉梦「施饿鬼缚之术」",
    [5] = "鬼符「Missing Power」（遗失的力量）",
    [6] = "鬼神「Missing Purple Power」（遗失的高贵之力）",
    [7] = "符之一「投掷的天岩户」",
    [8] = "符之二「坤轴的大鬼」",
    [9] = "符之三「追傩返Black hole」（追傩返黑洞）",
    [10] = "鬼火「超高密度磷祸术」",
    [11] = "疎符「六里雾中」",
    [12] = "「百万鬼夜行」",
    ["n"] = 12
}
scZh["伊吹萃香"]["文花帖"] = {
    [1] = "鬼气「蒙蒙迷雾」",
    [2] = "「百万鬼夜行」",
    ["n"] = 2
}
scZh["伊吹萃香"]["绯想天"] = {
    [1] = "萃符「户隐山之投」",
    [2] = "醉神「鬼缚之术」",
    [3] = "鬼符「Missing Power」（遗失的力量）",
    [4] = "萃鬼「天手力男之投」",
    [5] = "醉梦「施饿鬼缚之术」",
    [6] = "鬼神「Missing Purple Power」（遗失的高贵之力）",
    [7] = "雾符「云集雾散」",
    [8] = "鬼火「超高密度磷祸术」",
    [9] = "鬼符「大江山悉皆杀」",
    [10] = "吐息「小鬼的深呼吸」",
    [11] = "火弹「地灵活性弹」",
    [12] = "鬼神「Missing Purple Power」（遗失的高贵之力）",
    [13] = "鬼气「蒙蒙迷雾」",
    [14] = "「百万同一鬼」",
    ["n"] = 14
}
scZh["伊吹萃香"]["非想天则"] = {
    [1] = "四天王奥义「三步坏废」",
    ["n"] = 1
}
scZh["伊吹萃香"]["文花帖DS"] = {
    [1] = "鬼符「豆粒大的针地狱」",
    [2] = "地狱「炼狱气息」",
    [3] = "鬼符「Missing Power」（遗失的力量）",
    ["n"] = 3
}
scZh["伊吹萃香"]["天邪鬼"] = {
    [1] = "鬼群「Imp swarm」（小鬼成群）",
    [2] = "鬼群「百鬼秃童」",
    ["n"] = 2
}
scZh["伊吹萃香"]["噩梦日记"] = {
    [1] = "萃夜符「身命雾散」",
    [2] = "萃珠符「纯粹的五里雾中」",
    [3] = "萃珠符「Mist Ray」",
    ["n"] = 3
}

scZh["莉格露"] = {}
scZh["莉格露"]["永夜抄"] = {
    [1] = "萤符「地上的流星」",
    [2] = "萤符「地上的彗星」",
    [3] = "灯符「Firefly Phenomemon」（萤光现象）",
    [4] = "蠢符「Little Bug」（小虫）",
    [5] = "蠢符「Little Bug Storm」（小虫风暴）",
    [6] = "蠢符「Night Bug Storm」（夜虫风暴）",
    [7] = "蠢符「Night Bug Tornado」（夜虫龙卷）",
    [8] = "隐虫「永夜蛰居」",
    [9] = "「季节外的Butterfly Storm」（不合时令的蝶雨）",
    ["n"] = 9
}
scZh["莉格露"]["文花帖"] = {
    [1] = "萤符「地上的恒星」",
    [2] = "蝶符「Butterfly Storm」（蝴蝶风暴）",
    ["n"] = 2
}

scZh["米斯蒂娅"] = {}
scZh["米斯蒂娅"]["永夜抄"] = {
    [1] = "声符「枭的夜鸣声」",
    [2] = "声符「木菟的咆哮」",
    [3] = "蛾符「天蛾的蛊道」",
    [4] = "毒符「毒蛾的鳞粉」",
    [5] = "猛毒「毒蛾的黑暗演舞」",
    [6] = "鹰符「Ill-Starred Dive」（祸延疾冲）",
    [7] = "夜盲「夜雀之歌」",
    [8] = "夜雀「午夜中的Chorus master」（午夜中的合唱指挥）",
    [9] = "「Blind Night-Bird」（失明的夜雀）",
    ["n"] = 9
}
scZh["米斯蒂娅"]["花映塚"] = {
    [1] = "鸟符「Human Cage」（人类的牢笼）",
    [2] = "鸟符「Human Cage Double」（人类的双重牢笼）",
    [3] = "鸟符「Mysterious Song」（神秘歌音）",
    ["n"] = 3
}

scZh["上白泽慧音"] = {}
scZh["上白泽慧音"]["永夜抄"] = {
    [1] = "产灵「First Pyramid」（最初的金字塔）",
    [2] = "始符「Ephemerality 137」（短命的137）",
    [3] = "野符「武烈Crisis」（武烈的危机）",
    [4] = "野符「将门Crisis」（将门的危机）",
    [5] = "野符「义满Crisis」（义满的危机）",
    [6] = "野符「GHQ Crisis」（GHQ的危机）",
    [7] = "国符「三种神器　剑」",
    [8] = "国符「三种神器　玉」",
    [9] = "国符「三种神器　镜」",
    [10] = "国体「三种神器　乡」",
    [11] = "终符「幻想天皇」",
    [12] = "虚史「幻想乡传说」",
    [13] = "未来「高天原」",
    [14] = "「日出国之天子」",
    [15] = "旧史「旧秘境史 -Old History-」（旧秘境史 -古代史-）",
    [16] = "转世「一条归桥」",
    [17] = "新史「新幻想史 -Next History-」（新幻想史 -现代史-）",
    [18] = "「无何有的浄化」",
    ["n"] = 18
}
scZh["上白泽慧音"]["文花帖"] = {
    [1] = "光符「天照」",
    [2] = "包符「昭和之雨」",
    [3] = "葵符「水户的光圀」",
    [4] = "倭符「邪马台国」",
    ["n"] = 4
}
scZh["上白泽慧音"]["天邪鬼"] = {
    [1] = "「20XX年 死后之旅」",
    [2] = "大火「江户之花」",
    ["n"] = 2
}

scZh["因幡帝"] = {}
scZh["因幡帝"]["永夜抄"] = {
    [1] = "「Ancient Duper」（远古的骗术）",
    ["n"] = 1
}
scZh["因幡帝"]["花映塚"] = {
    [1] = "兔符「开运大纹」",
    [2] = "兔符「因幡的白兔」",
    ["n"] = 2
}
scZh["因幡帝"]["文花帖"] = {
    [1] = "脱兔「Fluster Escape」（狼狈逃脱）",
    [2] = "借符「大穴牟迟大人的药」",
    ["n"] = 2
}

scZh["铃仙"] = {}
scZh["铃仙"]["永夜抄"] = {
    [1] = "波符「赤眼催眠(Mind Shaker)」（心灵颤动）",
    [2] = "幻波「赤眼催眠(Mind Blowing)」（心灵风暴）",
    [3] = "狂符「幻视调律(Visionary Tuning)」（幻视调律）",
    [4] = "狂视「狂视调律(Illusion Seeker)」（幻象追迹者）",
    [5] = "懒符「生神停止(Idling Wave)」（惰性之波）",
    [6] = "懒惰「生神停止(Mind Stopper)」（心灵制止）",
    [7] = "散符「真实之月(Invisible Full Moon)」（隐形满月）",
    [8] = "月眼「月兔远隔催眠术(Tele-Mesmerism)」（远隔催眠）",
    [9] = "「幻胧月睨（Lunatic Red Eyes）」（疯狂红眼）",
    ["n"] = 9
}
scZh["铃仙"]["花映塚"] = {
    [1] = "波符「月面波纹(Luna Wave)」（月面波纹）",
    [2] = "散符「荣华之梦(Luna Megalopolis)」（月面都市）",
    ["n"] = 2
}
scZh["铃仙"]["文花帖"] = {
    [1] = "散符「胧月花栞（Rocket in Mist）」（雾中的火箭）",
    [2] = "波符「幻之月（Invisible Half Moon）」（不可视的半月）",
    [3] = "狂梦「疯狂的梦（Dream World）」（梦世界）",
    ["n"] = 3
}
scZh["铃仙"]["绯想天"] = {
    [1] = "迫符「胁迫幻觉（Obsessioner）」（着魔之人）",
    [2] = "幻弹「幻想视差（Bluff Barrage）」（恐吓弹幕）",
    [3] = "幻兔「平行交差（Parallel Cross）」（平行相交）",
    [4] = "惑视「离圆花冠（Corolla Vision）」（花冠幻象）",
    [5] = "幻爆「近眼花火（Mind Star Mine）」（心灵烟花）",
    [6] = "幻惑「花冠视线（Crown Vision）」（花环幻象）",
    [7] = "「幻胧月睨（Lunatic Red Eyes）」（疯狂红眼）",
    [8] = "弱心「丧心丧意（Demotivation）」（丧失动力）",
    [9] = "丧心「丧心疮痍（Discarder）」（弃卡者）",
    [10] = "毒烟幕「瓦斯织物之玉」",
    [11] = "生药「国士无双之药」",
    ["n"] = 11
}
scZh["铃仙"]["非想天则"] = {
    [1] = "长视「赤月下（Infrared Moon）」（红外线之月）",
    [2] = "短视「超短脑波（X Wave）」（X射线）",
    [3] = "赤眼「望见圆月（Lunatic Blast）」（狂月爆破）",
    ["n"] = 3
}
scZh["铃仙"]["深秘录"] = {
    [1] = "「月面弹跳(Lunatic Double)」（双重疯狂）",
    [2] = "「幻胧月睨(Lunatic Red Eyes)」（疯狂红眼）",
    [3] = "「地上弹跳(Lunatic Echo)」（疯狂回声）",
    [4] = "＊你已经疯了！＊",
    ["n"] = 4
}
scZh["铃仙"]["绀珠传"] = {
    [1] = "「障壁波动（Evil Undulation）」",
    ["n"] = 1
}
scZh["铃仙"]["凭依华"] = {
    [1] = "「月面跳弹（Lunatic Double）」（双重疯狂）",
    [2] = "「幻胧月睨（Lunatic Red Eyes）」（疯狂红眼）",
    [3] = "「地上跳弹（Lunatic Echo）」（疯狂回声）",
    [4] = "＊你已经疯了！＊",
    [5] = "狂槌符「狂视幻象（Disorder Eye）也变大吧」（混乱之眼）",
    [6] = "火狂符「人体燃烧秘匿弹幕（Burning Hidden Bullet）」（燃烧的秘匿弹幕）",
    ["n"] = 6
}

scZh["八意永琳"] = {}
scZh["八意永琳"]["永夜抄"] = {
    [1] = "天丸「壶中的天地」",
    [2] = "觉神「神代的记忆」",
    [3] = "神符「天人的族谱」",
    [4] = "苏活「生命游戏 -Life Game-」",
    [5] = "苏生「Rising Game」（复活游戏）",
    [6] = "操神「Omoikane Device」（思兼装置）",
    [7] = "神脑「Omoikane Brain」（思兼的头脑）",
    [8] = "天咒「Apollo 13」（阿波罗13）",
    [9] = "秘术「天文密葬法」",
    [10] = "禁药「蓬莱之药」",
    [11] = "药符「壶中的大银河」",
    [12] = "「天网蛛网捕蝶之法」",
    ["n"] = 12
}
scZh["八意永琳"]["文花帖"] = {
    [1] = "药符「蝴蝶梦丸Nightmare」（蝴蝶梦丸噩梦）",
    [2] = "炼丹「水银之海」",
    [3] = "秘药「仙香玉兔」",
    ["n"] = 3
}
scZh["八意永琳"]["噩梦日记"] = {
    [1] = "永夜符「蓬莱壶中的弹枝」",
    [2] = "永绯符「坠落的壶中有顶天」",
    [3] = "妖风符「土著蝶风暴」",
    ["n"] = 3
}

scZh["蓬莱山辉夜"] = {}
scZh["蓬莱山辉夜"]["永夜抄"] = {
    [1] = "难题「龙颈之玉　-五色的弹丸-」",
    [2] = "神宝「Brilliant Dragon Bullet」（耀眼的龙玉）",
    [3] = "难题「佛御石之钵　-不碎的意志-」",
    [4] = "神宝「Buddhist Diamond」（佛体的金刚石）",
    [5] = "难题「火鼠的皮衣　-不焦躁的内心-」",
    [6] = "神宝「Salamander Shield」（火蜥蜴之盾）",
    [7] = "难题「燕的子安贝　-永命线-」",
    [8] = "神宝「Life Spring Infinity」（无限的生命之泉）",
    [9] = "难题「蓬莱的弹枝　-七色的弹幕-」",
    [10] = "神宝「蓬莱的玉枝　-梦色之乡-」",
    [11] = "「永夜归返　-初月-」",
    [12] = "「永夜归返　-新月-」",
    [13] = "「永夜归返　-上弦月-」",
    [14] = "「永夜归返　-待宵-」",
    [15] = "「永夜归返　-子之刻-」",
    [16] = "「永夜归返　-子时二刻-」",
    [17] = "「永夜归返　-子时三刻-」",
    [18] = "「永夜归返　-子时四刻-」",
    [19] = "「永夜归返　-丑之刻-」",
    [20] = "「永夜归返　-丑时二刻-」",
    [21] = "「永夜归返　-丑时三刻-」",
    [22] = "「永夜归返　-丑时四刻-」",
    [23] = "「永夜归返　-寅之刻-」",
    [24] = "「永夜归返　-寅时二刻-」",
    [25] = "「永夜归返　-寅时三刻-」",
    [26] = "「永夜归返　-寅时四刻-」",
    [27] = "「永夜归返　-朝霭-」",
    [28] = "「永夜归返　-拂晓-」",
    [29] = "「永夜归返　-破晓明星-」",
    [30] = "「永夜归返　-世间开明-」",
    [31] = "「蓬莱的树海」",
    ["n"] = 31
}
scZh["蓬莱山辉夜"]["文花帖"] = {
    [1] = "新难题「月的Ilmenite」（月的钛铁矿）",
    [2] = "新难题「艾哲红石」",
    [3] = "新难题「金阁寺的一块天花板」",
    [4] = "新难题「Mysterium」（神秘物质）",
    ["n"] = 4
}
scZh["蓬莱山辉夜"]["噩梦日记"] = {
    [1] = "永夜符「蓬莱壶中的弹枝」",
    [2] = "辉夜符「蓬莱的巨大弹枝」",
    [3] = "绯夜符「蓬莱之弹的要石」",
    ["n"] = 3
}

scZh["藤原妹红"] = {}
scZh["藤原妹红"]["永夜抄"] = {
    [1] = "时效「月岩笠的诅咒」",
    [2] = "不死「火鸟　-凤翼天翔-」",
    [3] = "藤原「灭罪寺院伤」",
    [4] = "不死「徐福时空」",
    [5] = "灭罪「正直者之死」",
    [6] = "虚人「无」",
    [7] = "不灭「Phoneix之尾」（不死鸟之尾）",
    [8] = "蓬莱「凯风快晴　-Fujiyama Volcano-」（凯风快晴　-不死的火山-）",
    [9] = "「Possessed by Phoenix」（不死鸟附体）",
    [10] = "「蓬莱人形」",
    [11] = "「Imperishable Shooting」（不朽的弹幕）",
    [12] = "「Phoneix重生」（不死鸟重生）",
    ["n"] = 12
}
scZh["藤原妹红"]["文花帖"] = {
    [1] = "贵人「Saint Germain的忠告」（圣日耳曼的忠告）",
    [2] = "蓬莱「瑞江浦岛子与五色的瑞龟」",
    ["n"] = 2
}
scZh["藤原妹红"]["天邪鬼"] = {
    [1] = "惜命「不死之身的舍身击」",
    [2] = "「火鸟　‐不死传说‐」",
    ["n"] = 2
}
scZh["藤原妹红"]["深秘录"] = {
    [1] = "焰符「自灭火焰大旋风」",
    [2] = "不死「凯风快晴飞翔蹴」",
    [3] = "咒符「无差别放火之符」",
    [4] = "＊这种世道赶紧烧个精光吧！＊",
    [5] = "炎符「不死鸟的超高温羽毛」",
    [6] = "＊凯风晴天快晴脚＊",
    [7] = "炎符「不死鸟之羽」",
    [8] = "爪符「Desperate Claw」（绝望之爪）",
    [9] = "惜命「不死之身的舍身击」",
    [10] = "「这不知是第几次的生命，燃烧殆尽吧」",
    ["n"] = 10
}
scZh["藤原妹红"]["凭依华"] = {
    [1] = "焰符「自灭火焰大旋风」",
    [2] = "不死「凯风快晴飞翔蹴」",
    [3] = "咒符「无差别放火之符」",
    [4] = "＊这种世道赶紧烧个精光吧！＊",
    [5] = "化火符「妖怪弹幕变化 叶叶烨烨」",
    [6] = "火狂符「人体燃烧秘匿弹幕（Burning Hidden Bullet）」（燃烧的秘匿弹幕）",
    [7] = "「这不知是第几次的生命，梦想封印吧」",
    ["n"] = 7
}
scZh["藤原妹红"]["噩梦日记"] = {
    [1] = "萃夜符「身命雾散」",
    [2] = "永珠符「舍身之反射」",
    [3] = "永珠符「无秽之珠与多秽之灵」",
    ["n"] = 3
}

scZh["射命丸文"] = {}
scZh["射命丸文"]["花映塚"] = {
    [1] = "风符「风神一扇」",
    [2] = "疾风「风神少女」",
    ["n"] = 2
}
scZh["射命丸文"]["风神录"] = {
    [1] = "岐符「天之八衢」",
    [2] = "岐符「猿田Cross」（猿田彦神之岔路）",
    [3] = "风神「风神木叶隐身术」",
    [4] = "风神「天狗颪」",
    [5] = "风神「二百十日」",
    [6] = "「幻想风靡」",
    [7] = "「无双风神」",
    [8] = "塞符「山神渡御」",
    [9] = "塞符「天孙降临」",
    [10] = "塞符「天上天下的照国」",
    ["n"] = 10
}
scZh["射命丸文"]["绯想天"] = {
    [1] = "旋符「红叶扇风」",
    [2] = "龙卷「天孙降临的道标」",
    [3] = "逆风「人间禁制之道」",
    [4] = "突符「天狗的Macro burst」（天狗巨暴流）",
    [5] = "风符「天狗道的开风」",
    [6] = "「幻想风靡」",
    [7] = "魔兽「镰鼬Veiling」（镰鼬面纱）",
    [8] = "突风「猿田彦的先导」",
    [9] = "突风「猿田彦的先导」",
    [10] = "旋符「飘妖扇」",
    [11] = "旋风「鸟居旋风」",
    [12] = "「幻想风靡」",
    ["n"] = 12
}
scZh["射命丸文"]["非想天则"] = {
    [1] = "风符「天狗报当日截稿」",
    [2] = "鸦符「暗夜的Day Mare」（暗夜昼魇）",
    ["n"] = 2
}
scZh["射命丸文"]["文花帖DS"] = {
    [1] = "取材「射命丸文的暴力取材」",
    [2] = "望远「Candid Shot」（秘密拍摄）",
    [3] = "抓拍「Fast Shot」（快速摄像）",
    [4] = "「幻想风靡」",
    ["n"] = 4
}
scZh["射命丸文"]["天邪鬼"] = {
    [1] = "写真「激摄天狗独家新闻」",
    [2] = "「瞬摄新闻工作者」",
    ["n"] = 2
}
scZh["射命丸文"]["天空璋"] = {
    [1] = "风符「天狗暴风雨」",
    ["n"] = 1
}

scZh["梅蒂欣"] = {}
scZh["梅蒂欣"]["花映塚"] = {
    [1] = "毒符「神经之毒」",
    [2] = "毒符「忧郁之毒」",
    ["n"] = 2
}
scZh["梅蒂欣"]["文花帖"] = {
    [1] = "雾符「Gassing Garden」（毒气花园）",
    [2] = "毒符「Poison Breath」（猛毒气息）",
    [3] = "谵妄「Into Delirium」（进入疯狂）",
    ["n"] = 3
}

scZh["风见幽香"] = {}
scZh["风见幽香"]["花映塚"] = {
    [1] = "花符「幻想乡的开花」",
    [2] = "幻想「花鸟风月，啸风弄月」",
    ["n"] = 2
}

scZh["小野塚小町"] = {}
scZh["小野塚小町"]["花映塚"] = {
    [1] = "投钱「隔夜钱」",
    [2] = "死神「Higan Retour」（彼岸归航）",
    ["n"] = 2
}
scZh["小野塚小町"]["文花帖"] = {
    [1] = "死歌「八重雾中渡」",
    [2] = "古雨「黄泉中有旅途之雨」",
    [3] = "死价「Price of Life」（生命的价值）",
    ["n"] = 3
}
scZh["小野塚小町"]["绯想天"] = {
    [1] = "舟符「宛若河流般」",
    [2] = "薄命「余命无几许」",
    [3] = "灵符「到处都是的浮游灵」",
    [4] = "死歌「八重雾中渡」",
    [5] = "换命「不惜身命，可惜身命」",
    [6] = "恨符「充满留恋的紧缚灵」",
    [7] = "死符「区别死者的镰刀」",
    [8] = "地狱「无间之狭间」",
    [9] = "灵符「古老的地缚灵之复苏」",
    [10] = "死符「区别死者的镰刀」",
    [11] = "魂符「魂之游戏」",
    ["n"] = 11
}
scZh["小野塚小町"]["非想天则"] = {
    [1] = "魂符「生魂流离的镰刀」",
    ["n"] = 1
}

scZh["四季映姬"] = {}
scZh["四季映姬"]["花映塚"] = {
    [1] = "罪符「彷徨的大罪」",
    [2] = "审判「Last Judgement」（最终审判）",
    ["n"] = 2
}
scZh["四季映姬"]["文花帖"] = {
    [1] = "谎言「Tongue of Wolf」（狼之舌）",
    [2] = "审判「十王审判」",
    [3] = "审判「Guilty or Not Guilty」（有罪或无罪）",
    [4] = "审判「净颇梨审判 -射命丸文-」",
    ["n"] = 4
}
scZh["四季映姬"]["噩梦日记"] = {
    [1] = "妖花符「蝴蝶风暴阎魔笏」",
    [2] = "风花符「御射军神大人的是非」",
    [3] = "风花符「御柱裁判」",
    ["n"] = 3
}

scZh["秋静叶"] = {}
scZh["秋静叶"]["风神录"] = {
    [1] = "叶符「纷乱的落叶」",
    ["n"] = 1
}
scZh["秋静叶"]["文花帖DS"] = {
    [1] = "秋符「Fall in Blast」（落入疾风）",
    [2] = "枯道「Lost Windrow」（遗失的叶堆）",
    ["n"] = 2
}

scZh["秋穰子"] = {}
scZh["秋穰子"]["风神录"] = {
    [1] = "秋符「Autumn Sky」（秋季的天空）",
    [2] = "秋符「无常秋日与少女的心」",
    [3] = "丰符「Otoshi Harvester」（大年收获者）",
    [4] = "丰收「谷物神的允诺」",
    ["n"] = 4
}
scZh["秋穰子"]["文花帖DS"] = {
    [1] = "实符「Warm Color Harvest」（暖色的收获）",
    [2] = "烧芋「Sweet Potato Room」（甜美的番薯房）",
    ["n"] = 2
}

scZh["键山雏"] = {}
scZh["键山雏"]["风神录"] = {
    [1] = "厄符「Bad Fortune」（厄运）",
    [2] = "厄符「厄神大人的Biorhythm」（厄神大人的生理节律）",
    [3] = "疵符「Broken Amulet」（破裂的护符）",
    [4] = "疵痕「损坏的护符」",
    [5] = "恶灵「Misfortune's Wheel」（厄运之轮）",
    [6] = "悲运「大钟婆之火」",
    [7] = "创符「Pain Flow」（痛苦之流）",
    [8] = "创符「流放人偶」",
    ["n"] = 8
}
scZh["键山雏"]["文花帖DS"] = {
    [1] = "厄野「禊川的沉积」",
    [2] = "灾祸「诅咒的雏人偶」",
    ["n"] = 2
}

scZh["河城荷取"] = {}
scZh["河城荷取"]["风神录"] = {
    [1] = "光学「Optical Camouflage」（光学迷彩）",
    [2] = "光学「Hydro-Camouflage」（水迷彩）",
    [3] = "洪水「Ooze Flooding」（泥浆泛滥）",
    [4] = "洪水「Diluvial Mare」（冲积梦魇）",
    [5] = "漂溺「粼粼水底的Trauma」（粼粼水底之心伤）",
    [6] = "水符「河童的Pororoca」（河童之河口浪潮）",
    [7] = "水符「河童的Flash flood」（河童之山洪暴发）",
    [8] = "水符「河童之幻想大瀑布」",
    [9] = "河童「妖怪Cucumber」（妖怪黄瓜）",
    [10] = "河童「延展Arm」（延展手臂）",
    [11] = "河童「Spin the Cephalic Plate」（回转顶板）",
    ["n"] = 11
}
scZh["河城荷取"]["文花帖DS"] = {
    [1] = "水符「Water Carpet」（水色绒毯）",
    [2] = "河符「Dividing Edge」（离断的棱边）",
    [3] = "河童「干燥尻子玉」",
    ["n"] = 3
}
scZh["河城荷取"]["心绮楼"] = {
    [1] = "豪雨「河底大战争」",
    [2] = "泡符「射击吧！Bubble Dragon」（射击吧！泡泡龙）",
    [3] = "战机「飞翔吧！三平Fight」（飞翔吧！三平加油）",
    [4] = "「Super Scope 3D」",
    [5] = "水符「夏天的Plastic Bottle Rocket」（夏天的塑料瓶火箭）",
    [6] = "妖怪战舰「三平Fighter」（三平战机）",
    ["n"] = 6
}
scZh["河城荷取"]["天邪鬼"] = {
    [1] = "瀑符「Shiraito Fall」（白丝瀑布）",
    [2] = "瀑符「Kegon Gun」（华严枪）",
    ["n"] = 2
}
scZh["河城荷取"]["深秘录"] = {
    [1] = "豪雨「河底大战争」",
    [2] = "泡符「射击吧！泡泡龙」",
    [3] = "战机「飞翔吧！三平加油」",
    [4] = "＊尼斯湖现在就在这里！＊",
    [5] = "＊尼西的完全养殖技术＊",
    ["n"] = 5
}
scZh["河城荷取"]["凭依华"] = {
    [1] = "豪雨「河底大战争」",
    [2] = "泡符「射击吧！泡泡龙」",
    [3] = "战机「飞翔吧！三平加油」",
    [4] = "＊尼斯湖现在就在这里！＊",
    [5] = "水面符「水泡弹假面舞会」",
    [6] = "拳水符「入道丛云水泡弹拳」",
    ["n"] = 6
}

scZh["犬走椛"] = {}
scZh["犬走椛"]["文花帖DS"] = {
    [1] = "狗符「Rabies Bite」（狂犬断噬）",
    [2] = "山窝「Expellees' Canaan」（遭放逐者的约定之地）",
    ["n"] = 2
}
scZh["犬走椛"]["天邪鬼"] = {
    [1] = "牙符「咀嚼玩味」",
    ["n"] = 1
}

scZh["东风谷早苗"] = {}
scZh["东风谷早苗"]["风神录"] = {
    [1] = "秘术「Gray Thaumaturgy」（灰色奇术）",
    [2] = "秘术「遗忘之祭仪」",
    [3] = "秘术「单脉相传之弹幕」",
    [4] = "奇迹「白昼的客星」",
    [5] = "奇迹「客星璀璨之夜」",
    [6] = "奇迹「客星辉煌之夜」",
    [7] = "开海「海水分开之日」",
    [8] = "开海「Moses之奇迹」（摩西之奇迹）",
    [9] = "准备「呼唤神风的星之仪式」",
    [10] = "准备「Summon建御名方神」（召请建御名方神）",
    [11] = "奇迹「神之风」",
    [12] = "大奇迹「八坂之神风」",
    ["n"] = 12
}
scZh["东风谷早苗"]["地灵殿"] = {
    [1] = "秘法「九字切」",
    [2] = "奇迹「Miracle Fruit」（神秘果）",
    [3] = "神德「五谷丰穰Rice Shower」（五谷丰穰米之浴）",
    ["n"] = 3
}
scZh["东风谷早苗"]["星莲船"] = {
    [1] = "蛇符「神代大蛇」",
    [2] = "蛙符「操纵蛤蟆」",
    ["n"] = 2
}
scZh["东风谷早苗"]["非想天则"] = {
    [1] = "祈愿「守护商业繁荣」",
    [2] = "秘术「Gray Thaumaturgy」（灰色奇术）",
    [3] = "神签「暴乱神签连掷」",
    [4] = "开海「海水分开之日」",
    [5] = "奇迹「白昼的客星」",
    [6] = "秘术「遗忘之祭仪」",
    [7] = "奇迹「客星辉煌之夜」",
    [8] = "开海「Moses之奇迹」（摩西之奇迹）",
    [9] = "秘法「九字切」",
    [10] = "蛇符「云泳大蛇」",
    [11] = "奇迹「falls-from-the-skies的奇迹」（空中落物的奇迹）",
    ["n"] = 11
}
scZh["东风谷早苗"]["文花帖DS"] = {
    [1] = "奇迹「弘安的神风」",
    [2] = "蛙符「操纵蛤蟆」",
    [3] = "妖怪退治「妖力Spoiler」（妖力掠夺者）",
    ["n"] = 3
}
scZh["东风谷早苗"]["神灵庙"] = {
    [1] = "秘术「Gray Thaumaturgy」（灰色奇术）",
    ["n"] = 1
}
scZh["东风谷早苗"]["天邪鬼"] = {
    [1] = "蛇符「Bind Snake Come On」（缠蛇上吧）",
    [2] = "蛇符「Green Snake Come On」（绿蛇上吧）",
    ["n"] = 2
}
scZh["东风谷早苗"]["绀珠传"] = {
    [1] = "蛙符「操纵蛤蟆」",
    ["n"] = 1
}

scZh["八坂神奈子"] = {}
scZh["八坂神奈子"]["风神录"] = {
    [1] = "神祭「Expanded Onbashira」（扩展御柱）",
    [2] = "奇祭「目处梃子乱舞」",
    [3] = "筒粥「神之粥」",
    [4] = "忘谷「Unremembered Crop」（遗忘之谷）",
    [5] = "神谷「Divining Crop」（神灵之谷）",
    [6] = "贽符「御射山御狩神事」",
    [7] = "神秘「葛井之清水」",
    [8] = "神秘「Yamato Torus」（大和环面）",
    [9] = "天流「天水奇迹」",
    [10] = "天龙「雨之源泉」",
    [11] = "「Mountain of Faith」（信仰之山）",
    [12] = "「风神之神德」",
    [13] = "神符「如水眼之美丽源泉」",
    [14] = "神符「结于杉木之古缘」",
    [15] = "神符「神所踏足之御神渡」",
    ["n"] = 15
}
scZh["八坂神奈子"]["文花帖DS"] = {
    [1] = "蛇符「Ground Serpent」（伏地的巨蛇星）",
    [2] = "御柱「Meteoric Onbashira」（流星般的御柱）",
    [3] = "儚道「御神渡Cross」（御神渡路口）",
    ["n"] = 3
}
scZh["八坂神奈子"]["天邪鬼"] = {
    [1] = "御柱「Rising Onbashira」（上升御柱）",
    [2] = "「神明的威光」",
    ["n"] = 2
}
scZh["八坂神奈子"]["噩梦日记"] = {
    [1] = "风神符「御射军神柱」",
    [2] = "风妖符「死蝶御柱」",
    [3] = "风花符「御柱裁判」",
    ["n"] = 3
}

scZh["洩矢诹访子"] = {}
scZh["洩矢诹访子"]["风神录"] = {
    [1] = "开宴「二拜二拍一拜」",
    [2] = "土著神「手长足长大人」",
    [3] = "神具「洩矢的铁轮」",
    [4] = "源符「厌川的翡翠」",
    [5] = "蛙狩「蛙以口鸣，方致蛇祸」",
    [6] = "土著神「七石七木」",
    [7] = "土著神「小小青蛙不输风雨」",
    [8] = "土著神「宝永四年的赤蛙」",
    [9] = "「诹访大战 ～ 土著神话 vs 中央神话」",
    [10] = "祟符「洩矢大人」",
    ["n"] = 10
}
scZh["洩矢诹访子"]["非想天则"] = {
    [1] = "源符「诹访清水」",
    [2] = "神具「洩矢的铁轮」",
    [3] = "土著神「洩矢神」",
    [4] = "开宴「二拜二拍一拜」",
    [5] = "土著神「小小青蛙不输风雨」",
    [6] = "源符「厌川的翡翠」",
    [7] = "蛙狩「蛙以口鸣，方致蛇祸」",
    [8] = "土著神「手长足长大人」",
    [9] = "土著神「宝永四年的赤蛙」",
    [10] = "蛙休「Always能冬眠」（总是能够冬眠）",
    [11] = "祟神「赤口大人」",
    [12] = "合掌「大太法师的参拜」",
    [13] = "神具「洩矢的铁轮」",
    [14] = "「炽如地狱的间歇泉」",
    [15] = "「Magma的两栖类」（岩浆的两栖类）",
    [16] = "「幻想乡空中神战」",
    ["n"] = 16
}
scZh["洩矢诹访子"]["文花帖DS"] = {
    [1] = "神樱「湛樱花吹雪」",
    [2] = "姬川「Princess Jade Green」（姬川的翡翠）",
    [3] = "铁轮「Mythical Ring」（神谕之环）",
    [4] = "土地神「御射军神大人」",
    ["n"] = 4
}
scZh["洩矢诹访子"]["天邪鬼"] = {
    [1] = "绿石「Jade Break」（翡翠破碎）",
    [2] = "蛙符「涂有鲜血的赤蛙塚」",
    ["n"] = 2
}
scZh["洩矢诹访子"]["噩梦日记"] = {
    [1] = "风神符「御射军神柱」",
    [2] = "风花符「御射军神大人的是非」",
    [3] = "妖风符「土著蝶风暴」",
    ["n"] = 3
}

scZh["永江衣玖"] = {}
scZh["永江衣玖"]["绯想天"] = {
    [1] = "电符「雷鼓弹」",
    [2] = "鱼符「龙鱼Drill」（龙鱼电钻）",
    [3] = "雷符「electricity的龙宫」（电气的龙宫）",
    [4] = "光星「光龙之叹息」",
    [5] = "雷鱼「雷云鱼游泳弹」",
    [6] = "羽衣「羽衣若空」",
    [7] = "棘符「雷云棘鱼」",
    [8] = "龙鱼「龙宫使的游泳弹」",
    [9] = "光玉「闪光之龙眼」",
    [10] = "雷符「神鸣者的住处」",
    [11] = "棘符「雷云棘鱼」",
    [12] = "云界「玄云海的雷庭」",
    ["n"] = 12
}
scZh["永江衣玖"]["非想天则"] = {
    [1] = "羽衣「羽衣若时」",
    [2] = "珠符「五爪龙之珠」",
    ["n"] = 2
}
scZh["永江衣玖"]["文花帖DS"] = {
    [1] = "雷符「Lightning Fish」（鱼泳雷鸣）",
    [2] = "珠符「五爪龙之珠」",
    [3] = "龙宫「鲷和比目鱼的dance」（鲷和比目鱼的舞蹈）",
    [4] = "龙鱼「龙宫使的游泳弹」",
    ["n"] = 4
}
scZh["永江衣玖"]["噩梦日记"] = {
    [1] = "辉天符「迅雷的咚咚太鼓」",
    [2] = "绯星符「正体不明的落雷」",
    [3] = "神绯符「雷雨中的跟踪狂」",
    ["n"] = 3
}

scZh["比那名居天子"] = {}
scZh["比那名居天子"]["绯想天"] = {
    [1] = "地符「不让土壤之剑」",
    [2] = "非想「非想非非想之剑」",
    [3] = "天符「天道是非之剑」",
    [4] = "地震「先忧后乐之剑」",
    [5] = "气符「天启气象之剑」",
    [6] = "要石「天地开辟Press」（天地开辟之挤压）",
    [7] = "气符「无念无想的境界」",
    [8] = "「全人类的绯想天」",
    [9] = "要石「天空之灵石」",
    [10] = "乾坤「粗暴而又像母亲般的大地啊」",
    [11] = "灵想「镇守大地之石」",
    [12] = "天地「俯瞰世界的遥远的大地啊」",
    [13] = "「全人类的绯想天」",
    ["n"] = 13
}
scZh["比那名居天子"]["非想天则"] = {
    [1] = "剑技「气焰万丈之剑」",
    [2] = "天气「绯想天促」",
    ["n"] = 2
}
scZh["比那名居天子"]["文花帖DS"] = {
    [1] = "气性「勇气凛凛之剑」",
    [2] = "地震「避难险路」",
    [3] = "要石「要石浮游炮」",
    [4] = "「全人类的绯想天」",
    ["n"] = 4
}
scZh["比那名居天子"]["天邪鬼"] = {
    [1] = "「全妖怪的绯想天」",
    [2] = "「鹿岛镇护」",
    ["n"] = 2
}
scZh["比那名居天子"]["凭依华"] = {
    [1] = "要石「要石浮游炮」",
    [2] = "地符「一击震乾坤」",
    [3] = "桃符「固若金汤的仙桃」",
    [4] = "＊大气圈尽在吾之手中＊",
    [5] = "升槌符「载着我们的梦变大吧」",
    [6] = "坠槌符「梦坠入大气圈变大吧」",
    [7] = "「全小人族的绯想天」",
    [8] = "梦要符「羊毛色的乾坤一掷」",
    [9] = "升符「飞向遥远的宇宙吧！ 载着我们的梦想」",
    [10] = "坠符「落入大气圈，梦想倾泻地表」",
    [11] = "「把大地重塑成，有梦的世界吧！」",
    [12] = "「巨型战舰 无双大鲶鱼参见」",
    [13] = "「全宇宙人的绯想天」",
    ["n"] = 13
}
scZh["比那名居天子"]["噩梦日记"] = {
    [1] = "绯针符「要石也给我变大吧」",
    [2] = "永绯符「坠落的壶中有顶天」",
    [3] = "绯夜符「蓬莱之弹的要石」",
    ["n"] = 3
}

scZh["琪斯美"] = {}
scZh["琪斯美"]["地灵殿"] = {
    [1] = "怪奇「钓瓶落之怪」",
    ["n"] = 1
}
scZh["琪斯美"]["文花帖DS"] = {
    [1] = "钓瓶「飞入井中」",
    [2] = "钓瓶「Well Destructor」（井下的毁灭者）",
    ["n"] = 2
}

scZh["黑谷山女"] = {}
scZh["黑谷山女"]["地灵殿"] = {
    [1] = "罠符「Capture Web」（捕捉之网）",
    [2] = "蜘蛛「石窟的蜘蛛巢」",
    [3] = "瘴符「Field Miasma」（瘴气场）",
    [4] = "瘴气「原因不明的热病」",
    ["n"] = 4
}
scZh["黑谷山女"]["文花帖DS"] = {
    [1] = "细网「犍陀多Rope」（犍陀多绳索）",
    [2] = "毒符「桦黄小町」",
    ["n"] = 2
}

scZh["水桥"] = {}
scZh["水桥"]["地灵殿"] = {
    [1] = "妒符「Green-Eyed Monster」（绿眼怪兽）",
    [2] = "嫉妒「看不见的绿眼怪兽」",
    [3] = "开花爷爷「对华丽的仁者之嫉妒」",
    [4] = "开花爷爷「小白的灰烬」",
    [5] = "剪舌麻雀「对谦虚的富者之记恨」",
    [6] = "剪舌麻雀「大葛笼与小葛笼」",
    [7] = "恨符「丑时参拜」",
    [8] = "恨符「丑时参拜第七日」",
    ["n"] = 8
}
scZh["水桥"]["文花帖DS"] = {
    [1] = "嫉妒「Jealousy Bomber」（嫉妒爆发）",
    [2] = "怨恨念法「积怨返」",
    ["n"] = 2
}

scZh["星熊勇仪"] = {}
scZh["星熊勇仪"]["地灵殿"] = {
    [1] = "鬼符「怪力乱神」",
    [2] = "怪轮「地狱之苦轮」",
    [3] = "枷符「罪人不释之枷」",
    [4] = "力业「大江山岚」",
    [5] = "力业「大江山颪」",
    [6] = "四天王奥义「三步必杀」",
    ["n"] = 6
}
scZh["星熊勇仪"]["文花帖DS"] = {
    [1] = "光鬼「金刚螺旋」",
    [2] = "鬼符「鬼气狂澜」",
    [3] = "鬼声「毁灭之咆哮」",
    ["n"] = 3
}

scZh["古明地觉"] = {}
scZh["古明地觉"]["地灵殿"] = {
    [1] = "回忆「Terrible Souvenir」（恐怖的回忆）",
    [2] = "回忆「恐怖催眠术」",
    [3] = "回忆「二重黑死蝶」",
    [4] = "回忆「飞行虫Nest」（飞行虫之巢）",
    [5] = "回忆「波与粒的境界」",
    [6] = "回忆「户隐山之投」",
    [7] = "回忆「百万鬼夜行」",
    [8] = "回忆「蒙蒙迷雾」",
    [9] = "回忆「风神木叶隐身术」",
    [10] = "想起「天狗的Macro burst」（天狗巨暴流）",
    [11] = "回忆「鸟居旋风」",
    [12] = "回忆「春之京都人偶」",
    [13] = "回忆「Straw Doll Kamikaze」（稻草人偶敢死队）",
    [14] = "回忆「Return Inanimateness」（回归虚无）",
    [15] = "回忆「Mercury Poison」（水银之毒）",
    [16] = "回忆「Princess Undine」（水精公主）",
    [17] = "回忆「贤者之石」",
    [18] = "回忆「延展Arm」（延展手臂）",
    [19] = "回忆「河童的Pororoca」（河童之河口浪潮）",
    [20] = "回忆「粼粼水底的Trauma」（粼粼水底之心伤）",
    ["n"] = 20
}
scZh["古明地觉"]["文花帖DS"] = {
    [1] = "脑符「Brain Fingerprint」（脑指纹测谎法）",
    [2] = "心花「Camera-Shy Rose」（厌于留影的羞涩蔷薇）",
    [3] = "回忆「朦胧记忆中的金阁寺」",
    ["n"] = 3
}
scZh["古明地觉"]["噩梦日记"] = {
    [1] = "地灵符「Mind Stellar Still」",
    [2] = "「Perfect Mind Control」",
    [3] = "地妖符「自我的式神」",
    ["n"] = 3
}

scZh["火焰猫燐"] = {}
scZh["火焰猫燐"]["地灵殿"] = {
    [1] = "猫符「Cat's Walk」（猫的步伐）",
    [2] = "猫符「怨灵猫乱步」",
    [3] = "咒精「Zombie Fairy」（僵尸妖精）",
    [4] = "咒精「怨灵凭依妖精」",
    [5] = "恨灵「Spleen Eater」（脾脏蛀食者）",
    [6] = "尸灵「食人怨灵」",
    [7] = "赎罪「旧地狱的针山」",
    [8] = "赎罪「古时之针与痛楚的怨灵」",
    [9] = "「死灰复燃」",
    [10] = "「小恶灵复活」",
    [11] = "妖怪「火焰的车轮」",
    ["n"] = 11
}
scZh["火焰猫燐"]["文花帖DS"] = {
    [1] = "死符「Ghost Town」（怨灵城）",
    [2] = "「尸体繁华街」",
    [3] = "醉步「Cat Random Walk」（猫的乱步）",
    ["n"] = 3
}

scZh["灵乌路空"] = {}
scZh["灵乌路空"]["地灵殿"] = {
    [1] = "核热「Nuclear Fusion」（核聚变）",
    [2] = "核热「Nuclear Excursion」（核功率骤增）",
    [3] = "核热「核反应失控」",
    [4] = "爆符「Petit Flare」（小型耀斑）",
    [5] = "爆符「Mega-Flare」（百万耀斑）",
    [6] = "爆符「Giga-Flare」（十亿耀斑）",
    [7] = "爆符「Peta-Flare」（千兆耀斑）",
    [8] = "焰星「Fixed Star」（恒星）",
    [9] = "焰星「Planetary Revolution」（行星公转）",
    [10] = "焰星「十凶星」",
    [11] = "「地狱极乐Melt Down」（地狱极乐熔毁）",
    [12] = "「Hell's Tokamak」（地狱的托卡马克装置）",
    [13] = "「地狱的人造太阳」",
    [14] = "「Subterranean Sun」（地底的太阳）",
    ["n"] = 14
}
scZh["灵乌路空"]["非想天则"] = {
    [1] = "「地狱的人造太阳」",
    [2] = "控制「Self Tokamak」（自动托卡马克装置）",
    [3] = "遮光「核热Visor」（核热护罩）",
    [4] = "爆符「Mega-Flare」（百万耀斑）",
    [5] = "焰星「Fixed Star」（恒星）",
    [6] = "核符「Creeping Sun」（缓行的太阳）",
    [7] = "光热「High Tension Blade」（高压光刃）",
    [8] = "焰星「十凶星」",
    [9] = "地热「核Blaze Geyser」（核焰喷涌）",
    [10] = "鸦符「八咫乌Dive」（八咫乌俯冲）",
    [11] = "核热「核反应失控Dive」（核反应失控疾冲）",
    [12] = "「Subterranean Sun」（地底的太阳）",
    [13] = "爆符「Giga-Flare」（十亿耀斑）",
    [14] = "「Abyss Nova」（深渊新星）",
    [15] = "热符「Break Prominence」（破碎日珥）",
    [16] = "核热「核反应失控Dive」（核反应失控疾冲）",
    [17] = "「Hot Jupiter降落Model」（热木星降落模型）",
    [18] = "核热「人工太阳的黑子」",
    ["n"] = 18
}
scZh["灵乌路空"]["文花帖DS"] = {
    [1] = "熔解「Melting White」（消熔的纯白）",
    [2] = "巨星「Red Giant」（红巨星）",
    [3] = "星符「巨星陨落」",
    [4] = "七星「Septentrion」（北斗星辰）",
    ["n"] = 4
}
scZh["灵乌路空"]["噩梦日记"] = {
    [1] = "地灵符「Mind Stellar Still」",
    [2] = "地妖符「式神大星」",
    [3] = "地灵符「Mind Stellar Relief」",
    ["n"] = 3
}

scZh["古明地恋"] = {}
scZh["古明地恋"]["地灵殿"] = {
    [1] = "表象「祖先托梦」",
    [2] = "表象「弹幕Paranoia」（弹幕偏执症）",
    [3] = "本能「ID的解放」（本我的解放）",
    [4] = "抑制「Super Ego」（超我）",
    [5] = "反应「妖怪Polygraph」（妖怪测谎机）",
    [6] = "潜意识「弹幕的Rorschach」（弹幕的墨迹测验）",
    [7] = "复燃「恋爱的埋火」",
    [8] = "深层「潜意识的基因」",
    [9] = "「被厌恶者的Philosophy」（被厌恶者的哲学）",
    [10] = "「Subterranean Rose」（地底的蔷薇）",
    ["n"] = 10
}
scZh["古明地恋"]["文花帖DS"] = {
    [1] = "心符「没我之爱」",
    [2] = "记忆「DNA的瑕疵」",
    [3] = "「胎儿之梦」",
    [4] = "「Rose地狱」（蔷薇地狱）",
    ["n"] = 4
}
scZh["古明地恋"]["心绮楼"] = {
    [1] = "抑制「Super Ego」（超我）",
    [2] = "本能「ID的解放」（本我的解放）",
    [3] = "梦符「先祖大人在看着你」",
    [4] = "「Brambly Rose Garden」（带刺的蔷薇园）",
    [5] = "本能「Freudian」（弗洛伊德学说）",
    [6] = "茨符「Confined Innocent」（狭隘的天真）",
    ["n"] = 6
}
scZh["古明地恋"]["深秘录"] = {
    [1] = "抑制「Super Ego」（超我）",
    [2] = "本能「本我的解放」",
    [3] = "梦符「先祖大人在看着你」",
    [4] = "＊现在就给你打电话别忘了接哦＊",
    [5] = "＊被诅咒的响一声电话＊",
    ["n"] = 5
}
scZh["古明地恋"]["凭依华"] = {
    [1] = "抑制「Super Ego」（超我）",
    [2] = "本能「本我的解放」",
    [3] = "梦符「先祖大人在看着你」",
    [4] = "＊现在就给你打电话别忘了接哦＊",
    [5] = "星恋符「Sprinkle Star & Heart」（星星心心洒）",
    [6] = "恋拳符「玫瑰狂想曲怪云拳」",
    [7] = "槌恋符「大判小判叮叮当心」",
    ["n"] = 7
}
scZh["古明地恋"]["噩梦日记"] = {
    [1] = "地妖符「本我的式神」",
    [2] = "「Perfect Mind Control」",
    [3] = "地灵符「Mind Stellar Relief」",
    ["n"] = 3
}

scZh["娜兹玲"] = {}
scZh["娜兹玲"]["星莲船"] = {
    [1] = "棒符「Busy Rod」（忙碌探知棒）",
    [2] = "搜符「Rare Metal Detector」（稀有金属探测器）",
    [3] = "搜符「Gold Detector」（黄金探测器）",
    [4] = "视符「Nazrin Pendulum」（娜兹玲灵摆）",
    [5] = "视符「高感度Nazrin Pendulum」（高感度娜兹玲灵摆）",
    [6] = "守符「Pendulum Guard」（灵摆防御）",
    [7] = "宝塔「Greatest Treasure」（最优良的宝物）",
    ["n"] = 7
}
scZh["娜兹玲"]["文花帖DS"] = {
    [1] = "棒符「Nazrin Rod」（娜兹玲探宝棒）",
    [2] = "财宝「Gold Rush」（淘金潮）",
    ["n"] = 2
}

scZh["多多良小伞"] = {}
scZh["多多良小伞"]["星莲船"] = {
    [1] = "大轮「唐伞光晕」",
    [2] = "大轮「Hello,Forgotten World」（你好，被遗忘的世界）",
    [3] = "伞符「Parasol Star Symphony」（雨伞的星之交响）",
    [4] = "伞符「Parasol Star Memories」（雨伞的星之追忆）",
    [5] = "雨符「雨夜怪谈」",
    [6] = "雨伞「超防水干爽伞妖」",
    [7] = "化符「遗忘之伞的夜行列车」",
    [8] = "化铁「备用伞特急Night Carnival」（备用伞特急夜晚狂欢号）",
    [9] = "伞符「大颗的泪雨」",
    [10] = "惊雨「台风骤雨」",
    [11] = "光晕「唐伞惊吓Flash」（唐伞惊吓闪光）",
    ["n"] = 11
}
scZh["多多良小伞"]["文花帖DS"] = {
    [1] = "伞符「单脚Pitcher返」（单脚投手返）",
    [2] = "虹符「Over the Rainbow」（飞跃彩虹）",
    [3] = "伞符「细雪的过客」",
    ["n"] = 3
}
scZh["多多良小伞"]["神灵庙"] = {
    [1] = "虹符「Umbrella Cyclone」（雨伞风暴）",
    ["n"] = 1
}

scZh["云居一轮"] = {}
scZh["云居一轮"]["星莲船"] = {
    [1] = "铁拳「问答无用妖怪拳」",
    [2] = "神拳「凌云地狱冲」",
    [3] = "神拳「天海地狱冲」",
    [4] = "拳符「天网Sandbag」（天网沙袋）",
    [5] = "连打「云界Kraken来袭」（云界海妖来袭）",
    [6] = "连打「King Kraken来袭」（帝王海妖来袭）",
    [7] = "拳打「重拳Smash」（重拳碎击）",
    [8] = "溃灭「天上天下连续Hook」（天上天下连续勾拳）",
    [9] = "大喝「守旧尊老之怒眼」",
    [10] = "忿怒「天变巨眼焚身」",
    [11] = "忿怒「空前绝后巨眼焚身」",
    ["n"] = 11
}
scZh["云居一轮"]["文花帖DS"] = {
    [1] = "拳骨「天空铁锤落」",
    [2] = "稻妻「带电入道」",
    [3] = "铁拳「入道唰」",
    ["n"] = 3
}
scZh["云居一轮"]["心绮楼"] = {
    [1] = "岚符「佛罚的秋台风」",
    [2] = "积乱「见越入道云」",
    [3] = "拳固「忏悔的杀风」",
    [4] = "「华丽的老爹时代」",
    [5] = "拳符「愤怒的大云块」",
    [6] = "入道「夏之幻想太郎」",
    ["n"] = 6
}
scZh["云居一轮"]["深秘录"] = {
    [1] = "岚符「佛罚的秋台风」",
    [2] = "积乱「见越入道云」",
    [3] = "拳固「忏悔的杀风」",
    [4] = "＊265厘米的魔人现身！＊",
    [5] = "恶符「八丈高的灵异柱」",
    [6] = "＊被谜之女子囚禁的仲夏之夜＊",
    ["n"] = 6
}
scZh["云居一轮"]["凭依华"] = {
    [1] = "岚符「佛罚的秋台风」",
    [2] = "积乱「见越入道云」",
    [3] = "拳固「忏悔的杀风」",
    [4] = "＊265厘米的魔人现身！＊",
    [5] = "拳风符「入道丛云风水拳」",
    [6] = "拳星符「入道丛云Slave Spark」（入道丛云下仆火花）",
    [7] = "击拳符「韦驮天的怪云拳」",
    [8] = "恋拳符「玫瑰狂想曲怪云拳」",
    [9] = "光拳符「因陀罗的金刚杵怪云拳」",
    [10] = "拳水符「入道丛云水泡弹拳」",
    ["n"] = 10
}

scZh["村纱水蜜"] = {}
scZh["村纱水蜜"]["星莲船"] = {
    [1] = "倾覆「同路人Anchor」（同路人之锚）",
    [2] = "倾覆「沉没Anchor」（沉没之锚）",
    [3] = "倾覆「击沉Anchor」（击沉之锚）",
    [4] = "溺符「Deep Vortex」（深海漩涡）",
    [5] = "溺符「Sinkable Vortex」（沉底漩涡）",
    [6] = "港符「Phantom Ship Harbor」（幽灵船之泊）",
    [7] = "港符「幽灵船之港」",
    [8] = "港符「幽灵船永久停泊」",
    [9] = "幽灵「Sinker Ghost」（使船沉没的幽灵）",
    [10] = "幽灵「悄然袭来的长勺」",
    ["n"] = 10
}
scZh["村纱水蜜"]["文花帖DS"] = {
    [1] = "锚符「幽灵船长期停泊」",
    [2] = "浸水「船底的Venus」（船底的维纳斯）",
    [3] = "「Deep Sinker」（深深沉没）",
    ["n"] = 3
}

scZh["寅丸星"] = {}
scZh["寅丸星"]["星莲船"] = {
    [1] = "宝塔「Radiant Treasure」（光辉之宝）",
    [2] = "宝塔「Radiant Treasure Gun」（光辉宝枪）",
    [3] = "光符「Absolute Justice」（绝对正义）",
    [4] = "光符「正义之威光」",
    [5] = "法力「至宝之独钴杵」",
    [6] = "法灯「无瑕佛法之独钴杵」",
    [7] = "光符「净化之魔」",
    [8] = "「Complete Clarification」（完全净化）",
    ["n"] = 8
}
scZh["寅丸星"]["文花帖DS"] = {
    [1] = "寅符「Hungry Tiger」（饿虎）",
    [2] = "天符「焦土曼荼罗」",
    [3] = "宝符「黄金的震眩」",
    ["n"] = 3
}

scZh["圣白莲"] = {}
scZh["圣白莲"]["星莲船"] = {
    [1] = "魔法「紫云的Omen」（紫云之兆）",
    [2] = "吉兆「紫色云路」",
    [3] = "吉兆「极乐的紫色云路」",
    [4] = "魔法「魔界蝶之妖香」",
    [5] = "魔法「Magic Butterfly」（魔法之蝶）",
    [6] = "光魔「Star Maelstrom」（星辰之涡）",
    [7] = "光魔「魔法银河系」",
    [8] = "大魔法「魔神复诵」",
    [9] = "「圣尼公的Air卷轴」（圣尼公之大空卷轴）",
    [10] = "超人「圣白莲」",
    [11] = "飞钵「Flying Fantastica」（幻想的飞行）",
    [12] = "飞钵「传说的飞空圆盘」",
    ["n"] = 12
}
scZh["圣白莲"]["文花帖DS"] = {
    [1] = "「游行圣」",
    [2] = "习合「垂迹大日如来」",
    [3] = "「Star Sword护法」（星之剑护法）",
    ["n"] = 3
}
scZh["圣白莲"]["心绮楼"] = {
    [1] = "天符「三千大千世界之主」",
    [2] = "天符「大日如来的光辉」",
    [3] = "天符「释迦牟尼的五行山」",
    [4] = "「Angirasa Veda」（阿诣罗吠陀）",
    [5] = "杵符「金刚手菩萨的咒文」",
    [6] = "超人「迦楼罗之翼」",
    ["n"] = 6
}
scZh["圣白莲"]["天邪鬼"] = {
    [1] = "「黑天的束缚」",
    [2] = "「梵天之瞳」",
    ["n"] = 2
}
scZh["圣白莲"]["深秘录"] = {
    [1] = "天符「三千大千世界之主」",
    [2] = "天符「大日如来的光辉」",
    [3] = "天符「释迦牟尼的五行山」",
    [4] = "＊以100迈驰骋天际！＊",
    [5] = "超音速「老妇人的冲刺」",
    [6] = "＊高速路涡轮空中转向＊",
    [7] = "＊涡轮老太婆走死走爱＊",
    [8] = "光符「因陀罗的金刚杵」",
    [9] = "超人「圣白莲」",
    [10] = "超人「大追踪！Buddhist Rider」（僧侣骑士）",
    ["n"] = 10
}
scZh["圣白莲"]["凭依华"] = {
    [1] = "天符「三千大千世界之主」",
    [2] = "天符「大日如来的光辉」",
    [3] = "天符「释迦牟尼的五行山」",
    [4] = "＊以100迈驰骋天际！＊",
    [5] = "光击符「引导着你的王道的金刚杵射击」",
    [6] = "击拳符「韦驮天的怪云拳」",
    [7] = "击光符「韦驮天的王道威光」",
    [8] = "蹴斩符「迦楼罗的圣德斩」",
    [9] = "光仙符「日出之国的僧侣和道士」",
    [10] = "光拳符「因陀罗的金刚杵怪云拳」",
    [11] = "击符「被韦驮天追逐的正梦」",
    ["n"] = 11
}
scZh["圣白莲"]["噩梦日记"] = {
    [1] = "星神符「十七条的超人」",
    [2] = "红星符「超人血刀」",
    [3] = "红星符「超人大灾变行脚」",
    ["n"] = 3
}

scZh["封兽鵺"] = {}
scZh["封兽鵺"]["星莲船"] = {
    [1] = "妖云「平安时代的Dark Cloud」（平安时代的黑云）",
    [2] = "真相不明「愤怒的Red UFO袭来」（愤怒的红色UFO袭来）",
    [3] = "鵺符「鵺的Snake Show」（鵺的蛇行表演）",
    [4] = "真相不明「哀愁的Blue UFO袭来」（哀愁的蓝色UFO袭来）",
    [5] = "鵺符「弹幕Chimera」（弹幕奇美拉）",
    [6] = "真相不明「忠义的Green UFO袭来」（忠义的绿色UFO袭来）",
    [7] = "鵺符「Undefined Darkness」（真相不明的黑暗）",
    [8] = "真相不明「恐怖的虹色UFO袭来」",
    [9] = "「平安京的恶梦」",
    [10] = "恨弓「源三位赖政之弓」",
    ["n"] = 10
}
scZh["封兽鵺"]["文花帖DS"] = {
    [1] = "真相不明「紫镜」",
    [2] = "真相不明「红mantle蓝mantle」（红披风蓝披风）",
    [3] = "真相不明「厕所里的花子」",
    [4] = "「自行星而来的弹幕X」",
    ["n"] = 4
}
scZh["封兽鵺"]["神灵庙"] = {
    [1] = "Unknown（未知）「轨道不明的鬼火」",
    [2] = "Unknown（未知）「姿态不明的空鱼」",
    [3] = "Unknown（未知）「原理不明的妖怪玉」",
    ["n"] = 3
}
scZh["封兽鵺"]["噩梦日记"] = {
    [1] = "神星符「正体不明的怪光人潮」",
    [2] = "绯星符「正体不明的落雷」",
    [3] = "辉星符「正体不明的咚咚太鼓」",
    ["n"] = 3
}

scZh["大鲶鱼"] = {}
scZh["大鲶鱼"]["非想天则"] = {
    [1] = "鲶鱼「看哪，世界在震动哦？」",
    [2] = "鲶鱼「土壤液化现象让大地也像泥一样了！」",
    [3] = "鲶鱼「即使是发电也会努力哦？」",
    [4] = "鲶鱼「All电气化更Ecology！」（全电气化更加环保！）",
    [5] = "大鲶鱼「这一招出来，连尘世都要完结了！！」",
    ["n"] = 5
}

scZh["姬海棠果"] = {}
scZh["姬海棠果"]["文花帖DS"] = {
    [1] = "采访「姬海棠果的采访练习」",
    [2] = "连拍「Rapid Shot」（连续摄像）",
    [3] = "远视「天狗Psychography」（天狗念写法）",
    ["n"] = 3
}
scZh["姬海棠果"]["天邪鬼"] = {
    [1] = "写真「Full Panorama Shot」（全景拍摄）",
    [2] = "写真「足不出户的狗仔队」",
    ["n"] = 2
}

scZh["光之三妖精"] = {}
scZh["光之三妖精"]["大战争"] = {
    [1] = "光符「Rutile Flection」（金红石折射）",
    [2] = "空符「Elfin Canopy」（苍穹中的精灵）",
    [3] = "光符「Triple Meteor」（三重陨石）",
    [4] = "光星「Orion Belt」（猎户座腰带）",
    [5] = "光符「Bright Night」（白夜）",
    [6] = "空符「Break Canopy」（天穹破裂）",
    [7] = "光符「Extensive Meteor」（广域流星）",
    [8] = "光星「Great Triangle」（大三角）",
    [9] = "光符「Full Moon Night」（满月之夜）",
    [10] = "降光「Triple Light」（三重光芒）",
    [11] = "光符「Hyper Inflection」（激光折射）",
    [12] = "激光「Sun Burst」（太阳爆发）",
    [13] = "星热「Ice Dissolver」（寒冰熔解器）",
    [14] = "月热「Ice Dissolver」（寒冰熔解器）",
    [15] = "日热「Ice Dissolver」（寒冰熔解器）",
    [16] = "协力技「Fairy Overdrive」（妖精大暴走）",
    [17] = "「Three Fairies」（三月精）",
    ["n"] = 17
}

scZh["桑尼"] = {}
scZh["桑尼"]["大战争"] = {
    [1] = "阳光「Sunshine Blast」（阳光冲击波）",
    [2] = "虹光「Prism Flash」（棱镜闪光）",
    [3] = "光精「Diamond Ring」（钻石之环）",
    [4] = "光符「Blue Deflection」（蓝色偏移）",
    [5] = "日符「Aggressive Light」（咄咄逼人的光亮）",
    [6] = "日符「Direct Sunlight」（阳光直射）",
    [7] = "瞬光「Fatal Flash」（致命闪光）",
    [8] = "光精「Cross Diffusion」（交叉反射）",
    [9] = "光符「Yellow Deflection」（黄色偏移）",
    [10] = "阳光「Sunshine Needle」（日光芒针）",
    ["n"] = 10
}

scZh["露娜"] = {}
scZh["露娜"]["大战争"] = {
    [1] = "月符「Lunatic Rain」（狂雨）",
    [2] = "月符「Luna Cyclone」（月面气旋）",
    [3] = "月光「Slient Storm」（寂静风暴）",
    [4] = "月光「Dark Stillness」（黑暗寂静）",
    [5] = "障光「Moonlight Wall」（月光墙）",
    [6] = "夜符「Night Fairies」（夜晚的妖精）",
    [7] = "月光「Slient Flower」（花开无声）",
    [8] = "月光「Moon Stillness」（寂静之月）",
    [9] = "光壁「Wall Break」（凿壁偷光）",
    [10] = "月光「Silent Cyclone」（静默旋风）",
    ["n"] = 10
}

scZh["斯塔"] = {}
scZh["斯塔"]["大战争"] = {
    [1] = "流星「Petit Comet」（小型彗星）",
    [2] = "星粒「Sprinkle Piece」（星星点点）",
    [3] = "星符「Twinkle Sapphire」（闪耀蓝宝石）",
    [4] = "星光「Star Laser」（星辰镭射）",
    [5] = "流星「Comet Stream」（彗星激流）",
    [6] = "星粒「Star Piece Shower」（星尘阵雨）",
    [7] = "星符「Shooting Sapphire」（蓝宝石喷射）",
    [8] = "星光「Star Storm」（星尘飓风）",
    [9] = "星符「Starlight Rain」（星光雨）",
    [10] = "星符「Red Star」（红星）",
    ["n"] = 10
}

scZh["幽谷响子"] = {}
scZh["幽谷响子"]["神灵庙"] = {
    [1] = "响符「Mountain Echo」（山谷回声）",
    [2] = "响符「Mountain Echo Scramble」（混乱的山谷回声）",
    [3] = "响符「Power Resonance」（强力共振）",
    [4] = "山彦「Long-Range Echo」（远距离回声）",
    [5] = "山彦「Amplify Echo」（扩大回声）",
    [6] = "大声「Charged Cry」（激动的呼喊）",
    [7] = "大声「Charged Yahoo」（激动Yahoo）",
    [8] = "山彦「山彦的本领发挥Echo」（山彦的本领发挥回音）",
    ["n"] = 8
}
scZh["幽谷响子"]["天邪鬼"] = {
    [1] = "叫唤「Primal Scream」（原始呐喊）",
    [2] = "劈音「Piercing Circle」（尖刺之圆）",
    [3] = "经文「无限念佛」",
    ["n"] = 3
}

scZh["宫古芳香"] = {}
scZh["宫古芳香"]["神灵庙"] = {
    [1] = "回复「Heal by Desire」（借由欲望的恢复）",
    [2] = "毒爪「Poison Raze」（剧毒抹消）",
    [3] = "毒爪「Poison Murder」（剧毒杀害）",
    [4] = "欲符「赚钱欲灵招来」",
    [5] = "欲灵「Score Desire Eater」（贪分欲吞噬者）",
    [6] = "毒爪「不死杀人鬼」",
    ["n"] = 6
}
scZh["宫古芳香"]["天邪鬼"] = {
    [1] = "毒爪「Zombie Claw」（僵尸之爪）",
    ["n"] = 1
}

scZh["霍青娥"] = {}
scZh["霍青娥"]["神灵庙"] = {
    [1] = "邪符「养小鬼」",
    [2] = "邪符「孤魂野鬼」",
    [3] = "入魔「走火入魔」",
    [4] = "降灵「死人童乩」",
    [5] = "通灵「通灵芳香」",
    [6] = "道符「道胎动」",
    [7] = "道符「TAO胎动　～道～」",
    ["n"] = 7
}
scZh["霍青娥"]["天邪鬼"] = {
    [1] = "入魔「过剩走火入魔」",
    [2] = "仙术「Wall Runner」（墙壁移动者）",
    [3] = "仙术「穿墙虫洞」",
    ["n"] = 3
}

scZh["苏我屠自古"] = {}
scZh["苏我屠自古"]["神灵庙"] = {
    [1] = "雷矢「Gagouji Cyclone」（元兴寺的旋风）",
    [2] = "雷矢「Gagouji Tornado」（元兴寺的龙卷）",
    [3] = "怨灵「入鹿之雷」",
    ["n"] = 3
}

scZh["物部布都"] = {}
scZh["物部布都"]["神灵庙"] = {
    [1] = "天符「雨之磐舟」",
    [2] = "天符「天之磐舟哟，向天飞升吧」",
    [3] = "投皿「物部氏的八十平瓮」",
    [4] = "炎符「废佛之炎风」",
    [5] = "炎符「火烧樱井寺」",
    [6] = "圣童女「大物忌正餐」",
    [7] = "圣童女「太阳神的贡品」",
    ["n"] = 7
}
scZh["物部布都"]["心绮楼"] = {
    [1] = "风符「三轮的皿风暴」",
    [2] = "炎符「太乙真火」",
    [3] = "运气「破局的开门」",
    [4] = "「大火改新」",
    [5] = "皿投「土器回转投」",
    [6] = "弓符「星龙弓」",
    ["n"] = 6
}
scZh["物部布都"]["天邪鬼"] = {
    [1] = "古舟「Ancient Ship」（古老之船）",
    [2] = "热龙「火焰龙脉」",
    ["n"] = 2
}
scZh["物部布都"]["深秘录"] = {
    [1] = "风符「三轮的皿风暴」",
    [2] = "炎符「太乙真火」",
    [3] = "运气「破局的开门」",
    [4] = "＊到死还是少一盘！＊",
    [5] = "皿符「自暴自弃的阿菊」",
    [6] = "＊从晦暗的古井底＊",
    ["n"] = 6
}
scZh["物部布都"]["凭依华"] = {
    [1] = "风符「三轮的皿风暴」",
    [2] = "炎符「太乙真火」",
    [3] = "运气「破局的开门」",
    [4] = "＊到死还是少一盘！＊",
    [5] = "拳风符「入道丛云风水拳」",
    [6] = "风灵符「磐舟土器封印」",
    [7] = "面风符「喜怒哀乐风水术」",
    [8] = "光风符「光辉风水披风」",
    ["n"] = 8
}

scZh["丰聪耳神子"] = {}
scZh["丰聪耳神子"]["神灵庙"] = {
    [1] = "名誉「十二阶之色彩」",
    [2] = "名誉「十二阶之冠位」",
    [3] = "仙符「日出之处的道士」",
    [4] = "仙符「日出之处的天子」",
    [5] = "召唤「豪族乱舞」",
    [6] = "秘宝「斑鸠寺的天球仪」",
    [7] = "秘宝「圣德太子的OOPARTS」（圣德太子的欧帕兹）",
    [8] = "光符「救世观音的佛光」",
    [9] = "光符「Guse Flash」（救世之光）",
    [10] = "眼光「十七条的Laser」（十七条的光芒）",
    [11] = "神光「无忤为宗」",
    [12] = "「星辰降落的神灵庙」",
    [13] = "「新生的神灵」",
    [14] = "「神灵大宇宙」",
    ["n"] = 14
}
scZh["丰聪耳神子"]["心绮楼"] = {
    [1] = "仙符「日出之处的道士」",
    [2] = "道符「掌上的天道」",
    [3] = "人符「劝善惩恶古之良典」",
    [4] = "「承诏必慎」",
    [5] = "德符「圣德的Prestige」（圣德的威望）",
    [6] = "光符「无限条Laser」（无限条光芒）",
    ["n"] = 6
}
scZh["丰聪耳神子"]["天邪鬼"] = {
    [1] = "「吾乃天道也」",
    [2] = "「十七条宪法炸弹」",
    ["n"] = 2
}
scZh["丰聪耳神子"]["深秘录"] = {
    [1] = "仙符「日出之处的道士」",
    [2] = "道符「掌上的天道」",
    [3] = "人符「劝善惩恶古之良典」",
    [4] = "＊特别让你两边都选！＊",
    [5] = "怪人「Hermetic Manteau」",
    [6] = "＊大怪人的动脉与静脉＊",
    [7] = "＊世纪的怪人红披风蓝披风＊",
    [8] = "怪人「Bloody Manto」（血色披风）",
    [9] = "怪人「被诅咒的红蓝披风」",
    [10] = "「死生有命　～按自己的意愿做出最渴望的选择吧」",
    ["n"] = 10
}
scZh["丰聪耳神子"]["凭依华"] = {
    [1] = "仙符「日出之处的道士」",
    [2] = "道符「掌上的天道」",
    [3] = "人符「劝善惩恶古之良典」",
    [4] = "＊特别让你两边都选！＊",
    [5] = "光击符「引导着你的王道的金刚杵射击」",
    [6] = "击光符「韦驮天的王道威光」",
    [7] = "蹴斩符「迦楼罗的圣德斩」",
    [8] = "光仙符「日出之国的僧侣和道士」",
    [9] = "光风符「光辉风水披风」",
    [10] = "光符「引导着你的梦王道的威光」",
    ["n"] = 10
}
scZh["丰聪耳神子"]["噩梦日记"] = {
    [1] = "星神符「十七条的超人」",
    [2] = "红神符「十七条大灾变」",
    [3] = "神红符「血腥十七条的光芒」",
    ["n"] = 3
}

scZh["二岩猯藏"] = {}
scZh["二岩猯藏"]["神灵庙"] = {
    [1] = "一回胜负「灵长类弹幕变化」",
    [2] = "二回胜负「肉食类弹幕变化」",
    [3] = "三回胜负「羽鸟类弹幕变化」",
    [4] = "四回胜负「两栖类弹幕变化」",
    [5] = "五回胜负「鸟兽戏画」",
    [6] = "六回胜负「狸猫的变身学校」",
    [7] = "七回胜负「野生的离岛」",
    [8] = "变化「魔奴化巫女的伪退治」",
    [9] = "「猯藏化弹幕十变化」",
    [10] = "貉符「满月下的腹鼓舞」",
    [11] = "「Wild Carpet」（野生地毯）",
    ["n"] = 11
}
scZh["二岩猯藏"]["心绮楼"] = {
    [1] = "变化「分福热水浴」",
    [2] = "变化「百鬼妖界之门」",
    [3] = "变化「二岩家的制裁」",
    [4] = "「八百八狸囃子」",
    [5] = "变化「满月的花鸟园」",
    [6] = "变化「鸟兽戏画」",
    [7] = "变化「百鬼妖界之门」",
    [8] = "「游戏到此为止了」",
    [9] = "「弁天的琵琶法师」",
    [10] = "「神社的佛祖大人」",
    ["n"] = 10
}
scZh["二岩猯藏"]["天邪鬼"] = {
    [1] = "「杜鹃不啼则待之泣」",
    [2] = "「人类真好啊」",
    ["n"] = 2
}
scZh["二岩猯藏"]["深秘录"] = {
    [1] = "变化「分福热水浴」",
    [2] = "变化「百鬼妖界之门」",
    [3] = "变化「二岩家的制裁」",
    [4] = "＊宇宙机密泄露！即刻处置＊",
    [5] = "未确认「幽浮戏画」",
    [6] = "＊满员的外星人球＊",
    [7] = "＊差不多该回家了外星人们啊＊",
    ["n"] = 7
}
scZh["二岩猯藏"]["凭依华"] = {
    [1] = "变化「分福热水浴」",
    [2] = "变化「百鬼妖界之门」",
    [3] = "变化「二岩家的制裁」",
    [4] = "＊宇宙机密泄露！即刻处置＊",
    [5] = "化火符「妖怪弹幕变化 叶叶烨烨」",
    [6] = "槌化符「大判小判弹幕变化」",
    [7] = "雷化符「务光与叶叶的弹幕变化」",
    [8] = "龙化符「Dragon's Alien Capsule」（巨龙外星人胶囊）",
    [9] = "化符「妖怪弹幕变化 梦见心地」",
    ["n"] = 9
}
scZh["二岩猯藏"]["噩梦日记"] = {
    [1] = "神星符「正体不明的怪光人潮」",
    [2] = "辉神符「谜之咚咚人潮」",
    [3] = "神绯符「雷雨中的跟踪狂」",
    ["n"] = 3
}

scZh["秦心"] = {}
scZh["秦心"]["心绮楼"] = {
    [1] = "怒面「愤怒的忌狼之面」",
    [2] = "凭依「喜怒哀乐Possession」（喜怒哀乐附体）",
    [3] = "忧面「杞人忧地」",
    [4] = "「假面丧心舞 暗黑能乐」",
    [5] = "忧符「忧世之苦不绝如轮」",
    [6] = "喜符「昂扬的神乐狮子」",
    [7] = "怒符「愤怒的忌狼之面」",
    [8] = "「Monkey Possession」（猿猴凭依）",
    ["n"] = 8
}
scZh["秦心"]["深秘录"] = {
    [1] = "怒面「愤怒的忌狼之面」",
    [2] = "凭依「喜怒哀乐附体」",
    [3] = "忧面「杞人忧地」",
    [4] = "＊就算这样我也漂亮吧？＊",
    [5] = "＊裂口的感情＊",
    ["n"] = 5
}
scZh["秦心"]["凭依华"] = {
    [1] = "怒面「愤怒的忌狼之面」",
    [2] = "凭依「喜怒哀乐附体」",
    [3] = "忧面「杞人忧地」",
    [4] = "＊就算这样我也漂亮吧？＊",
    [5] = "水面符「水泡弹假面舞会」",
    [6] = "面风符「喜怒哀乐风水术」",
    [7] = "面符「喜怒哀乐发狂假面舞会」",
    ["n"] = 7
}

scZh["若鹭姬"] = {}
scZh["若鹭姬"]["辉针城"] = {
    [1] = "水符「Tail Fin Slap」（尾鳍拍击）",
    [2] = "鳞符「Scale Wave」（鳞之波）",
    [3] = "鳞符「逆鳞的惊涛」",
    [4] = "鳞符「逆鳞的大惊涛」",
    ["n"] = 4
}
scZh["若鹭姬"]["天邪鬼"] = {
    [1] = "水符「Lunatic Red Slap」（红月拍击）",
    [2] = "潮符「湖中的潮汐波」",
    [3] = "鱼符「School of Fish」（鱼群）",
    ["n"] = 3
}

scZh["赤蛮奇"] = {}
scZh["赤蛮奇"]["辉针城"] = {
    [1] = "飞符「Flying Head」（飞行之头）",
    [2] = "首符「Close-Eye Shot」（闭目射击）",
    [3] = "首符「辘轳首飞来」",
    [4] = "飞头「Multiplicative Head」（倍增之头）",
    [5] = "飞头「Seventh Head」（第七个头）",
    [6] = "飞头「Ninth Head」（第九个头）",
    [7] = "飞头「Dullahan Night」（杜拉罕之夜）",
    ["n"] = 7
}
scZh["赤蛮奇"]["天邪鬼"] = {
    [1] = "飞首「Extreme Long Neck」（极长的脖子）",
    [2] = "眼光「Hell's Ray」（地狱之光）",
    [3] = "飞首「Twin Rokuro Head」（二重轱辘首）",
    ["n"] = 3
}

scZh["今泉影狼"] = {}
scZh["今泉影狼"]["辉针城"] = {
    [1] = "牙符「月下的犬齿」",
    [2] = "变身「Triangle Fang」（三角齿）",
    [3] = "变身「Star Fang」（星形齿）",
    [4] = "咆哮「Strange Roar」（陌生的咆哮）",
    [5] = "咆哮「満月的远吠」",
    [6] = "狼符「Star Ring Pounce」（星环猛扑）",
    [7] = "天狼「High-Speed Pounce」（高速猛扑）",
    ["n"] = 7
}
scZh["今泉影狼"]["天邪鬼"] = {
    [1] = "满月「Full Moon Roar」（满月咆哮）",
    [2] = "狼牙「渴望鲜血的狼牙」",
    ["n"] = 2
}

scZh["九十九姐妹"] = {}
scZh["九十九姐妹"]["辉针城"] = {
    [1] = "弦乐「风暴的Ensemble」（风暴的合奏）",
    [2] = "弦乐「净琉璃世界」",
    ["n"] = 2
}

scZh["九十九弁弁"] = {}
scZh["九十九弁弁"]["辉针城"] = {
    [1] = "平曲「祗园精舍的钟声」",
    [2] = "怨灵「无耳芳一」",
    [3] = "怨灵「平家的大怨灵」",
    [4] = "乐符「邪恶的五线谱」",
    [5] = "乐符「凶恶的五线谱」",
    [6] = "乐符「Double Score」（双重乐谱）",
    ["n"] = 6
}
scZh["九十九弁弁"]["天邪鬼"] = {
    [1] = "音符「大热唱琵琶」",
    [2] = "乐谱「Score Web」（乐谱之网）",
    [3] = "两吟「星辰降落之歌」",
    ["n"] = 3
}

scZh["九十九八桥"] = {}
scZh["九十九八桥"]["辉针城"] = {
    [1] = "琴符「诸行无常的琴声」",
    [2] = "响符「平安的残响」",
    [3] = "响符「Echo Chamber」（回音之庭）",
    [4] = "筝曲「下克上送筝曲」",
    [5] = "筝曲「下克上Requiem」（下克上安魂曲）",
    ["n"] = 5
}
scZh["九十九八桥"]["天邪鬼"] = {
    [1] = "琴符「天之诏琴」",
    [2] = "哀歌「人琴俱亡」",
    [3] = "两吟「星辰降落之歌」",
    ["n"] = 3
}

scZh["鬼人正邪"] = {}
scZh["鬼人正邪"]["辉针城"] = {
    [1] = "欺符「逆针击」",
    [2] = "逆符「镜之国的弹幕」",
    [3] = "逆符「Evil in the Mirror」（镜中的邪恶）",
    [4] = "逆符「天地有用」",
    [5] = "逆符「天下翻覆」",
    [6] = "逆弓「天壤梦弓」",
    [7] = "逆弓「天壤梦弓的诏敕」",
    [8] = "逆转「Reverse Hierarchy」（阶级反转）",
    [9] = "逆转「Change Air Brave」（变革空勇士）",
    ["n"] = 9
}

scZh["少名针妙丸"] = {}
scZh["少名针妙丸"]["辉针城"] = {
    [1] = "小弹「小人的道路」",
    [2] = "小弹「小人的荆棘路」",
    [3] = "小槌「变大吧」",
    [4] = "小槌「变得更大吧」",
    [5] = "妖剑「辉针剑」",
    [6] = "小槌「你给我变大吧」",
    [7] = "「进击的小人」",
    [8] = "「Wall of Issun」（一寸之壁）",
    [9] = "「Hop-o'-My-Thumb Seven」（七个小人）",
    [10] = "「七个一寸法师」",
    ["n"] = 10
}
scZh["少名针妙丸"]["天邪鬼"] = {
    [1] = "「小人的地狱」",
    [2] = "辉针「杀鬼刺双目之针」",
    ["n"] = 2
}
scZh["少名针妙丸"]["深秘录"] = {
    [1] = "小槌「传说中的大宴席」",
    [2] = "小人「一寸法师亦有五分之魂」",
    [3] = "钓符「可爱的太公望」",
    [4] = "＊绿巨人啊，变大吧！＊",
    [5] = "大渔「空中大回转钓鱼法」",
    [6] = "＊幻之国不来夫斯库＊",
    ["n"] = 6
}
scZh["少名针妙丸"]["凭依华"] = {
    [1] = "小槌「传说中的大宴席」",
    [2] = "小人「一寸法师亦有五分之魂」",
    [3] = "钓符「可爱的太公望」",
    [4] = "＊绿巨人啊，变大吧！＊",
    [5] = "槌化符「大判小判弹幕变化」",
    [6] = "升槌符「载着我们的梦变大吧」",
    [7] = "坠槌符「梦坠入大气圈变大吧」",
    [8] = "「全小人族的绯想天」",
    [9] = "狂槌符「狂视幻象（Disorder Eye）也变大吧」（混乱之眼）",
    [10] = "槌恋符「大判小判叮叮当心」",
    [11] = "槌砾符「大判小判叮叮当念力」",
    ["n"] = 11
}
scZh["少名针妙丸"]["噩梦日记"] = {
    [1] = "绯针符「要石也给我变大吧」",
    [2] = "辉夜符「蓬莱的巨大弹枝」",
    [3] = "妖风符「土著蝶风暴」",
    ["n"] = 3
}

scZh["堀川雷鼓"] = {}
scZh["堀川雷鼓"]["辉针城"] = {
    [1] = "一鼓「暴乱宫太鼓」",
    [2] = "二鼓「怨灵绫鼓」",
    [3] = "三鼓「午夜零时的Three strikes」（午夜零时的三振）",
    [4] = "死鼓「Land Percuss」（轻敲大地）",
    [5] = "五鼓「雷电拨浪鼓」",
    [6] = "六鼓「Alternate Sticking」（交替打击法）",
    [7] = "七鼓「高速和太鼓Rocket」（高速和太鼓火箭）",
    [8] = "八鼓「雷神之怒」",
    [9] = "「Blue Lady Show」（蓝色佳人的演出）",
    [10] = "「Pristine beat」（原初的节拍）",
    ["n"] = 10
}
scZh["堀川雷鼓"]["天邪鬼"] = {
    [1] = "雷符「愤怒的雷电拨浪鼓」",
    [2] = "太鼓「Fantastic Woofer」（梦幻低音炮）",
    ["n"] = 2
}
scZh["堀川雷鼓"]["噩梦日记"] = {
    [1] = "辉天符「迅雷的咚咚太鼓」",
    [2] = "辉神符「谜之咚咚人潮」",
    [3] = "辉星符「正体不明的咚咚太鼓」",
    ["n"] = 3
}

scZh["茨木华扇"] = {}
scZh["茨木华扇"]["深秘录"] = {
    [1] = "包符「假肢变形」",
    [2] = "龙符「Dragon's Growl」（龙啸）",
    [3] = "鹰符「Hawk Beacon」（雄鹰信标）",
    [4] = "＊猿之手啊！捏碎敌人！＊",
    [5] = "雷符「低速的务光」",
    [6] = "虎符「两门的彭祖」",
    [7] = "＊到死都会实现愿望的猴爪＊",
    [8] = "＊猿之手会做一个神秘的梦＊",
    ["n"] = 8
}
scZh["茨木华扇"]["凭依华"] = {
    [1] = "包符「假肢变形」",
    [2] = "龙符「Dragon's Growl」（龙啸）",
    [3] = "鹰符「Hawk Beacon」（雄鹰信标）",
    [4] = "＊猿之手啊！捏碎敌人！＊",
    [5] = "灵鹰符「飞鹰的梦想封印狩猎」",
    [6] = "雷灵符「务光的雷弹梦想封印」",
    [7] = "龙蹴符「巨龙飞鸟井之踢」",
    [8] = "雷化符「务光与叶叶的弹幕变化」",
    [9] = "龙化符「Dragon's Alien Capsule」（巨龙外星人胶囊）",
    [10] = "雷符「务光的雷霆闪光梦幻弹」",
    [11] = "龙符「Dragon's Optical Dream」（巨龙光学迷梦）",
    ["n"] = 11
}

scZh["宇佐见堇子"] = {}
scZh["宇佐见堇子"]["深秘录"] = {
    [1] = "枪符「3D Printer Gun」（3D打印枪）",
    [2] = "念力「Psychokinesis APP」",
    [3] = "念力「Telekinesis 电波塔」",
    [4] = "＊幻视吧！目睹异世界的狂气＊",
    [5] = "念力「Psycho Plosion」（精神爆发）",
    [6] = "念力「Telekinesis 非法投掷物」",
    [7] = "＊现世的神秘主义者＊",
    [8] = "＊深秘的七大不可思议＊",
    ["n"] = 8
}
scZh["宇佐见堇子"]["凭依华"] = {
    [1] = "枪符「3D Printer Gun」（3D打印枪）",
    [2] = "念力「Psychokinesis APP」",
    [3] = "念力「Telekinesis 电波塔」",
    [4] = "＊幻视吧！目睹异世界的狂气＊",
    [5] = "超能力「Psychokinesis Endless」（念力无限）",
    [6] = "梦砾符「羊毛色的念力」",
    [7] = "W超能力「Phychokinesis Teleportation」（念力传动）",
    [8] = "W超能力「绝体绝命都市人」",
    [9] = "「世纪的二重超人 宇佐见堇子」",
    [10] = "槌砾符「大判小判叮叮当念力」",
    ["n"] = 10
}
scZh["宇佐见堇子"]["噩梦日记"] = {
    [1] = "纸符「ESP卡手里剑」",
    [2] = "纸符「结界中的ESP卡手里剑」",
    ["n"] = 2
}

scZh["清兰"] = {}
scZh["清兰"]["绀珠传"] = {
    [1] = "凶弹「Speed Strike」（高速撞击）",
    [2] = "弹符「Eagle Shooting」（射鹰）",
    [3] = "弹符「鹰已击中」",
    [4] = "铳符「Lunatic Gun」（月狂之枪）",
    ["n"] = 4
}
scZh["清兰"]["噩梦日记"] = {
    [1] = "弹符「Eagle Shooting」",
    [2] = "弹符「Rabbit Falconer」",
    [3] = "梦弹「Lunatic Dream Shoot」",
    ["n"] = 3
}

scZh["铃瑚"] = {}
scZh["铃瑚"]["绀珠传"] = {
    [1] = "兔符「Strawberry Dango」（草莓团子）",
    [2] = "兔符「Berry Berry Dango」（浆果浆果团子）",
    [3] = "兔符「Dango Influence」（团子影响力）",
    [4] = "月见「September Fullmoon」（九月的满月）",
    [5] = "月见酒「Lunatic September」（月狂的九月）",
    ["n"] = 5
}
scZh["铃瑚"]["噩梦日记"] = {
    [1] = "兔符「草莓大团子」",
    [2] = "兔符「团子三姐妹」",
    [3] = "团子「Dango Flower」",
    ["n"] = 3
}

scZh["哆来咪"] = {}
scZh["哆来咪"]["绀珠传"] = {
    [1] = "梦符「绯红色的噩梦」",
    [2] = "梦符「绯红色的压迫噩梦」",
    [3] = "梦符「蔚蓝色的愁梦」",
    [4] = "梦符「蔚蓝色的愁三重梦」",
    [5] = "梦符「愁永远之梦」",
    [6] = "梦符「刈安色的迷梦」",
    [7] = "梦符「刈安色的错综迷梦」",
    [8] = "梦符「Dream Catcher」（捕梦网）",
    [9] = "梦符「苍蓝色的Dream Catcher」（苍蓝色的捕梦网）",
    [10] = "梦符「梦我梦中」",
    [11] = "月符「绀色的狂梦」",
    [12] = "蝴蝶「Butterfly Supplantation」（取而代之的蝴蝶）",
    [13] = "超特急「Dream Express」（梦幻快车）",
    [14] = "爬梦「Creeping Bullet」（爬行的子弹）",
    ["n"] = 14
}
scZh["哆来咪"]["凭依华"] = {
    [1] = "梦符「留绀色的逃走梦」",
    [2] = "梦符「漆黑的宇宙梦」",
    [3] = "羊符「Nightmare of Chimera」（奇美拉的恶梦）",
    [4] = "＊不再醒来比较好哦＊",
    [5] = "超能力「Psychokinesis Endless」（念力无限）",
    [6] = "梦砾符「羊毛色的念力」",
    [7] = "灵符「梦想封印 梦限」",
    [8] = "星符「Asteroid Belt Nightmare」（小行星带恶梦）",
    [9] = "梦要符「羊毛色的乾坤一掷」",
    [10] = "面符「喜怒哀乐发狂假面舞会」",
    [11] = "化符「妖怪弹幕变化 梦见心地」",
    [12] = "光符「引导着你的梦王道的威光」",
    [13] = "击符「被韦驮天追逐的正梦」",
    [14] = "雷符「务光的雷霆闪光梦幻弹」",
    [15] = "龙符「Dragon's Optical Dream」（巨龙光学迷梦）",
    [16] = "升符「飞向遥远的宇宙吧！ 载着我们的梦想」",
    [17] = "坠符「落入大气圈，梦想倾泻地表」",
    [18] = "「把大地重塑成，有梦的世界吧！」",
    ["n"] = 18
}
scZh["哆来咪"]["噩梦日记"] = {
    [1] = "「在最后的周日所做的噩梦」",
    ["n"] = 1
}

scZh["稀神探女"] = {}
scZh["稀神探女"]["绀珠传"] = {
    [1] = "玉符「乌合之咒」",
    [2] = "玉符「乌合的逆咒」",
    [3] = "玉符「乌合的二重咒」",
    [4] = "玉符「秽身探知型水雷」",
    [5] = "玉符「秽身探知型水雷　改」",
    [6] = "玉符「众神的弹冠」",
    [7] = "玉符「众神的光辉弹冠」",
    [8] = "「孤翼的白鹭」",
    ["n"] = 8
}
scZh["稀神探女"]["噩梦日记"] = {
    [1] = "玉符「铜墙铁壁的阴阳玉」",
    [2] = "玉符「众神的难摄之弹冠」",
    [3] = "梦鹭「孤翼的梦鹭」",
    ["n"] = 3
}

scZh["克劳恩皮丝"] = {}
scZh["克劳恩皮丝"]["绀珠传"] = {
    [1] = "狱符「Hell Eclipse」（地狱月食）",
    [2] = "狱符「地狱之蚀」",
    [3] = "狱符「Flash and Stripe」（闪光与条纹）",
    [4] = "狱符「Star and Stripe」（星与条纹）",
    [5] = "狱炎「Graze Inferno」（擦弹地狱火）",
    [6] = "狱炎「擦弹的狱意」",
    [7] = "地狱「Striped Abyss」（条纹状的深渊）",
    [8] = "「Fake Apollo」（伪阿波罗）",
    [9] = "「Apollo捏造说」（阿波罗捏造说）",
    ["n"] = 9
}
scZh["克劳恩皮丝"]["噩梦日记"] = {
    [1] = "狱符「Brusting Grudge」",
    [2] = "狱符「Double Stripe」",
    [3] = "月梦「Eclipse Nightmare」",
    ["n"] = 3
}

scZh["纯狐"] = {}
scZh["纯狐"]["绀珠传"] = {
    [1] = "「掌上的纯光」",
    [2] = "「杀意的百合」",
    [3] = "「原始的神灵界」",
    [4] = "「现代的神灵界」",
    [5] = "「战栗的寒冷之星」",
    [6] = "「纯粹的狂气」",
    [7] = "「溢出的瑕秽」",
    [8] = "「地上秽的纯化」",
    [9] = "纯符「Purely Bullet Hell」（单纯的子弹地狱）",
    [10] = "纯符「纯粹的弹幕地狱」",
    [11] = "「用于逼死瓮中鼠的单纯弹幕」",
    [12] = "「用于杀人的纯粹弹幕」",
    [13] = "「最初与最后的无名弹幕」",
    ["n"] = 13
}
scZh["纯狐"]["噩梦日记"] = {
    [1] = "「震颤的冰封噩梦」",
    [2] = "「Psychedelic Mandara」",
    [3] = "「极具威严的纯光」",
    [4] = "「噩梦中的切实杀人用弹幕」",
    [5] = "绀珠符「纯粹与不纯的弹幕」",
    [6] = "萃珠符「纯粹的五里雾中」",
    [7] = "永珠符「无秽之珠与多秽之灵」",
    ["n"] = 7
}

scZh["赫卡提亚"] = {}
scZh["赫卡提亚"]["绀珠传"] = {
    [1] = "异界「逢魔之刻」",
    [2] = "地球「邪秽在身」",
    [3] = "月「Apollo反射镜」（阿波罗反射镜）",
    [4] = "异界「地狱的Non-ideal弹幕」（地狱的非理想弹幕）",
    [5] = "地球「落向地狱的雨」",
    [6] = "月「Lunatic Impact」（月狂冲击）",
    [7] = "「Trinitarian Rhapsody」（三位一体论狂想曲）",
    [8] = "「最初与最后的无名弹幕」",
    ["n"] = 8
}
scZh["赫卡提亚"]["噩梦日记"] = {
    [1] = "异界「Distorted Fire」",
    [2] = "异界「充满怨恨的地狱之雨」",
    [3] = "月「Cosmic Radiation」",
    [4] = "异界「逢魔之刻 梦」",
    [5] = "「月亮掉下来啦！」",
    [6] = "绀珠符「纯粹与不纯的弹幕」",
    [7] = "永珠符「舍身之反射」",
    [8] = "萃珠符「Mist Ray」",
    ["n"] = 8
}

scZh["依神女苑"] = {}
scZh["依神女苑"]["凭依华"] = {
    [1] = "凭依剥夺「Slave Robber」（下仆掠夺者）",
    [2] = "贫符「超贫穷玉」",
    [3] = "「Queen of Bubble」（泡沫女王）",
    [4] = "「80年代的勒索者」",
    [5] = "不幸「欢迎来到极端贫困的世界」",
    [6] = "财祸「Pluck Pigeon」（雁过拔毛）",
    [7] = "凭依交换「Absolute Loser」（绝对输家）",
    [8] = "「最强最棒的异变解决巫女」",
    ["n"] = 8
}

scZh["依神紫苑"] = {}
scZh["依神紫苑"]["凭依华"] = {
    [1] = "不幸「欢迎来到极端贫困的世界」",
    [2] = "财祸「Pluck Pigeon」（雁过拔毛）",
    [3] = "凭依交换「Absolute Loser」（绝对输家）",
    [4] = "贫符「Mischance Scatter」（厄运播撒）",
    [5] = "「最凶最恶的极贫不幸神」",
    ["n"] = 5
}

scZh["爱塔"] = {}
scZh["爱塔"]["天空璋"] = {
    [1] = "蝶符「Minute Scales」（细碎鳞粉）",
    [2] = "蝶符「凤蝶的鳞粉」",
    [3] = "蝶符「Fluttering Summer」（扑翅之夏）",
    [4] = "蝶符「盛夏振翅」",
    ["n"] = 4
}
scZh["爱塔"]["噩梦日记"] = {
    [1] = "蝶符「Butterfly Dream」",
    [2] = "蝶符「沾身难下的鳞粉」",
    [3] = "梦蝶「Crazy Butterfly」",
    ["n"] = 3
}

scZh["坂田合欢乃"] = {}
scZh["坂田合欢乃"]["天空璋"] = {
    [1] = "雨符「被囚禁的秋雨」",
    [2] = "雨符「被诅咒的暴雨」",
    [3] = "刃符「山姥的菜刀研磨」",
    [4] = "刃符「山姥的鬼菜刀研磨」",
    [5] = "尽符「Mountain Murder」（深山谋杀）",
    [6] = "尽符「Bloody Mountain Murder」（血腥的深山谋杀）",
    ["n"] = 6
}
scZh["坂田合欢乃"]["噩梦日记"] = {
    [1] = "研符「疯狂闪耀的鬼菜刀」",
    [2] = "杀符「穷僻的山姥」",
    [3] = "梦尽「杀人鬼之怀」",
    ["n"] = 3
}

scZh["高丽野阿吽"] = {}
scZh["高丽野阿吽"]["天空璋"] = {
    [1] = "犬符「野犬的散步」",
    [2] = "狗符「山狗的散步」",
    [3] = "独乐「狛犬旋转」",
    [4] = "独乐「Curl Up and Die」（蜷缩而死）",
    [5] = "狛符「单人式阿吽的呼吸」",
    ["n"] = 5
}
scZh["高丽野阿吽"]["噩梦日记"] = {
    [1] = "陀螺「狛犬大回转」",
    [2] = "陀螺「阿吽的闪光」",
    [3] = "梦犬「101野犬」",
    ["n"] = 3
}

scZh["矢田寺成美"] = {}
scZh["矢田寺成美"]["天空璋"] = {
    [1] = "魔符「Instant Bodhi」（顷刻菩提）",
    [2] = "魔符「即席菩提」",
    [3] = "魔符「Bullet Golem」（弹丸魔像）",
    [4] = "魔符「作宠物的巨大弹生命体」",
    [5] = "地藏「Criminal Salvation」（罪业救赎）",
    [6] = "地藏「业火救济」",
    ["n"] = 6
}
scZh["矢田寺成美"]["噩梦日记"] = {
    [1] = "魔符「慈爱的地藏」",
    [2] = "地藏「菩萨践踏」",
    [3] = "地藏「生机勃勃的弹幕魔像」",
    [4] = "梦地藏「劫火的希望」",
    ["n"] = 4
}

scZh["尔子田里乃"] = {}
scZh["尔子田里乃"]["天空璋"] = {
    [1] = "茗荷「Forget Your Name」（忘却你的名字）",
    [2] = "冥加「Behind You」（在你背后）",
    [3] = "舞符「Behind Festival」（背后之祭）",
    [4] = "狂舞「天狗怖吓」",
    [5] = "狂舞「狂乱天狗怖吓」",
    [6] = "鼓舞「Powerful Cheers」（强力助威）",
    [7] = "狂舞「Crazy Back Dance」（疯狂的背景舞）",
    [8] = "弹舞「双目台风」",
    ["n"] = 8
}
scZh["尔子田里乃"]["噩梦日记"] = {
    [1] = "茗荷「Mesmerism Dance」",
    [2] = "冥加「Behind Nightmare」",
    ["n"] = 2
}

scZh["丁礼田舞"] = {}
scZh["丁礼田舞"]["天空璋"] = {
    [1] = "竹符「Bamboo Spear Dance」（竹矛之舞）",
    [2] = "竹符「Bamboo Crazy Dance」（竹之狂舞）",
    [3] = "笹符「Tanabata Star Festival」（七夕星祭）",
    [4] = "舞符「Behind Festival」（背后之祭）",
    [5] = "狂舞「天狗怖吓」",
    [6] = "狂舞「狂乱天狗怖吓」",
    [7] = "鼓舞「Powerful Cheers」（强力助威）",
    [8] = "狂舞「Crazy Back Dance」（疯狂的背景舞）",
    [9] = "弹舞「双目台风」",
    ["n"] = 9
}
scZh["丁礼田舞"]["噩梦日记"] = {
    [1] = "竹符「Bamboo Labyrinth」",
    [2] = "笹符「Tanabata Star Dream」",
    ["n"] = 2
}

scZh["摩多罗隐岐奈"] = {}
scZh["摩多罗隐岐奈"]["天空璋"] = {
    [1] = "后符「秘神的后光」",
    [2] = "后符「绝对秘神的后光」",
    [3] = "里夏「Scorch by Hot Summer」（暑夏炙烤）",
    [4] = "里夏「异常酷暑之焦土」",
    [5] = "里秋「Die of Famine」（死于饥荒）",
    [6] = "里秋「异常枯死之饿鬼」",
    [7] = "里冬「Black Snowman」（黑色雪人）",
    [8] = "里冬「异常降雪之雪人」",
    [9] = "里春「April Wizard」（四月巫师）",
    [10] = "里春「异常落花之魔术使」",
    [11] = "「里·Breezy Cherry Blossom」（里·吹拂樱花）",
    [12] = "「里·Perfect Summer Ice」（里·完美夏冰）",
    [13] = "「里·Crazy Fall Wind」（里·疯狂秋风）",
    [14] = "「里·Extreme Winter」（里·极端寒冬）",
    [15] = "秘仪「Reverse Invoker」（逆向呼神者）",
    [16] = "秘仪「背叛的后方射击」",
    [17] = "秘仪「弹幕的玉茧」",
    [18] = "秘仪「秽那之火」",
    [19] = "秘仪「后户的狂言」",
    [20] = "秘仪「Matarah Dukkha」（摩多罗苦谛）",
    [21] = "秘仪「七星之剑」",
    [22] = "秘仪「无纽带的艺人」",
    [23] = "「背面的暗黑猿乐」",
    [24] = "「Anarchy Bullet Hell」（无秩序弹幕地狱）",
    ["n"] = 24
}
scZh["摩多罗隐岐奈"]["噩梦日记"] = {
    [1] = "秘仪「Matara Sukha」",
    [2] = "秘仪「背面的邪炎」",
    [3] = "后符「绝对秘神的后光」",
    [4] = "秘仪「秘神的暗跃弹幕」",
    [5] = "秘仪「神秘的玉茧」",
    [6] = "「秘神结界」",
    [7] = "「来自背后的偷拍者降服」",
    [8] = "「卑鄙者极限火花」",
    ["n"] = 8
}

scZh["绵月依姬"] = {}
scZh["绵月依姬"]["儚月抄"] = {
    [1] = "「火雷神」",
    [2] = "「金山彦命」",
    [3] = "「天津瓮星」",
    [4] = "「石凝姥命」",
    [5] = "「天宇受卖命」",
    [6] = "「天照大御神」",
    [7] = "「伊豆能卖」",
    ["n"] = 7
}

return scZh