--称号
local titleZh = {}

titleZh["博丽灵梦(旧作)"] = {
    ["梦时空1"] = "维护梦与传统的巫女",
    ["梦时空2"] = "巫女小姐",
    ["幻想乡1"] = "维护梦与传统的巫女",
    ["幻想乡2"] = "维护梦与传统的巫女",
    ["幻想乡3"] = "巫女小姐",
    ["怪绮谈1"] = "巫女小姐",
    ["怪绮谈2"] = "Shaman"
}

titleZh["神玉"] = {
    ["灵异传"] = "Gatekeeper"
}

titleZh["魅魔"] = {
    ["灵异传"] = "Revengeful Ghost",
    ["梦时空1"] = "将命运托付给久远的梦的精神",
    ["梦时空2"] = "将命运托付给久远的梦的精神",
    ["梦时空3"] = "恶灵小姐",
    ["怪绮谈1"] = "恶灵小姐",
    ["怪绮谈2"] = "恶灵",
    ["怪绮谈3"] = "Ghost"
}

titleZh["菊理"] = {
    ["灵异传"] = "Hellish Moon"
}

titleZh["矜羯罗"] = {
    ["灵异传"] = "Astral Knight"
}

titleZh["幽幻魔眼"] = {
    ["灵异传"] = "EvilEyes"
}

titleZh["依莉斯"] = {
    ["灵异传"] = "Innocence Devil"
}

titleZh["萨丽爱尔"] = {
    ["灵异传"] = "Angel of Death"
}

titleZh["玄爷"] = {
    ["封魔录"] = "龟"
}

titleZh["里香"] = {
    ["封魔录"] = "Engineer"
}

titleZh["明罗"] = {
    ["封魔录"] = "Samurai"
}

titleZh["雾雨魔理沙(旧作)"] = {
    ["梦时空1"] = "从魔法与红梦化成的存在",
    ["梦时空2"] = "从魔法与红梦化成的存在",
    ["梦时空3"] = "魔法使小姐",
    ["幻想乡1"] = "从魔法与红梦化成的存在",
    ["幻想乡2"] = "从魔法与红梦化成的存在",
    ["幻想乡3"] = "魔法使小姐",
    ["怪绮谈1"] = "魔法使小姐",
    ["怪绮谈2"] = "Sorceress"
}

titleZh["爱莲"] = {
    ["梦时空1"] = "在工作的人身上梦见恋爱的魔女",
    ["梦时空2"] = "魔女",
    ["怪绮谈"] = "Witch"
}

titleZh["小兔姬"] = {
    ["梦时空1"] = "在弹幕中梦见美的公主",
    ["梦时空2"] = "公主殿下？",
    ["怪绮谈"] = "Princess"
}

titleZh["卡娜"] = {
    ["梦时空1"] = "失去梦的少女骚灵",
    ["梦时空2"] = "骚灵",
    ["怪绮谈"] = "Poltergeist"
}

titleZh["朝仓理香子"] = {
    ["梦时空1"] = "寻找梦想的科学",
    ["梦时空2"] = "科学信者",
    ["怪绮谈"] = "Scientist"
}

titleZh["北白河千百合"] = {
    ["梦时空"] = "超越时空的梦幻居民",
    ["怪绮谈"] = "Assistant professor"
}

titleZh["冈崎梦美"] = {
    ["梦时空"] = "梦幻传说",
    ["怪绮谈"] = "Professor"
}

titleZh["奥莲姬"] = {
    ["幻想乡"] = "妖怪",
    ["怪绮谈"] = "Oriental demon"
}

titleZh["胡桃"] = {
    ["幻想乡"] = "吸血少女",
    ["怪绮谈"] = "Vampire"
}

titleZh["艾丽"] = {
    ["幻想乡"] = "馆的门卫",
    ["怪绮谈"] = "门卫"
}

titleZh["幽香"] = {
    ["怪绮谈1"] = "妖怪",
    ["怪绮谈2"] = "妖怪小姐",
    ["怪绮谈"] = "Oriental Demon"
}

titleZh["梦月"] = {
    ["怪绮谈"] = "Maid"
}

titleZh["幻月"] = {
    ["怪绮谈"] = "Demon"
}

titleZh["萨拉"] = {
    ["怪绮谈1"] = "门之看守",
    ["怪绮谈2"] = "魔界的门卫",
    ["怪绮谈3"] = "Gate keeper"
}

titleZh["露易兹"] = {
    ["怪绮谈1"] = "魔界人",
    ["怪绮谈2"] = "Demon"
}

titleZh["爱丽丝(旧作)"] = {
    ["怪绮谈1"] = "死之少女",
    ["怪绮谈2"] = "魔法之国的爱丽丝",
    ["怪绮谈3"] = "死之少女",
    ["怪绮谈4"] = "魔法之国的爱丽丝",
    ["怪绮谈5"] = "Witch of Death"
}

titleZh["雪"] = {
    ["怪绮谈1"] = "魔法使",
    ["怪绮谈2"] = "Black witch"
}

titleZh["舞"] = {
    ["怪绮谈1"] = "魔法使",
    ["怪绮谈2"] = "White witch"
}

titleZh["梦子"] = {
    ["怪绮谈1"] = "魔界女仆",
    ["怪绮谈2"] = "Maid"
}

titleZh["神绮"] = {
    ["怪绮谈1"] = "魔界之神",
    ["怪绮谈2"] = "Goddess of devil's world"
}

titleZh["博丽灵梦"] = {
    ["红魔乡"] = "博丽神社的巫女小姐",
    ["红魔乡omake"] = "永远之巫女",
    ["妖妖梦"] = "乐园的可爱巫女",
    ["萃梦想"] = "乐园的可爱巫女",
    ["永夜抄"] = "乐园的可爱巫女",
    ["花映塚"] = "乐园的可爱巫女",
    ["风神录"] = "乐园的巫女",
    ["绯想天"] = "乐园的可爱巫女",
    ["绯想天story"] = "快晴的巫女",
    ["地灵殿"] = "乐园的巫女",
    ["星莲船"] = "乐园的巫女",
    ["非想天则"] = "乐园的巫女",
    ["文花帖DS"] = "飞翔于天空的不可思议的巫女",
    ["神灵庙"] = "五欲的巫女",
    ["神灵庙setting"] = "乐园的巫女",
    ["心绮楼"] = "八百万神的代言人",
    ["辉针城"] = "飞翔于天空的不可思议的巫女",
    ["辉针城omake"] = "乐园的巫女",
    ["深秘录"] = "神秘！结界的巫女",
    ["深秘录story"] = "追逐怪奇！终结异变的巫女",
    ["绀珠传"] = "飞翔于天空的不可思议的巫女",
    ["绀珠传omake"] = "乐园的巫女",
    ["凭依华"] = "自由奔放且毫无计划的巫女",
    ["天空璋"] = "春阳下无忧无虑的巫女",
    ["求闻史纪"] = "乐园的巫女",
    ["儚月抄(小说)"] = "乐园的可爱巫女",
    ["儚月抄(漫画)1"] = "乐园的可爱巫女",
    ["儚月抄(漫画)2"] = "巫女",
    ["三月精E"] = "博丽神社巫女",
    ["三月精V"] = "飞翔于天空的不可思议的巫女",
    ["茨歌仙1"] = "自由奔放的人类",
    ["茨歌仙2"] = "乐园的巫女",
    ["铃奈庵"] = "乐园的可爱萨满（Shaman）"
}

titleZh["雾雨魔理沙"] = {
    ["红魔乡"] = "东洋的西洋魔术师",
    ["红魔乡omake"] = "奇妙的魔法使",
    ["妖妖梦"] = "普通的黑魔术少女",
    ["妖妖梦setting"] = "普通的黑魔术师",
    ["妖妖梦manual"] = "普通的魔法使",
    ["萃梦想"] = "普通的魔法使",
    ["永夜抄"] = "普通的黑魔术少女",
    ["永夜抄setting"] = "普通的黑魔术师",
    ["永夜抄manual"] = "普通的魔法使",
    ["花映塚"] = "普通的魔法使",
    ["风神录"] = "普通的魔法使",
    ["绯想天"] = "普通的魔法使",
    ["绯想天story"] = "雾雨的魔法使",
    ["地灵殿"] = "普通的魔法使",
    ["星莲船"] = "普通的魔法使",
    ["非想天则"] = "普通的魔法使",
    ["文花帖DS"] = "普通的魔法使小姐",
    ["大战争"] = "路过的魔法使",
    ["神灵庙"] = "强欲的魔法使",
    ["神灵庙setting"] = "普通的魔法使",
    ["心绮楼"] = "代表人类的魔法使",
    ["辉针城"] = "普通的魔法使",
    ["辉针城ex"] = "像个人类的魔法使",
    ["深秘录"] = "恐怖！学校的魔法使",
    ["绀珠传"] = "普通的魔法使",
    ["凭依华"] = "火力高强且喜欢星星的魔法使",
    ["天空璋"] = "极寒中颤抖的魔法使",
    ["求闻史纪"] = "普通的魔法使",
    ["儚月抄(漫画)"] = "普通的黑魔术师",
    ["三月精E"] = "魔法使",
    ["三月精V"] = "普通的魔法使",
    ["茨歌仙1"] = "大胆小心的人类",
    ["茨歌仙2"] = "普通的魔法使",
    ["铃奈庵1"] = "极其普通的魔法师（Magician）",
    ["铃奈庵2"] = "普通的魔法使"
}

titleZh["露米娅"] = {
    ["红魔乡"] = "宵暗的妖怪",
    ["文花帖"] = "潜伏在宵暗中的妖怪",
    ["求闻史纪"] = "宵暗的妖怪"
}

titleZh["琪露诺"] = {
    ["红魔乡"] = "湖上的冰精",
    ["妖妖梦"] = "冰之妖怪",
    ["花映塚"] = "冰之小妖精",
    ["文花帖"] = "不自然的冷气",
    ["非想天则"] = "冰之妖精",
    ["辉针城"] = "湖的冰精",
    ["天空璋"] = "烈日下不融的冰精",
    ["求闻史纪"] = "冰之妖精",
    ["三月精V"] = "冰之小妖精"
}

titleZh["红美铃"] = {
    ["红魔乡"] = "华人小姑娘",
    ["萃梦想"] = "华人小姑娘",
    ["文花帖"] = "色彩艳丽的门卫",
    ["非想天则"] = "华人小姑娘",
    ["求闻史纪"] = "华人小姑娘",
    ["儚月抄(四格)"] = "红魔馆门卫·华人小姑娘",
    ["三月精S"] = "华人小姑娘"
}

titleZh["帕秋莉"] = {
    ["红魔乡"] = "知识与避世的少女",
    ["萃梦想"] = "不动的大图书馆",
    ["文花帖"] = "不明的魔法之元",
    ["绯想天"] = "不动的大图书馆",
    ["绯想天story"] = "花昙的魔女",
    ["地灵殿"] = "不动的大图书馆",
    ["非想天则"] = "不动的大图书馆",
    ["求闻史纪"] = "不动的大图书馆",
    ["儚月抄(漫画)"] = "不动的大图书馆",
    ["三月精S"] = "知识与避世的少女",
    ["三月精O"] = "知识与避世的少女"
}

titleZh["十六夜咲夜"] = {
    ["红魔乡"] = "红魔馆的女仆",
    ["妖妖梦"] = "红魔馆的女仆",
    ["萃梦想"] = "完美潇洒的从者",
    ["萃梦想text"] = "红魔馆的女仆",
    ["永夜抄"] = "红魔馆的女仆",
    ["花映塚"] = "完全潇洒的女仆",
    ["文花帖"] = "危险的戏法家",
    ["绯想天"] = "完美潇洒的从者",
    ["绯想天story"] = "小夜岚的女仆",
    ["非想天则"] = "完美潇洒的从者",
    ["辉针城"] = "红色恶魔的女仆",
    ["辉针城manual"] = "红色恶魔的女仆",
    ["求闻史纪"] = "红魔馆的女仆",
    ["儚月抄(漫画)"] = "红魔馆的女仆",
    ["儚月抄(四格)"] = "红魔馆的女仆",
    ["茨歌仙"] = "电光石火的女仆",
    ["铃奈庵"] = "吸血鬼的女仆（Maid）"
}

titleZh["蕾米莉亚"] = {
    ["红魔乡"] = "永远幼小的红月",
    ["萃梦想"] = "永远幼小的红月",
    ["永夜抄"] = "红色恶魔",
    ["文花帖"] = "红色的世界",
    ["绯想天"] = "永远幼小的红月",
    ["绯想天story"] = "浓雾的吸血鬼",
    ["非想天则"] = "永远幼小的红月",
    ["求闻史纪"] = "红色恶魔",
    ["儚月抄(漫画)"] = "红色恶魔",
    ["铃奈庵"] = "深红的夜行性恶魔（NocturnalDevil）"
}

titleZh["芙兰朵露"] = {
    ["红魔乡"] = "恶魔之妹",
    ["文花帖"] = "可怕的波动",
    ["求闻史纪"] = "恶魔之妹"
}

titleZh["雷蒂"] = {
    ["妖妖梦"] = "冬天的遗忘之物",
    ["文花帖"] = "局部性的大寒潮",
    ["求闻史纪"] = "冬之妖怪"
}

titleZh["橙"] = {
    ["妖妖梦"] = "凶兆的黑猫",
    ["妖妖梦ex"] = "隙间妖怪的式神的式神",
    ["文花帖"] = "用眼也捕捉不到的妖怪猫",
    ["求闻史纪"] = "凶兆的黑猫"
}

titleZh["爱丽丝"] = {
    ["妖妖梦"] = "七色的人偶师",
    ["萃梦想"] = "七色的人偶使",
    ["永夜抄"] = "七色的人偶使",
    ["文花帖"] = "光凭外表是十分爽朗的妖怪",
    ["绯想天"] = "七色的人偶使",
    ["绯想天story"] = "雹之人偶使",
    ["地灵殿"] = "七色的人偶使",
    ["非想天则"] = "七色的人偶使",
    ["求闻史纪"] = "七色的人偶使",
    ["三月精S"] = "七色的人偶使"
}

titleZh["莉莉"] = {
    ["妖妖梦"] = "运送春天的妖精",
    ["求闻史纪"] = "运送春天的妖精"
}

titleZh["露娜萨"] = {
    ["妖妖梦"] = "骚灵提琴手",
    ["花映塚"] = "骚灵提琴手",
    ["求闻史纪"] = "骚灵提琴手"
}

titleZh["梅露兰"] = {
    ["妖妖梦"] = "骚灵小号手",
    ["花映塚"] = "骚灵小号手",
    ["求闻史纪"] = "骚灵小号手"
}

titleZh["莉莉卡"] = {
    ["妖妖梦"] = "骚灵键盘手",
    ["花映塚"] = "骚灵键盘手",
    ["求闻史纪"] = "骚灵键盘手"
}

titleZh["魂魄妖梦"] = {
    ["妖妖梦"] = "半分虚幻的庭师",
    ["妖妖梦setting"] = "幽人的庭师",
    ["萃梦想"] = "半分虚幻的庭师",
    ["萃梦想text"] = "生命的二刀流",
    ["永夜抄"] = "半人半灵",
    ["花映塚"] = "半人半灵的半吊子",
    ["文花帖"] = "切舍御免",
    ["绯想天"] = "半分虚幻的庭师",
    ["绯想天story"] = "苍天的庭师",
    ["非想天则"] = "半分虚幻的庭师",
    ["神灵庙"] = "死欲的半灵",
    ["神灵庙setting"] = "半人半灵的庭师",
    ["求闻史纪"] = "半人半灵的庭师",
    ["儚月抄(漫画)"] = "半人半灵",
    ["三月精V"] = "半人半灵的庭师"
}

titleZh["西行寺幽幽子"] = {
    ["妖妖梦"] = "幽冥楼阁的亡灵少女",
    ["萃梦想"] = "天衣无缝的亡灵",
    ["永夜抄"] = "华胥的亡灵",
    ["文花帖"] = "幽雅的心灵照片",
    ["绯想天"] = "天衣无缝的亡灵",
    ["绯想天story"] = "雪的亡灵",
    ["非想天则"] = "天衣无缝的亡灵",
    ["神灵庙1"] = "心无彷徨的亡灵",
    ["神灵庙2"] = "从不困惑的亡灵",
    ["求闻史纪"] = "华胥的亡灵",
    ["儚月抄(漫画)"] = "华胥的亡灵",
    ["三月精V"] = "华胥的亡灵"
}

titleZh["八云蓝"] = {
    ["妖妖梦"] = "隙间妖怪的式神",
    ["文花帖"] = "稀有的动物",
    ["求闻史纪"] = "策士的九尾",
    ["儚月抄(漫画)"] = "隙间妖怪的式神"
}

titleZh["八云紫"] = {
    ["妖妖梦"] = "神隐的主犯",
    ["萃梦想"] = "幻想的境界",
    ["永夜抄"] = "境界的妖怪",
    ["永夜抄setting"] = "潜藏于境界内的妖怪",
    ["文花帖"] = "令人不快的微笑",
    ["绯想天"] = "幻想的境界",
    ["绯想天story"] = "幻想的狐嫁雨",
    ["地灵殿"] = "境界的妖怪",
    ["非想天则"] = "幻想的境界",
    ["凭依华"] = "神出鬼没且表里两面的妖怪",
    ["求闻史纪"] = "境界的妖怪",
    ["香霖堂"] = "境界的妖怪",
    ["儚月抄(漫画)"] = "潜藏于境界内的妖怪",
    ["三月精S"] = "境界的妖怪",
    ["茨歌仙"] = "神出鬼没的妖怪",
    ["铃奈庵"] = "幻想乡的守门人（Gate Keeper）"
}

titleZh["伊吹萃香"] = {
    ["萃梦想"] = "萃集梦想、虚幻、以及百鬼夜行",
    ["文花帖"] = "太古的时代",
    ["绯想天"] = "小小的百鬼夜行",
    ["绯想天story"] = "细雨的百鬼夜行",
    ["地灵殿"] = "小小的百鬼夜行",
    ["文花帖DS"] = "不羁奔放的古豪",
    ["非想天则"] = "小小的百鬼夜行",
    ["求闻史纪"] = "小小的百鬼夜行",
    ["三月精S"] = "小小的百鬼夜行",
    ["茨歌仙"] = "不羁奔放的鬼"
}

titleZh["莉格露"] = {
    ["永夜抄"] = "暗中蠢动的光虫",
    ["文花帖"] = "发光的虫群",
    ["求闻史纪"] = "暗中蠢动的光虫"
}

titleZh["米斯蒂娅"] = {
    ["永夜抄"] = "夜雀妖怪",
    ["花映塚"] = "夜雀妖怪",
    ["求闻史纪"] = "夜雀妖怪",
    ["三月精O"] = "歌唱的夜雀"
}

titleZh["上白泽慧音"] = {
    ["永夜抄"] = "知识与历史的半兽",
    ["永夜抄setting"] = "吞食历史",
    ["文花帖"] = "一本正经的历史家",
    ["求闻史纪"] = "吞食历史的半兽"
}

titleZh["因幡帝"] = {
    ["永夜抄"] = "地上兔",
    ["花映塚"] = "幸运的白兔",
    ["文花帖"] = "蹦跳的兔群",
    ["求闻史纪"] = "幸运的白兔",
    ["儚月抄(小说)"] = "地上兔",
    ["儚月抄(漫画)"] = "地上兔",
    ["茨歌仙"] = "巧言令色的白兔"
}

titleZh["铃仙"] = {
    ["永夜抄"] = "狂气的月兔",
    ["花映塚"] = "狂气的月兔",
    ["文花帖"] = "令视界摇晃的妖怪兔",
    ["绯想天"] = "狂气的赤瞳",
    ["绯想天story"] = "晴岚的赤眼",
    ["非想天则"] = "狂气的赤瞳",
    ["深秘录"] = "禁视！狂气的扭扭兔",
    ["绀珠传"] = "地上的月兔",
    ["凭依华"] = "因月面思维而波长不合的妖怪兔",
    ["求闻史纪"] = "狂气的赤眼",
    ["儚月抄(小说)"] = "狂气的月兔",
    ["儚月抄(漫画)"] = "狂气的月兔",
    ["三月精S"] = "狂气的月兔",
    ["铃奈庵"] = "地上的月兔（MoonRabbit）"
}

titleZh["八意永琳"] = {
    ["永夜抄"] = "月之头脑",
    ["文花帖"] = "街中的药贩",
    ["求闻史纪"] = "蓬莱的药贩",
    ["儚月抄(小说)"] = "月之头脑",
    ["儚月抄(漫画)"] = "月之头脑",
    ["三月精S"] = "月之头脑",
    ["三月精V"] = "月之头脑"
}

titleZh["蓬莱山辉夜"] = {
    ["永夜抄"] = "永远和须臾的罪人",
    ["文花帖"] = "不像人类的公主殿下",
    ["求闻史纪"] = "永远的公主",
    ["儚月抄(小说)"] = "永远和须臾的罪人",
    ["儚月抄(漫画)"] = "永远和须臾的罪人"
}

titleZh["藤原妹红"] = {
    ["永夜抄"] = "蓬莱的人之形",
    ["文花帖"] = "烧不死的人类",
    ["深秘录"] = "激热！人类地狱火",
    ["凭依华"] = "自暴自弃且不死之身的人类",
    ["求闻史纪"] = "红之自警队",
    ["茨歌仙"] = "不老不死的竹林引路人"
}

titleZh["射命丸文"] = {
    ["花映塚"] = "传统的幻想书屋",
    ["文花帖"] = "传统的幻想书屋",
    ["风神录"] = "最接近村落的天狗",
    ["绯想天"] = "传统的幻想书屋",
    ["绯想天story"] = "风雨之鸦",
    ["地灵殿"] = "传统的幻想书屋",
    ["文花帖DS"] = "捏造新闻记者",
    ["非想天则"] = "传统的幻想书屋",
    ["天空璋"] = "飞散红叶的天狗",
    ["文花帖(书籍)"] = "传统的幻想书屋",
    ["求闻史纪"] = "传统的幻想书屋",
    ["儚月抄(漫画)"] = "传统的幻想书屋",
    ["三月精S"] = "传统的幻想书屋",
    ["茨歌仙"] = "穿凿附会的天狗",
    ["铃奈庵"] = "鸦天狗新闻工作者（Journalist）"
}

titleZh["梅蒂馨"] = {
    ["花映塚"] = "小小的甜蜜毒药",
    ["文花帖"] = "不会对身体温婉的人偶",
    ["求闻史纪"] = "小小的甜蜜毒药"
}

titleZh["风见幽香"] = {
    ["花映塚"] = "四季的鲜花之主",
    ["求闻史纪"] = "四季的鲜花之主"
}

titleZh["小野塚小町"] = {
    ["花映塚"] = "三途河的引航人",
    ["文花帖"] = "江户子气质的死神",
    ["绯想天"] = "三途河的引航人",
    ["绯想天story"] = "川雾的引航人",
    ["非想天则"] = "三途河的引航人",
    ["求闻史纪"] = "三途河的引航人",
    ["三月精S"] = "三途河的引航人",
    ["三月精V"] = "三途河的引航人",
    ["茨歌仙1"] = "落魄失意的死神",
    ["茨歌仙2"] = "三途河的引航人"
}

titleZh["四季映姬"] = {
    ["花映塚"] = "乐园的最高裁判长",
    ["文花帖"] = "<del>唠叨</del>敬畏的话语",
    ["求闻史纪"] = "地狱的最高裁判长",
    ["三月精V"] = "地狱的最高裁判长"
}

titleZh["秋静叶"] = {
    ["风神录"] = "寂寞与终焉的象征",
    ["文花帖DS"] = "令人感伤的红雨",
    ["求闻口授"] = "寂寞与终焉的象征"
}

titleZh["秋穰子"] = {
    ["风神录"] = "丰裕与收成的象征",
    ["文花帖DS"] = "飘有甜味的神明",
    ["求闻口授"] = "丰裕与收成的象征"
}

titleZh["键山雏"] = {
    ["风神录"] = "秘神流雏",
    ["文花帖DS"] = "转嫁游戏大师",
    ["求闻口授"] = "秘神流雏"
}

titleZh["河城荷取"] = {
    ["风神录"] = "超妖怪弹头",
    ["地灵殿"] = "超妖怪弹头",
    ["文花帖DS"] = "水中的技师",
    ["心绮楼"] = "河中的便利屋",
    ["深秘录"] = "太古！三叠纪的河童",
    ["凭依华"] = "擅长买卖且守财如命的河童",
    ["求闻口授"] = "超妖怪弹头",
    ["三月精V"] = "水中的技师",
    ["茨歌仙"] = "水平思考的河童",
    ["铃奈庵"] = "水中的工程师（Engineer）"
}

titleZh["犬走椛"] = {
    ["风神录"] = "下端哨戒天狗",
    ["文花帖DS"] = "山中的千里眼"
}

titleZh["东风谷早苗"] = {
    ["风神录"] = "祭祀风的人类",
    ["星莲船"] = "山上的新人神明",
    ["非想天则"] = "祭祀风的人类",
    ["文花帖DS"] = "现代人的现人神",
    ["神灵庙"] = "我欲的巫女",
    ["神灵庙"] = "山上的新人神明",
    ["绀珠传"] = "住在山里的奇迹的现人神",
    ["求闻口授"] = "祭祀风的人类",
    ["茨歌仙"] = "孤陋浅薄的人类",
    ["铃奈庵"] = "风与湖的通神者（Theurgist）"
}

titleZh["八坂神奈子"] = {
    ["风神录"] = "山坂与湖水的化身",
    ["文花帖DS"] = "喜欢坂道的神明",
    ["求闻口授"] = "山坂与湖水的化身",
    ["茨歌仙"] = "屹立不挠的神明"
}

titleZh["洩矢诹访子"] = {
    ["风神录"] = "土著神的顶点",
    ["非想天则"] = "土著神的顶点",
    ["文花帖DS"] = "两栖类的神明",
    ["求闻口授"] = "土著神的顶点",
    ["茨歌仙"] = "名存实亡的神明"
}

titleZh["永江衣玖"] = {
    ["绯想天"] = "美丽的绯之衣",
    ["非想天则"] = "美丽的绯之衣",
    ["文花帖DS"] = "飞天的稀有道具"
}

titleZh["比那名居天子"] = {
    ["绯想天"] = "非想非非想天之女",
    ["非想天则"] = "非想非非想天之女",
    ["文花帖DS"] = "有顶天的大小姐",
    ["凭依华"] = "绯想一般远离浮世的天人",
    ["茨歌仙"] = "暖衣饱食的天人"
}

titleZh["琪斯美"] = {
    ["地灵殿"] = "可怕的水井妖怪",
    ["文花帖DS"] = "秋日的食人妖"
}

titleZh["黑谷山女"] = {
    ["地灵殿"] = "昏暗洞窟中明亮的网",
    ["文花帖DS"] = "悄悄逼近的恐怖之气",
    ["求闻口授"] = "昏暗洞窟中明亮的网"
}

titleZh["水桥"] = {
    ["地灵殿"] = "地壳下的嫉妒心",
    ["文花帖DS"] = "绿色眼睛的怪物",
    ["求闻口授"] = "地壳下的嫉妒心"
}

titleZh["星熊勇仪"] = {
    ["地灵殿"] = "人所谈论的怪力乱神",
    ["文花帖DS"] = "破灭的金刚力",
    ["求闻口授"] = "人所谈论的怪力乱神"
}

titleZh["古明地觉"] = {
    ["地灵殿"] = "怨灵也为之惧怯的少女",
    ["文花帖DS"] = "大家的心病",
    ["求闻口授"] = "怨灵也为之惧怯的少女",
    ["茨歌仙"] = "孤影悄然的妖怪"
}

titleZh["火焰猫燐"] = {
    ["地灵殿"] = "地狱的轮祸",
    ["文花帖DS"] = "尸体观光售票员",
    ["求闻口授"] = "地狱的轮祸",
    ["茨歌仙"] = "背信弃义的死猫"
}

titleZh["灵乌路空"] = {
    ["地灵殿"] = "难以驾驭的神之火",
    ["非想天则"] = "难以驾驭的神之火",
    ["文花帖DS"] = "地底的太阳",
    ["求闻口授"] = "难以驾驭的神之火"
}

titleZh["古明地恋"] = {
    ["地灵殿"] = "紧闭的恋之瞳",
    ["文花帖DS"] = "什么都没在想的人",
    ["心绮楼"] = "空想上的人格保持者",
    ["深秘录"] = "本怖！就在你的身后",
    ["凭依华"] = "并非有意却闭锁内心的觉",
    ["求闻口授"] = "紧闭的恋之瞳"
}

titleZh["纳兹琳"] = {
    ["星莲船"] = "探宝的小小大将",
    ["文花帖DS"] = "随处可见的探宝者",
    ["求闻口授"] = "探宝的小小大将"
}

titleZh["多多良小伞"] = {
    ["星莲船"] = "愉快的遗忘之伞",
    ["文花帖DS"] = "可怜的非法投弃物",
    ["神灵庙"] = "为难的遗忘之物",
    ["求闻口授"] = "愉快的遗忘之伞",
    ["茨歌仙"] = "惊天动地的唐伞妖怪"
}

titleZh["云山"] = {
    ["星莲船"] = "守护与被守护的大轮",
    ["文花帖DS"] = "于大空绽放的花与老爹",
    ["心绮楼"] = "压倒性的妖怪行者",
    ["深秘录"] = "惊愕！高个的入道使",
    ["求闻口授"] = "守护与被守护的大轮",
    ["茨歌仙"] = "大山鸣动的大入道"
}

titleZh["云居一轮"] = {
    ["星莲船"] = "守护与被守护的大轮",
    ["文花帖DS"] = "于大空绽放的花与老爹",
    ["心绮楼"] = "压倒性的妖怪行者",
    ["深秘录"] = "惊愕！高个的入道使",
    ["凭依华"] = "顽固且巨身怪力的入道使",
    ["求闻口授"] = "守护与被守护的大轮",
    ["茨歌仙"] = "一莲托生的妖怪僧侣"
}

titleZh["村纱水蜜"] = {
    ["星莲船"] = "水难事故的念缚灵",
    ["文花帖DS"] = "凄惨的汪洋大海",
    ["求闻口授"] = "水难事故的念缚灵"
}

titleZh["寅丸星"] = {
    ["星莲船"] = "毘沙门天的弟子",
    ["文花帖DS"] = "升格的妖兽",
    ["求闻口授"] = "毘沙门天的弟子"
}

titleZh["圣白莲"] = {
    ["星莲船"] = "被封印的大魔法师",
    ["文花帖DS"] = "勇往直前僧侣",
    ["心绮楼"] = "超越了灵长类的阿阇梨",
    ["深秘录"] = "极速！骑手僧侣",
    ["凭依华"] = "超人且开悟的大阿阇梨",
    ["求闻口授"] = "妖怪寺的魔住持",
    ["茨歌仙"] = "念佛三昧的大阿阇梨",
    ["铃奈庵"] = "妖怪寺的住持僧（Master Priest）"
}

titleZh["封兽鵺"] = {
    ["星莲船"] = "未确认幻想飞行少女",
    ["文花帖DS"] = "有时像虎有时似鸟的家伙",
    ["神灵庙"] = "古代妖怪之一",
    ["求闻口授"] = "真相不明的真相",
    ["铃奈庵"] = "真相不明的未知Ｘ（Unknown X）"
}

titleZh["姬海棠果"] = {
    ["文花帖DS1"] = "当代的念写记者",
    ["文花帖DS2"] = "未经世故的妨碍记者"
}

titleZh["幽谷响子"] = {
    ["神灵庙"] = "诵经的山彦",
    ["求闻口授"] = "诵经的山彦",
    ["茨歌仙"] = "平凡陈腐的山彦"
}

titleZh["宫古芳香"] = {
    ["神灵庙"] = "忠诚的尸体",
    ["求闻口授"] = "忠诚的尸体"
}

titleZh["霍青娥"] = {
    ["神灵庙"] = "穿墙的邪仙",
    ["求闻口授"] = "穿墙的邪仙",
    ["茨歌仙"] = "无理非道的仙人"
}

titleZh["苏我屠自古"] = {
    ["神灵庙"] = "神明后裔的亡灵",
    ["求闻口授"] = "神明后裔的亡灵"
}

titleZh["物部布都"] = {
    ["神灵庙"] = "古代日本的尸解仙",
    ["心绮楼"] = "司掌龙脉的风水师",
    ["深秘录"] = "番町！摔碟的尸解仙",
    ["凭依华"] = "因风水而摔碟的尸解仙",
    ["求闻口授"] = "古代日本的尸解仙"
}

titleZh["丰聪耳神子"] = {
    ["神灵庙"] = "圣德道士",
    ["心绮楼"] = "司掌宇宙的全能道士",
    ["深秘录"] = "怪奇！二色披风魔人",
    ["凭依华"] = "全能且为人而谋的道士",
    ["求闻口授"] = "圣德道士",
    ["茨歌仙"] = "天资英迈的仙人"
}

titleZh["二岩猯藏"] = {
    ["神灵庙"] = "狸猫怪 十变化",
    ["心绮楼"] = "总是提供惊讶的妖怪狸",
    ["深秘录"] = "侵略吧！宇宙妖怪狸",
    ["凭依华"] = "变幻自在且老奸巨猾的妖怪狸",
    ["求闻口授"] = "佐渡之二岩",
    ["茨歌仙"] = "绝无仅有的外来妖怪",
    ["铃奈庵"] = "谁也抓不住的狸猫伪装者（Disguiser）"
}

titleZh["秦心"] = {
    ["心绮楼"] = "表情丰富的扑克脸",
    ["深秘录"] = "战栗吧！恶梦的能面女",
    ["凭依华"] = "能面脸且感情丰富的面灵气",
    ["铃奈庵"] = "表情丰富的扑克脸（Pokerface）"
}

titleZh["若鹭姬"] = {
    ["辉针城"] = "栖息于淡水的人鱼"
}

titleZh["赤蛮奇"] = {
    ["辉针城"] = "辘轳首的怪奇"
}

titleZh["今泉影狼"] = {
    ["辉针城"] = "竹林的Loup-Garou"
}

titleZh["九十九弁弁"] = {
    ["辉针城"] = "古旧琵琶的付丧神"
}

titleZh["九十九八桥"] = {
    ["辉针城"] = "古旧的琴的付丧神"
}

titleZh["鬼人正邪"] = {
    ["辉针城"] = "逆袭的天邪鬼",
    ["天邪鬼"] = "逆袭的天邪鬼"
}

titleZh["少名针妙丸"] = {
    ["辉针城"] = "小人的后裔",
    ["深秘录"] = "可疑！绿色的小人",
    ["凭依华"] = "童话故事般乘着碗的小人",
    ["铃奈庵"] = "辉光之针的利立浦特（Lilliput）"
}

titleZh["堀川雷鼓"] = {
    ["辉针城"] = "梦幻的打击乐手"
}

titleZh["宇佐见堇子"] = {
    ["深秘录"] = "曝光深秘！秘封俱乐部 初代会长",
    ["凭依华"] = "神秘主义而令人头疼的女学生",
    ["噩梦日记"] = "秘封俱乐部初代会长",
    ["茨歌仙"] = "奢侈文弱的女高中生"
}

titleZh["清兰"] = {
    ["绀珠传"] = "浅葱色的Eagle Rabbit"
}

titleZh["铃瑚"] = {
    ["绀珠传"] = "橘色的Eagle Rabbit"
}

titleZh["哆来咪"] = {
    ["绀珠传"] = "梦之支配者",
    ["凭依华"] = "使人做梦的妖怪"
}

titleZh["稀神探女"] = {
    ["绀珠传"] = "招来口舌之祸的女神"
}

titleZh["克劳恩皮丝"] = {
    ["绀珠传"] = "地狱的妖精",
    ["三月精V"] = "狂气的地狱妖精"
}

titleZh["赫卡提亚"] = {
    ["绀珠传"] = "地狱的女神",
    ["三月精V"] = "地狱的女神"
}

titleZh["依神女苑"] = {
    ["凭依华"] = "最凶最恶的双子之妹"
}

titleZh["依神紫苑"] = {
    ["凭依华"] = "最凶最恶的双子之姐",
    ["茨歌仙"] = "粗衣粝食的贫穷神"
}

titleZh["爱塔"] = {
    ["天空璋"] = "接近神的蝴蝶妖精",
    ["三月精V"] = "仲夏的凤蝶妖精"
}

titleZh["坂田合欢乃"] = {
    ["天空璋"] = "跨越浮世门关的山姥"
}

titleZh["高丽野阿吽"] = {
    ["天空璋"] = "醉心神佛的守护神兽",
    ["茨歌仙"] = "神色自若的狛犬"
}

titleZh["矢田寺成美"] = {
    ["天空璋"] = "垂迹于森林的魔法地藏"
}

titleZh["尔子田里乃"] = {
    ["天空璋"] = "过于危险的背景舞者"
}

titleZh["丁礼田舞"] = {
    ["天空璋"] = "过于危险的背景舞者"
}

titleZh["摩多罗隐岐奈"] = {
    ["天空璋"] = "究极的绝对秘神",
    ["天空璋ex"] = "究极的绝对秘神",
    ["茨歌仙"] = "威风堂堂的神秘"
}

titleZh["森近霖之助"] = {
    ["求闻史纪"] = "香霖堂店主",
    ["儚月抄(漫画)"] = "不动的古道具店",
    ["儚月抄(四格)"] = "小道具店店主",
    ["茨歌仙"] = "知足不辱的旧道具店",
    ["铃奈庵"] = "旧道具店的奇人（Curious Fellow）"
}

titleZh["桑尼"] = {
    ["妖精大战争"] = "闪耀的日之光",
    ["求闻史纪"] = "喜欢恶作剧的日之光",
    ["三月精E"] = "日之光",
    ["三月精S"] = "闪耀的日之光",
    ["三月精V"] = "闪耀的日之光"
}

titleZh["露娜"] = {
    ["妖精大战争"] = "静谧的月之光",
    ["求闻史纪"] = "静谧的月之光",
    ["三月精E"] = "月之光",
    ["三月精S"] = "静谧的月之光",
    ["三月精V"] = "静谧的月之光"
}

titleZh["斯塔"] = {
    ["妖精大战争"] = "倾泻而下的星之光",
    ["求闻史纪"] = "倾泻而下的星之光",
    ["三月精E"] = "星之光",
    ["三月精S"] = "倾泻而下的星之光",
    ["三月精V"] = "倾泻而下的星之光"
}

titleZh["绵月丰姬"] = {
    ["儚月抄"] = "连接海与山的月球公主"
}

titleZh["绵月依姬"] = {
    ["儚月抄"] = "神灵附体的月之公主"
}

titleZh["稗田阿求"] = {
    ["记忆幻想乡"] = "幻想乡的记忆",
    ["铃奈庵"] = "第九代学者（Savant）"
}

titleZh["茨木华扇"] = {
    ["深秘录1"] = "威胁！聆听愿望的仙人",
    ["深秘录2"] = "思之欲之！实现人愿望的仙人",
    ["凭依华"] = "因神仙思想而喜爱动物的仙人",
    ["三月精O"] = "独臂有角的仙人",
    ["茨歌仙"] = "独臂有角的仙人"
}

titleZh["本居小铃"] = {
    ["铃奈庵"] = "识文解意的爱书人（Bibliophilia）"
}

return titleZh