--称号
local titleJp = {}

titleJp["博丽灵梦(旧作)"] = {
    ["梦时空1"] = "夢と伝統を保守する巫女",
    ["梦时空2"] = "巫女さん",
    ["幻想乡1"] = "夢と伝統を保守する巫女",
    ["幻想乡2"] = "夢と伝統を保守する巫女",
    ["幻想乡3"] = "巫女さん",
    ["怪绮谈1"] = "巫女さん",
    ["怪绮谈2"] = "Shaman"
}

titleJp["神玉"] = {
    ["灵异传"] = "Gatekeeper"
}

titleJp["魅魔"] = {
    ["灵异传"] = "Revengeful Ghost",
    ["梦时空1"] = "久遠の夢に運命を任せる精神",
    ["梦时空2"] = "久遠の夢に運命を任せる精神",
    ["梦时空3"] = "悪霊さん",
    ["怪绮谈1"] = "悪霊さん",
    ["怪绮谈2"] = "悪霊",
    ["怪绮谈3"] = "Ghost"
}

titleJp["菊理"] = {
    ["灵异传"] = "Hellish Moon"
}

titleJp["矜羯罗"] = {
    ["灵异传"] = "Astral Knight"
}

titleJp["幽幻魔眼"] = {
    ["灵异传"] = "EvilEyes"
}

titleJp["依莉斯"] = {
    ["灵异传"] = "Innocence Devil"
}

titleJp["萨丽爱尔"] = {
    ["灵异传"] = "Angel of Death"
}

titleJp["玄爷"] = {
    ["封魔录"] = "亀"
}

titleJp["里香"] = {
    ["封魔录"] = "Engineer"
}

titleJp["明罗"] = {
    ["封魔录"] = "Samurai"
}

titleJp["雾雨魔理沙(旧作)"] = {
    ["梦时空1"] = "魔法と紅夢からなる存在",
    ["梦时空2"] = "魔法と紅夢からなる存在",
    ["梦时空3"] = "魔法使いさん",
    ["幻想乡1"] = "魔法と紅夢からなる存在",
    ["幻想乡2"] = "魔法と紅夢からなる存在",
    ["幻想乡3"] = "魔法使いさん",
    ["怪绮谈1"] = "魔法使いさん",
    ["怪绮谈2"] = "Sorceress"
}

titleJp["爱莲"] = {
    ["梦时空1"] = "はたらきもので恋を夢見る魔女",
    ["梦时空2"] = "魔女さん",
    ["怪绮谈"] = "Witch"
}

titleJp["小兔姬"] = {
    ["梦时空1"] = "弾幕に美を夢みる姫",
    ["梦时空2"] = "お姫様？",
    ["怪绮谈"] = "Princess"
}

titleJp["卡娜"] = {
    ["梦时空1"] = "夢を失った少女騒霊",
    ["梦时空2"] = "騒霊さん",
    ["怪绮谈"] = "Poltergeist"
}

titleJp["朝仓理香子"] = {
    ["梦时空1"] = "夢を探す科学",
    ["梦时空2"] = "科学信者さん",
    ["怪绮谈"] = "Scientist"
}

titleJp["北白河千百合"] = {
    ["梦时空"] = "時をかける夢幻の住人",
    ["怪绮谈"] = "Assistant professor"
}

titleJp["冈崎梦美"] = {
    ["梦时空"] = "夢幻伝説",
    ["怪绮谈"] = "Professor"
}

titleJp["奥莲姬"] = {
    ["幻想乡"] = "妖怪",
    ["怪绮谈"] = "Oriental demon"
}

titleJp["胡桃"] = {
    ["幻想乡"] = "吸血少女",
    ["怪绮谈"] = "Vampire"
}

titleJp["艾丽"] = {
    ["幻想乡"] = "館の門番",
    ["怪绮谈"] = "Gate keeper"
}

titleJp["幽香"] = {
    ["怪绮谈1"] = "妖怪",
    ["怪绮谈2"] = "妖怪さん",
    ["怪绮谈"] = "Oriental Demon"
}

titleJp["梦月"] = {
    ["怪绮谈"] = "Maid"
}

titleJp["幻月"] = {
    ["怪绮谈"] = "Demon"
}

titleJp["萨拉"] = {
    ["怪绮谈1"] = "扉の番人",
    ["怪绮谈2"] = "魔界の門番",
    ["怪绮谈3"] = "Gate keeper"
}

titleJp["露易兹"] = {
    ["怪绮谈1"] = "魔界人",
    ["怪绮谈2"] = "Demon"
}

titleJp["爱丽丝(旧作)"] = {
    ["怪绮谈1"] = "死の少女",
    ["怪绮谈2"] = "魔法の国のアリス",
    ["怪绮谈3"] = "死の少女",
    ["怪绮谈4"] = "魔法の国のアリス",
    ["怪绮谈5"] = "Witch of Death"
}

titleJp["雪"] = {
    ["怪绮谈1"] = "魔法使い",
    ["怪绮谈2"] = "Black witch"
}

titleJp["舞"] = {
    ["怪绮谈1"] = "魔法使い",
    ["怪绮谈2"] = "White witch"
}

titleJp["梦子"] = {
    ["怪绮谈"] = "魔界メイド",
    ["怪绮谈"] = "Maid"
}

titleJp["神绮"] = {
    ["怪绮谈1"] = "魔界の神",
    ["怪绮谈2"] = "Goddess of devil's world"
}

titleJp["博丽灵梦"] = {
    ["红魔乡"] = "博麗神社の巫女さん",
    ["红魔乡omake"] = "永遠の巫女",
    ["妖妖梦"] = "楽園の素敵な巫女",
    ["萃梦想"] = "楽園の素敵な巫女",
    ["永夜抄"] = "楽園の素敵な巫女",
    ["花映塚"] = "楽園の素敵な巫女",
    ["风神录"] = "楽園の巫女",
    ["绯想天"] = "楽園の素敵な巫女",
    ["绯想天story"] = "快晴の巫女",
    ["地灵殿"] = "楽園の巫女",
    ["星莲船"] = "楽園の巫女",
    ["非想天则"] = "楽園の巫女",
    ["文花帖DS"] = "空を飛ぶ不思議な巫女",
    ["神灵庙"] = "五欲の巫女",
    ["神灵庙setting"] = "楽園の巫女",
    ["心绮楼"] = "八百万の代弁者",
    ["辉针城"] = "空飛ぶ不思議な巫女",
    ["辉针城omake"] = "楽園の巫女",
    ["深秘录"] = "神秘！結界の巫女",
    ["深秘录story"] = "怪奇を追え!異変を終わらせる巫女",
    ["绀珠传"] = "空飛ぶ不思議な巫女",
    ["绀珠传omake"] = "楽園の巫女",
    ["凭依华"] = "自由奔放で無計画な巫女",
    ["天空璋"] = "春の陽に暢気な巫女",
    ["求闻史纪"] = "楽園の巫女",
    ["儚月抄(小说)"] = "楽園の素敵な巫女",
    ["儚月抄(漫画)1"] = "楽園の素敵な巫女",
    ["儚月抄(漫画)2"] = "巫女",
    ["三月精E"] = "博麗神社巫女",
    ["三月精V"] = "空を飛ぶ不思議な巫女",
    ["茨歌仙1"] = "自由奔放な人間",
    ["茨歌仙2"] = "楽園の巫女",
    ["铃奈庵"] = "楽園の素敵なシャーマン"
}

titleJp["雾雨魔理沙"] = {
    ["红魔乡"] = "東洋の西洋魔術師",
    ["红魔乡omake"] = "奇妙な魔法使い",
    ["妖妖梦"] = "普通の黒魔術少女",
    ["妖妖梦setting"] = "普通の黒魔術師",
    ["妖妖梦manual"] = "普通の魔法使い",
    ["萃梦想"] = "普通の魔法使い",
    ["永夜抄"] = "普通の黒魔術少女",
    ["永夜抄setting"] = "普通の黒魔術師",
    ["永夜抄manual"] = "普通の魔法使い",
    ["花映塚"] = "普通の魔法使い",
    ["风神录"] = "普通の魔法使い",
    ["绯想天"] = "普通の魔法使い",
    ["绯想天story"] = "霧雨の魔法使い",
    ["地灵殿"] = "普通の魔法使い",
    ["星莲船"] = "普通の魔法使い",
    ["非想天则"] = "普通の魔法使い",
    ["文花帖DS"] = "普通の魔法使いさん",
    ["大战争"] = "通りすがりの魔法使い",
    ["神灵庙"] = "強欲の魔法使い",
    ["神灵庙setting"] = "普通の魔法使い",
    ["心绮楼"] = "人間代表の魔法使い",
    ["辉针城"] = "普通の魔法使い",
    ["辉针城ex"] = "人間らしい魔法使い",
    ["深秘录"] = "恐怖！学校の魔法使い",
    ["绀珠传"] = "普通の魔法使い",
    ["凭依华"] = "高火力で星好きな魔法使い",
    ["天空璋"] = "極寒に震える魔法使い",
    ["求闻史纪"] = "普通の魔法使い",
    ["儚月抄(漫画)"] = "普通の黒魔術師",
    ["三月精E"] = "魔法使い",
    ["三月精V"] = "普通の魔法使い",
    ["茨歌仙1"] = "大胆小心な人間",
    ["茨歌仙2"] = "普通の魔法使い",
    ["铃奈庵1"] = "極めて普通のマジシャン",
    ["铃奈庵2"] = "普通の魔法使い"
}

titleJp["露米娅"] = {
    ["红魔乡"] = "宵闇の妖怪",
    ["文花帖"] = "暗闇に潜む妖怪",
    ["求闻史纪"] = "宵闇の妖怪"
}

titleJp["琪露诺"] = {
    ["红魔乡"] = "湖上の氷精",
    ["妖妖梦"] = "氷の妖怪",
    ["花映塚"] = "氷の小さな妖精",
    ["文花帖"] = "不自然な冷気",
    ["非想天则"] = "氷の妖精",
    ["辉针城"] = "湖の氷精",
    ["天空璋"] = "溶けない炎天下の氷精",
    ["求闻史纪"] = "氷の妖精",
    ["三月精V"] = "氷の小さな妖精"
}

titleJp["红美铃"] = {
    ["红魔乡"] = "華人小娘",
    ["萃梦想"] = "華人小娘",
    ["文花帖"] = "色鮮やかに虹色な門番",
    ["非想天则"] = "華人小娘",
    ["求闻史纪"] = "華人小娘",
    ["儚月抄(四格)"] = "红魔馆門番·華人小娘",
    ["三月精S"] = "華人小娘"
}

titleJp["帕秋莉"] = {
    ["红魔乡"] = "知識と日陰の少女",
    ["萃梦想"] = "動かない大図書館",
    ["文花帖"] = "得体の知れない魔法の元",
    ["绯想天"] = "動かない大図書館",
    ["绯想天story"] = "花曇の魔女",
    ["地灵殿"] = "動かない大図書館",
    ["非想天则"] = "動かない大図書館",
    ["求闻史纪"] = "動かない大図書館",
    ["儚月抄(漫画)"] = "動かない大図書館",
    ["三月精S"] = "知識と日陰の少女",
    ["三月精O"] = "知識と日陰の少女"
}

titleJp["十六夜咲夜"] = {
    ["红魔乡"] = "紅魔館のメイド",
    ["妖妖梦"] = "紅魔館のメイド",
    ["萃梦想"] = "完全で瀟洒な従者",
    ["萃梦想text"] = "紅魔館のメイド",
    ["永夜抄"] = "紅魔館のメイド",
    ["花映塚"] = "完全で瀟洒なメイド",
    ["文花帖"] = "危険な手品師",
    ["绯想天"] = "完全で瀟洒な従者",
    ["绯想天story"] = "小夜嵐のメイド",
    ["非想天则"] = "完全で瀟洒な従者",
    ["辉针城"] = "紅い悪魔のメイド",
    ["辉针城manual"] = "紅い悪魔のメイド",
    ["求闻史纪"] = "紅魔館のメイド",
    ["儚月抄(漫画)"] = "紅魔館のメイド",
    ["儚月抄(四格)"] = "紅魔館のメイド",
    ["茨歌仙"] = "電光石火のメイド",
    ["铃奈庵"] = "吸血鬼のメイド"
}

titleJp["蕾米莉亚"] = {
    ["红魔乡"] = "永遠に紅い幼き月",
    ["萃梦想"] = "永遠に赤い幼き月",
    ["永夜抄"] = "紅い悪魔",
    ["文花帖"] = "紅色の世界",
    ["绯想天"] = "永遠に紅い幼き月",
    ["绯想天story"] = "濃霧の吸血鬼",
    ["非想天则"] = "永遠に紅い幼き月",
    ["求闻史纪"] = "紅い悪魔",
    ["儚月抄(漫画)"] = "紅い悪魔",
    ["铃奈庵"] = "紅色のノクターナルデビル"
}

titleJp["芙兰朵露"] = {
    ["红魔乡"] = "悪魔の妹",
    ["文花帖"] = "恐ろしい波動",
    ["求闻史纪"] = "悪魔の妹"
}

titleJp["雷蒂"] = {
    ["妖妖梦"] = "冬の忘れ物",
    ["文花帖"] = "局所的な大寒波",
    ["求闻史纪"] = "冬の妖怪"
}

titleJp["橙"] = {
    ["妖妖梦"] = "凶兆の黒猫",
    ["妖妖梦ex"] = "すきま妖怪の式の式",
    ["文花帖"] = "目にも留まらない化猫",
    ["求闻史纪"] = "凶兆の黒猫"
}

titleJp["爱丽丝"] = {
    ["妖妖梦"] = "七色の人形使い",
    ["萃梦想"] = "七色の人形遣い",
    ["永夜抄"] = "七色の人形遣い",
    ["文花帖"] = "見た目だけ賑やかな妖怪",
    ["绯想天"] = "七色の人形遣い",
    ["绯想天story"] = "雹の人形遣い",
    ["地灵殿"] = "七色の人形遣い",
    ["非想天则"] = "七色の人形遣い",
    ["求闻史纪"] = "七色の人形遣い",
    ["三月精S"] = "七色の人形遣い"
}

titleJp["莉莉"] = {
    ["妖妖梦"] = "春を運ぶ妖精",
    ["求闻史纪"] = "春を運ぶ妖精"
}

titleJp["露娜萨"] = {
    ["妖妖梦"] = "騒霊ヴァイオリニスト",
    ["花映塚"] = "騒霊ヴァイオリニスト",
    ["求闻史纪"] = "騒霊ヴァイオリニスト"
}

titleJp["梅露兰"] = {
    ["妖妖梦"] = "騒霊トランペッター",
    ["花映塚"] = "騒霊トランペッター",
    ["求闻史纪"] = "騒霊トランペッター"
}

titleJp["莉莉卡"] = {
    ["妖妖梦"] = "騒霊キーボーディスト",
    ["花映塚"] = "騒霊キーボーディスト",
    ["求闻史纪"] = "騒霊キーボーディスト"
}

titleJp["魂魄妖梦"] = {
    ["妖妖梦"] = "半分幻の庭師",
    ["妖妖梦setting"] = "幽人の庭師",
    ["萃梦想"] = "半分幻の庭師",
    ["萃梦想text"] = "生命の二刀流",
    ["永夜抄"] = "半人半霊",
    ["花映塚"] = "半人半霊の半人前",
    ["文花帖"] = "切り捨て御免",
    ["绯想天"] = "半分幻の庭師",
    ["绯想天story"] = "蒼天の庭師",
    ["非想天则"] = "半分幻の庭師",
    ["神灵庙"] = "死欲の半霊",
    ["神灵庙setting"] = "半人半霊の庭師",
    ["求闻史纪"] = "半人半霊の庭師",
    ["儚月抄(漫画)"] = "半人半霊",
    ["三月精V"] = "半人半霊の庭師"
}

titleJp["西行寺幽幽子"] = {
    ["妖妖梦"] = "幽冥楼閣の亡霊少女",
    ["萃梦想"] = "天衣無縫の亡霊",
    ["永夜抄"] = "華胥の亡霊",
    ["文花帖"] = "幽雅な心霊写真",
    ["绯想天"] = "天衣無縫の亡霊",
    ["绯想天story"] = "雪の亡霊",
    ["非想天则"] = "天衣無縫の亡霊",
    ["神灵庙1"] = "彷徨わない亡霊",
    ["神灵庙2"] = "戸惑わない亡霊",
    ["求闻史纪"] = "華胥の亡霊",
    ["儚月抄(漫画)"] = "華胥の亡霊",
    ["三月精V"] = "華胥の亡霊"
}

titleJp["八云蓝"] = {
    ["妖妖梦"] = "すきま妖怪の式",
    ["文花帖"] = "珍しい動物",
    ["求闻史纪"] = "策士の九尾",
    ["儚月抄(漫画)"] = "すきま妖怪の式"
}

titleJp["八云紫"] = {
    ["妖妖梦"] = "神隠しの主犯",
    ["萃梦想"] = "幻想の境界",
    ["永夜抄"] = "境界の妖怪",
    ["永夜抄setting"] = "境目に潜む妖怪",
    ["文花帖"] = "気味の悪い微笑み",
    ["绯想天"] = "幻想の境界",
    ["绯想天story"] = "幻想の狐の嫁入り",
    ["地灵殿"] = "境界の妖怪",
    ["非想天则"] = "幻想の境界",
    ["凭依华"] = "神出鬼没で裏表のある妖怪",
    ["求闻史纪"] = "境界の妖怪",
    ["香霖堂"] = "境界の妖怪",
    ["儚月抄(漫画)"] = "境目に潜む妖怪",
    ["三月精S"] = "境界の妖怪",
    ["茨歌仙"] = "神出鬼没の妖怪",
    ["铃奈庵"] = "幻想郷のゲートキーパー"
}

titleJp["伊吹萃香"] = {
    ["萃梦想"] = "萃まる夢、幻、そして百鬼夜行",
    ["文花帖"] = "太古の時代",
    ["绯想天"] = "小さな百鬼夜行",
    ["绯想天story"] = "疎雨の百鬼夜行",
    ["地灵殿"] = "小さな百鬼夜行",
    ["文花帖DS"] = "不羁奔放の古豪",
    ["非想天则"] = "小さな百鬼夜行",
    ["求闻史纪"] = "小さな百鬼夜行",
    ["三月精S"] = "小さな百鬼夜行",
    ["茨歌仙"] = "不羈奔放の鬼"
}

titleJp["莉格露"] = {
    ["永夜抄"] = "暗中蠢动的光虫",
    ["文花帖"] = "发光的虫群",
    ["求闻史纪"] = "暗中蠢动的光虫"
}

titleJp["米斯蒂娅"] = {
    ["永夜抄"] = "夜雀の怪",
    ["花映塚"] = "夜雀の怪",
    ["求闻史纪"] = "夜雀の怪",
    ["三月精O"] = "歌う夜雀"
}

titleJp["上白泽慧音"] = {
    ["永夜抄"] = "知識と歴史の半獣",
    ["永夜抄setting"] = "歴史喰い",
    ["文花帖"] = "堅苦しい歴史家",
    ["求闻史纪"] = "歴史喰いの半獣"
}

titleJp["因幡帝"] = {
    ["永夜抄"] = "地上の兎",
    ["花映塚"] = "幸運の素兎",
    ["文花帖"] = "飞び跳ねる兎の大群",
    ["求闻史纪"] = "幸運の素兎",
    ["儚月抄(小说)"] = "地上の兎",
    ["儚月抄(漫画)"] = "地上の兎",
    ["茨歌仙"] = "巧言令色の素兎"
}

titleJp["铃仙"] = {
    ["永夜抄"] = "狂気の月の兎",
    ["花映塚"] = "狂気の月の兎",
    ["文花帖"] = "视界を揺さぶる妖怪兎",
    ["绯想天"] = "狂気の赤い瞳",
    ["绯想天story"] = "晴嵐の赤眼",
    ["非想天则"] = "狂気の赤い瞳",
    ["深秘录"] = "禁視！狂気のくねくね兎",
    ["绀珠传"] = "地上の月兎",
    ["凭依华"] = "月面思考で波長の合わない妖怪兎",
    ["求闻史纪"] = "狂気の赤眼",
    ["儚月抄(小说)"] = "狂気の月の兎",
    ["儚月抄(漫画)"] = "狂気の月の兎",
    ["三月精S"] = "狂気の月の兎",
    ["铃奈庵"] = "地上のムーンラビット"
}

titleJp["八意永琳"] = {
    ["永夜抄"] = "月の頭脳",
    ["文花帖"] = "街の薬屋さん",
    ["求闻史纪"] = "蓬莱の薬屋さん",
    ["儚月抄(小说)"] = "月の頭脳",
    ["儚月抄(漫画)"] = "月の頭脳",
    ["三月精S"] = "月の頭脳",
    ["三月精V"] = "月の頭脳"
}

titleJp["蓬莱山辉夜"] = {
    ["永夜抄"] = "永遠と須臾の罪人",
    ["文花帖"] = "人間らしくないお姫様",
    ["求闻史纪"] = "永遠のお姫様",
    ["儚月抄(小说)"] = "永遠と須臾の罪人",
    ["儚月抄(漫画)"] = "永遠と須臾の罪人"
}

titleJp["藤原妹红"] = {
    ["永夜抄"] = "蓬莱の人の形",
    ["文花帖"] = "焼死しない人间",
    ["深秘录"] = "激熱！人間インフェルノ",
    ["凭依华"] = "自暴自棄で不死身の人間",
    ["求闻史纪"] = "红の自警队",
    ["茨歌仙"] = "不老不死の竹林案內人"
}

titleJp["射命丸文"] = {
    ["花映塚"] = "伝統の幻想ブン屋",
    ["文花帖"] = "伝統の幻想ブン屋",
    ["风神录"] = "里に最も近い天狗",
    ["绯想天"] = "伝統の幻想ブン屋",
    ["绯想天story"] = "風雨の鴉",
    ["地灵殿"] = "伝統の幻想ブン屋",
    ["文花帖DS"] = "捏造新聞記者",
    ["非想天则"] = "伝統の幻想ブン屋",
    ["天空璋"] = "紅葉を散らす天狗",
    ["文花帖(书籍)"] = "伝統の幻想ブン屋",
    ["求闻史纪"] = "伝統の幻想ブン屋",
    ["儚月抄(漫画)"] = "伝統の幻想ブン屋",
    ["三月精S"] = "伝統の幻想ブン屋",
    ["茨歌仙"] = "我田引水の天狗",
    ["铃奈庵"] = "鴉天狗のジャーナリスト"
}

titleJp["梅蒂馨"] = {
    ["花映塚"] = "小さなスイートポイズン",
    ["文花帖"] = "体に優しくない人形",
    ["求闻史纪"] = "小さなスイートポイズン"
}

titleJp["风见幽香"] = {
    ["花映塚"] = "四季のフラワーマスター",
    ["求闻史纪"] = "四季のフラワーマスター"
}

titleJp["小野塚小町"] = {
    ["花映塚"] = "三途の水先案内人",
    ["文花帖"] = "江戸っ子気質な死神",
    ["绯想天"] = "三途の水先案内人",
    ["绯想天story"] = "川霧の水先案内人",
    ["非想天则"] = "三途の水先案内人",
    ["求闻史纪"] = "三途の水先案内人",
    ["三月精S"] = "三途の水先案内人",
    ["三月精V"] = "三途の水先案内人",
    ["茨歌仙1"] = "拓落失路の死神",
    ["茨歌仙2"] = "三途の水先案内人"
}

titleJp["四季映姬"] = {
    ["花映塚"] = "楽园の最高裁判長",
    ["文花帖"] = "<del>口うるさい</del>有難いお話",
    ["求闻史纪"] = "地獄の最高裁判長",
    ["三月精V"] = "地獄の最高裁判長"
}

titleJp["秋静叶"] = {
    ["风神录"] = "寂しさと終焉の象徴",
    ["文花帖DS"] = "切なくなる紅い雨",
    ["求闻口授"] = "寂しさと終焉の象徴"
}

titleJp["秋穰子"] = {
    ["风神录"] = "豊かさと稔りの象徴",
    ["文花帖DS"] = "甘い匂いのする神様",
    ["求闻口授"] = "豊かさと稔りの象徴"
}

titleJp["键山雏"] = {
    ["风神录"] = "秘神流し雛",
    ["文花帖DS"] = "えんがちょマスター",
    ["求闻口授"] = "秘神流し雛"
}

titleJp["河城荷取"] = {
    ["风神录"] = "超妖怪弾頭",
    ["地灵殿"] = "超妖怪弾頭",
    ["文花帖DS"] = "水棲の技師",
    ["心绮楼"] = "河の便利屋さん",
    ["深秘录"] = "太古！三畳紀の河童",
    ["凭依华"] = "商売上手で守銭奴の河童",
    ["求闻口授"] = "超妖怪弾頭",
    ["三月精V"] = "水棲の技師",
    ["茨歌仙"] = "水平思考の河童",
    ["铃奈庵"] = "水の中のエンジニア"
}

titleJp["犬走椛"] = {
    ["风神录"] = "下っ端哨戒天狗",
    ["文花帖DS"] = "山のテレグノシス"
}

titleJp["东风谷早苗"] = {
    ["风神录"] = "祀られる風の人間",
    ["星莲船"] = "山の新人神様",
    ["非想天则"] = "祀られる風の人間",
    ["文花帖DS"] = "現代っ子の現人神",
    ["神灵庙"] = "我欲の巫女",
    ["神灵庙"] = "山の新人神様",
    ["绀珠传"] = "山に住む奇跡の現人神",
    ["求闻口授"] = "祀られる風の人間",
    ["茨歌仙"] = "皮相浅薄な人間",
    ["铃奈庵"] = "風と湖のテウルギスト"
}

titleJp["八坂神奈子"] = {
    ["风神录"] = "山坂と湖の権化",
    ["文花帖DS"] = "坂好きの神様",
    ["求闻口授"] = "山坂と湖の権化",
    ["茨歌仙"] = "独立不撓の神様"
}

titleJp["洩矢诹访子"] = {
    ["风神录"] = "土着神の頂点",
    ["非想天则"] = "土着神の頂点",
    ["文花帖DS"] = "両生類の神様",
    ["求闻口授"] = "土着神の頂点",
    ["茨歌仙"] = "名存実亡の神様"
}

titleJp["永江衣玖"] = {
    ["绯想天"] = "美しき绯の衣",
    ["非想天则"] = "美しき绯の衣",
    ["文花帖DS"] = "空飞ぶレアアイテム"
}

titleJp["比那名居天子"] = {
    ["绯想天"] = "非想非非想天の娘",
    ["非想天则"] = "非想非非想天の娘",
    ["文花帖DS"] = "有顶天のお嬢ちゃん",
    ["凭依华"] = "緋想的で浮世離れした天人",
    ["茨歌仙"] = "暖衣飽食の天人"
}

titleJp["琪斯美"] = {
    ["地灵殿"] = "恐るべき井戸の怪",
    ["文花帖DS"] = "秋の日の人食い"
}

titleJp["黑谷山女"] = {
    ["地灵殿"] = "暗い洞窟の明るい網",
    ["文花帖DS"] = "忍び寄る恐怖の気",
    ["求闻口授"] = "暗い洞窟の明るい網"
}

titleJp["水桥"] = {
    ["地灵殿"] = "地殻の下の嫉妬心",
    ["文花帖DS"] = "緑色の眼をした怪物",
    ["求闻口授"] = "地殻の下の嫉妬心"
}

titleJp["星熊勇仪"] = {
    ["地灵殿"] = "語られる怪力乱神",
    ["文花帖DS"] = "破滅的な金剛力",
    ["求闻口授"] = "語られる怪力乱神"
}

titleJp["古明地觉"] = {
    ["地灵殿"] = "怨霊も恐れ怯む少女",
    ["文花帖DS"] = "みんなの心の病み",
    ["求闻口授"] = "怨霊も恐れ怯む少女",
    ["茨歌仙"] = "孤影悄然の妖怪"
}

titleJp["火焰猫燐"] = {
    ["地灵殿"] = "地獄の輪禍",
    ["文花帖DS"] = "死体ツアーコンダクター",
    ["求闻口授"] = "地獄の輪禍",
    ["茨歌仙"] = "背信棄義の死猫"
}

titleJp["灵乌路空"] = {
    ["地灵殿"] = "熱かい悩む神の火",
    ["非想天则"] = "熱かい悩む神の火",
    ["文花帖DS"] = "地底の太阳",
    ["求闻口授"] = "熱かい悩む神の火"
}

titleJp["古明地恋"] = {
    ["地灵殿"] = "閉じた恋の瞳",
    ["文花帖DS"] = "何も考えていない者",
    ["心绮楼"] = "空想上の人格保持者",
    ["深秘录"] = "本怖！貴方の後ろにいるよ",
    ["凭依华"] = "意図せずに心を閉ざしたサトリ",
    ["求闻口授"] = "閉じた恋の瞳"
}

titleJp["纳兹琳"] = {
    ["星莲船"] = "ダウザーの小さな大将",
    ["文花帖DS"] = "卑近なダウザー",
    ["求闻口授"] = "ダウザーの小さな大将"
}

titleJp["多多良小伞"] = {
    ["星莲船"] = "愉快な忘れ傘",
    ["文花帖DS"] = "不憫な不法投棄物",
    ["神灵庙"] = "お困りの忘れ物",
    ["求闻口授"] = "愉快な忘れ傘",
    ["茨歌仙"] = "驚天動地の唐傘お化け"
}

titleJp["云山"] = {
    ["星莲船"] = "守り守られし大輪",
    ["文花帖DS"] = "大空に咲く花と親父",
    ["心绮楼"] = "圧倒する妖怪行者",
    ["深秘录"] = "驚愕！長身の入道使い",
    ["求闻口授"] = "守り守られし大輪",
    ["茨歌仙"] = "大山鳴動の大入道"
}

titleJp["云山"] = {
    ["星莲船"] = "守り守られし大輪",
    ["文花帖DS"] = "大空に咲く花と親父",
    ["心绮楼"] = "圧倒する妖怪行者",
    ["深秘录"] = "驚愕！長身の入道使い",
    ["凭依华"] = "頑固で巨体怪力な入道使い",
    ["求闻口授"] = "守り守られし大輪",
    ["茨歌仙"] = "一蓮托生の妖怪僧侶"
}

titleJp["村纱水蜜"] = {
    ["星莲船"] = "水難事故の念縛霊",
    ["文花帖DS"] = "惨憺たる大海原",
    ["求闻口授"] = "水難事故の念縛霊"
}

titleJp["寅丸星"] = {
    ["星莲船"] = "毘沙門天の弟子",
    ["文花帖DS"] = "妖獣の成り上がり",
    ["求闻口授"] = "毘沙門天の弟子"
}

titleJp["圣白莲"] = {
    ["星莲船"] = "封印された大魔法使い",
    ["文花帖DS"] = "ガンガンいく僧侶",
    ["心绮楼"] = "霊長類を越えた阿闍梨",
    ["深秘录"] = "極速！ライダー僧侶",
    ["凭依华"] = "超人的で悟りを開く大阿闍梨",
    ["求闻口授"] = "妖怪寺の魔住職",
    ["茨歌仙"] = "念仏三昧の大阿闍梨",
    ["铃奈庵"] = "妖怪寺のマスタープリースト"
}

titleJp["封兽鵺"] = {
    ["星莲船"] = "未確認幻想飛行少女",
    ["文花帖DS"] = "虎だったり鳥だったりする奴",
    ["神灵庙"] = "古の妖怪その１",
    ["求闻口授"] = "正体不明の正体",
    ["铃奈庵"] = "正体不明のアンノウンＸ"
}

titleJp["姬海棠果"] = {
    ["文花帖DS1"] = "今どきの念写记者",
    ["文花帖DS2"] = "初々しいスポイラー記者"
}

titleJp["幽谷响子"] = {
    ["神灵庙"] = "読経するヤマビコ",
    ["求闻口授"] = "読経するヤマビコ",
    ["茨歌仙"] = "平凡陳腐な山彦"
}

titleJp["宫古芳香"] = {
    ["神灵庙"] = "忠実な死体",
    ["求闻口授"] = "忠実な死体"
}

titleJp["霍青娥"] = {
    ["神灵庙"] = "壁抜けの邪仙",
    ["求闻口授"] = "壁抜けの邪仙",
    ["茨歌仙"] = "無理非道な仙人"
}

titleJp["苏我屠自古"] = {
    ["神灵庙"] = "神の末裔の亡霊",
    ["求闻口授"] = "神の末裔の亡霊"
}

titleJp["物部布都"] = {
    ["神灵庙"] = "古代日本の尸解仙",
    ["心绮楼"] = "龍脈を司る風水師",
    ["深秘录"] = "番町！皿を割る尸解仙",
    ["凭依华"] = "風水でお皿を割る尸解仙",
    ["求闻口授"] = "古代日本の尸解仙"
}

titleJp["丰聪耳神子"] = {
    ["神灵庙"] = "聖徳道士",
    ["心绮楼"] = "宇宙を司る全能道士",
    ["深秘录"] = "怪奇！二色マント魔人",
    ["凭依华"] = "全能で人の為に動く道士",
    ["求闻口授"] = "聖徳道士",
    ["茨歌仙"] = "天資英邁の仙人"
}

titleJp["二岩猯藏"] = {
    ["神灵庙"] = "化け狸 十変化",
    ["心绮楼"] = "いつも驚きを提供する化け狸",
    ["深秘录"] = "侵略せよ！宇宙妖怪狸",
    ["凭依华"] = "変幻自在で喰えない化け狸",
    ["求闻口授"] = "佐渡の二ッ岩",
    ["茨歌仙"] = "僅有絶無の外来妖怪",
    ["铃奈庵"] = "捕らぬ狸のディスガイザー"
}

titleJp["秦心"] = {
    ["心绮楼"] = "表情豊かなポーカーフェイス",
    ["深秘录"] = "戦慄せよ！悪夢の能面女",
    ["凭依华"] = "能面で感情的な面霊気",
    ["铃奈庵"] = "表情豊かなポーカーフェイス"
}

titleJp["若鹭姬"] = {
    ["辉针城"] = "淡水に棲む人魚"
}

titleJp["赤蛮奇"] = {
    ["辉针城"] = "ろくろ首の怪奇"
}

titleJp["今泉影狼"] = {
    ["辉针城"] = "竹林のルーガルー"
}

titleJp["九十九弁弁"] = {
    ["辉针城"] = "古びた琵琶の付喪神"
}

titleJp["九十九八桥"] = {
    ["辉针城"] = "古びた琴の付喪神"
}

titleJp["鬼人正邪"] = {
    ["辉针城"] = "逆襲のあまのじゃく",
    ["天邪鬼"] = "逆襲のあまのじゃく"
}

titleJp["少名针妙丸"] = {
    ["辉针城"] = "小人の末裔",
    ["深秘录"] = "眉唾！緑色をした小人",
    ["凭依华"] = "お伽噺的でお椀に乘る小人",
    ["铃奈庵"] = "輝く針のリリパット"
}

titleJp["堀川雷鼓"] = {
    ["辉针城"] = "夢幻のパーカッショニスト"
}

titleJp["宇佐见堇子"] = {
    ["深秘录"] = "深秘を曝け！秘封倶楽部 初代会長",
    ["凭依华"] = "神秘主義で扱いに困る女学生",
    ["噩梦日记"] = "秘封俱楽部初代会長",
    ["茨歌仙"] = "奢侈文弱な女子校生"
}

titleJp["清兰"] = {
    ["绀珠传"] = "浅葱色のイーグルラヴィ"
}

titleJp["铃瑚"] = {
    ["绀珠传"] = "橘色のイーグルラヴィ"
}

titleJp["哆来咪"] = {
    ["绀珠传"] = "夢の支配者",
    ["凭依华"] = "夢を見せる妖怪"
}

titleJp["稀神探女"] = {
    ["绀珠传"] = "舌禍をもたらす女神"
}

titleJp["克劳恩皮丝"] = {
    ["绀珠传"] = "地獄の妖精",
    ["三月精V"] = "狂気なる地獄の妖精"
}

titleJp["赫卡提亚"] = {
    ["绀珠传"] = "地獄の女神",
    ["三月精V"] = "地獄の女神"
}

titleJp["依神女苑"] = {
    ["凭依华"] = "最凶最悪の双子の妹"
}

titleJp["依神紫苑"] = {
    ["凭依华"] = "最凶最悪の双子の姉",
    ["茨歌仙"] = "粗衣粗食の貧乏神"
}

titleJp["爱塔"] = {
    ["天空璋"] = "神に近づく蝶の妖精",
    ["三月精V"] = "真夏のアゲハ蝶の妖精"
}

titleJp["坂田合欢乃"] = {
    ["天空璋"] = "浮世の関を超える山姥"
}

titleJp["高丽野阿吽"] = {
    ["天空璋"] = "神仏に心酔する守護神獣",
    ["茨歌仙"] = "神色自若の狛犬"
}

titleJp["矢田寺成美"] = {
    ["天空璋"] = "森で垂迹した魔法地蔵"
}

titleJp["尔子田里乃"] = {
    ["天空璋"] = "危険すぎるバックダンサーズ"
}

titleJp["丁礼田舞"] = {
    ["天空璋"] = "危険すぎるバックダンサーズ"
}

titleJp["摩多罗隐岐奈"] = {
    ["天空璋"] = "究極の絶対秘神",
    ["天空璋ex"] = "究極の絶対秘神",
    ["茨歌仙"] = "威風堂々たる神秘"
}

titleJp["森近霖之助"] = {
    ["求闻史纪"] = "香霖堂店主",
    ["儚月抄(漫画)"] = "動かない古道具屋",
    ["儚月抄(四格)"] = "小道具屋店主",
    ["茨歌仙"] = "知足不辱の古道具屋",
    ["铃奈庵"] = "古道具屋のキュリオスフェロー"
}

titleJp["桑尼"] = {
    ["妖精大战争"] = "輝ける日の光",
    ["求闻史纪"] = "悪戯好きな日の光",
    ["三月精E"] = "日の光",
    ["三月精S"] = "輝ける日の光",
    ["三月精V"] = "輝ける日の光"
}

titleJp["露娜"] = {
    ["妖精大战争"] = "静かなる月の光",
    ["求闻史纪"] = "静かなる月の光",
    ["三月精E"] = "月の光",
    ["三月精S"] = "静かなる月の光",
    ["三月精V"] = "静かなる月の光"
}

titleJp["斯塔"] = {
    ["妖精大战争"] = "降り注ぐ星の光",
    ["求闻史纪"] = "降り注ぐ星の光",
    ["三月精E"] = "星の光",
    ["三月精S"] = "降り注ぐ星の光",
    ["三月精V"] = "降り注ぐ星の光"
}

titleJp["绵月丰姬"] = {
    ["儚月抄"] = "海と山を繋ぐ月の姫"
}

titleJp["绵月依姬"] = {
    ["儚月抄"] = "神霊の依り憑く月の姫"
}

titleJp["稗田阿求"] = {
    ["记忆幻想乡"] = "幻想郷の記憶",
    ["铃奈庵"] = "九代目のサヴァン"
}

titleJp["茨木华扇"] = {
    ["深秘录1"] = "脅威！願いを訊く仙人",
    ["深秘录2"] = "思欲せよ！願いを叶える仙人",
    ["凭依华"] = "神仙思想で動物好きな仙人",
    ["三月精O"] = "片腕有角の仙人",
    ["茨歌仙"] = "片腕有角の仙人"
}

titleJp["本居小铃"] = {
    ["铃奈庵"] = "判読眼のビブロフィリア"
}

return titleJp